{"data": [{"author": "2shy2speakit", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2cauolu1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540910657, "domain": "self.Enneagram", "full_link": "https://www.reddit.com/r/Enneagram/comments/9sojwg/any_9s_out_there_that_are_in_management/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9sojwg", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 15, "num_crossposts": 0, "over_18": false, "permalink": "/r/Enneagram/comments/9sojwg/any_9s_out_there_that_are_in_management/", "pinned": false, "retrieved_on": 1540910658, "score": 1, "selftext": "What's your management style? Are you always overwhelmed and stressed to the point of not being able to breathe? I've been a manager for a year now. I can do it, but it takes everything in me to do my job. I'm often left unhappy, stressed and lonely. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Enneagram", "subreddit_id": "t5_2sdjj", "subreddit_subscribers": 7770, "subreddit_type": "public", "thumbnail": "self", "title": "Any 9s out there that are in management?", "url": "https://www.reddit.com/r/Enneagram/comments/9sojwg/any_9s_out_there_that_are_in_management/"}, {"author": "2shy2speakit", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2cauolu1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540376283, "domain": "self.AskReddit", "full_link": "https://www.reddit.com/r/AskReddit/comments/9qycql/describe_a_time_where_you_took_a_total_leap_of/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qycql", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskReddit/comments/9qycql/describe_a_time_where_you_took_a_total_leap_of/", "pinned": false, "pwls": 6, "retrieved_on": 1540376285, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i", "subreddit_subscribers": 20440649, "subreddit_type": "public", "thumbnail": "self", "title": "Describe a time where you took a total leap of faith and it actually all worked out?", "url": "https://www.reddit.com/r/AskReddit/comments/9qycql/describe_a_time_where_you_took_a_total_leap_of/", "whitelist_status": "all_ads", "wls": 6}, {"author": "2shy2speakit", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2cauolu1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540375357, "domain": "self.AskReddit", "full_link": "https://www.reddit.com/r/AskReddit/comments/9qy9hz/have_you_ever_taken_a_giant_leap_of_faith_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qy9hz", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskReddit/comments/9qy9hz/have_you_ever_taken_a_giant_leap_of_faith_and/", "pinned": false, "pwls": 6, "retrieved_on": 1540375358, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i", "subreddit_subscribers": 20440587, "subreddit_type": "public", "thumbnail": "self", "title": "Have you ever taken a giant leap of faith and succeeded?", "url": "https://www.reddit.com/r/AskReddit/comments/9qy9hz/have_you_ever_taken_a_giant_leap_of_faith_and/", "whitelist_status": "all_ads", "wls": 6}, {"author": "2shy2speakit", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2cauolu1", "can_mod_post": false, "contest_mode": false, "created_utc": 1539138971, "domain": "self.Psychic", "full_link": "https://www.reddit.com/r/Psychic/comments/9mvmgv/ive_had_an_ability_to_see_things_before_they/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9mvmgv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Psychic/comments/9mvmgv/ive_had_an_ability_to_see_things_before_they/", "pinned": false, "pwls": 6, "retrieved_on": 1539138972, "score": 1, "selftext": "It's hard for me to describe the way I want. I always see them in the corner of my eye or in straight, but distant view. Typically (though not every time) My visions are of people passing by, or something that I personally would see come to fruition within a few minutes. A lot of times the vision is me. ( Example: I see myself walk to the microwave or I see myself walk into a room) The color of my visions 9 times outta 10 is a milky white color and lacking real detail. Along with the vision comes a sense of knowing within my gut. I have been able to predict new household pets, people trying to sneak up on me, and things I would never be able to randomly guess. Sometimes the visions are in great detail and color. \n\nMy best friend thought I was crazy and didn't believe me when I told her about my ability. That was until one night...I told her I was getting annoyed by the constant vision of someone walking up the stairs in blue pajama pants. She freaked out, walked over to her bag she had packed and pulled out blue pants. And said....these?????Once she ran up the stairs, the vision was fulfilled and I no longer had a vision of it. (Sometimes my visions would replay till they were fulfilled)\n\nNow that I'm older, my visions have diminished greatly. But once upon a time I would have over 100 visions a day. I may get one or two a week, but am no longer very sensitive and don't really watch for the vision to be fulfilled. \n\nThere is a feeling of satisfaction when I do see the vision come true... And they always come true. Not very helpful as in a psychic dream where I save a bus load of people, but I was always 3 steps ahead of my mom when I was a teenager cause I always saw her coming 😉\n\nAnyone know what this is??? Does it have a name? Do you have info? This has been bugging me for over 20 years!\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Psychic", "subreddit_id": "t5_2qmhd", "subreddit_subscribers": 35512, "subreddit_type": "public", "thumbnail": "self", "title": "I've had an ability to see things before they happen all of my life. I'm looking for insight and answers", "url": "https://www.reddit.com/r/Psychic/comments/9mvmgv/ive_had_an_ability_to_see_things_before_they/", "whitelist_status": "all_ads", "wls": 6}, {"author": "2shy2speakit", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2cauolu1", "can_mod_post": false, "contest_mode": false, "created_utc": 1539092036, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9mp6m0/im_so_tired_of_feeling_this_way/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9mp6m0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9mp6m0/im_so_tired_of_feeling_this_way/", "pinned": false, "pwls": 6, "retrieved_on": 1539092038, "score": 1, "selftext": "I'll try to make this short and sweet, but knowing me it will turn into a long rant of spinning in circles. Sorry in advance.\n\nI'd like to welcome you inside my brain. Inside my heart. It's kind of cold in here, so you may want to grab a jacket. \n\nI'm in my late 20s. I haven't had the easiest of lives, but I didn't come here to cry about that. I like to believe I am an optimist and what I go through in live always has a purpose and there is always a light at the end of the tunnel. I've always been the quiet/shy type. As a kid I was practically scared of my own shadow. I have an over domineering mother who's parenting tactic was using tough and conditional love. My mother couldn't stay in a relationship to save her life and was often a very angry person. I was scared a lot at home.  We moved a lot. I went to over 8 different schools. Making friends was always a tough task. \n\nI moved out the first change I got. I was 18 years old and had no secure full time job. But I leaped. I took my college fund and I started my own life. Everything fell into place. I got an apartment,  a full time job, a wonderful boyfriend, and life was awesome. Being on my own was a huge eye opener for me. I realized the way I was raised and the things that I was taught to believe were not exactly how they were. I realized my mother didn't practice what she preached and I saw what a total mess she was. It was a tough 2 years of growing into my own person. I went through what I call my numbness stage. I couldn't feel anything. \n\nI've always had a melancholy personality. I'm not extremely outgoing. I'm reserved and sometimes I find beauty in sadness. Sadness really hits a part in my heart that makes me feel, well, alive or passionate. I've always had mild depression I guess you can say.\n\nWell, last winter... it hit me. The grenades of all grenades. I'll never forget it and it still brings tears to my eyes. I was getting ready one morning and out of no where came a moan. A moan of someone who was in total despair. It scared me. I jumped. What was that??? IT WAS ME! It was like a buildup of emotion that I had hidden under a heavy layer of internal protection finally came to the surface. Like a pimple getting ready to pop. Then the thoughts started happening. Something I had never experienced before. I had no control. I'd get vivid images of me killing myself. There is really no soft way to put it. I didn't want to die, but the thoughts in my head surely did.\n\nSo, I got help. I found a therapist in my area who is extremely well respected. Within two appointments she suggested I get back on ADD medication. (I've been diagnosed several times, although I'm still skeptical) She believes that my depression is caused by my inability to handle life because of my ADD. Fair enough. I did feel like I couldn't do anything. I didn't want to do anything. My place was a mess, I was a mess. I didn't care about my appearance. So sure, I'd go to my doc and get put back on meds.\n\nSo I did. And it was fantastic for 4 solid months. I felt GREAT! Like a new person. I just kept thinking, my cure is in this little pill and this is all I needed all along. Vyvanse saved my life! Until one morning I woke up and I couldn't move. I didn't want to move and the sludge was back in my bones. I went from feeling awesome to waking up and being straight back into my depression nightmare from before. The thoughts, the rust on my wheels, the inability. It's all back.  And now we're going on 2 months of this..\n\nSo I go back to my therapist. We talk about this. She now thinks that I need to leave my job. Sure, I probably do. It's a train wreck and takes a lot out of me. It's never ending and takes everything I have. I'm a manager. Being the reserved type, I've had to learn how to step out of my comfort zone, turn off my emotions and do what I need to do while on the clock. I know it's taking a toll on me. But then I think back... I've struggled at every job I've ever had. (my therapist points out that I have struggled for different reasons... but I see a common cause) It's like I feel trapped and caged and all work no play makes me very dull. I don't want to work. I don't want responsibilities. Everything is a drag for me; everything is hard work.  It's stupid. Mind over matter...... Mind over matter..... But that doesn't work. I am actively looking for a new job... but it's not a quick process.\n\nI've started writing in a notebook. Be more active, eat healthier, stay on a schedule, don't be so lazy, no more tv binging... And it always helps for a few days until it doesn't help at all. I go right back to who I am at my core. Depressed, lazy, lonely and sad.. just so sad.\n\nI'm scared of depression meds. I don't want to be numb. I can't be numb. It's a tactic I already do without meds and it's a nightmare if I go too far into the numbness. I want to feel, I just don't want to feel this depression! I don't want my libido to go away. I just got married! We are very happy in our relationship (probably the happiest we have ever been!) And last but not least, I don't want to be removed from my ADD meds because they often times are the only thing that gets me through the day. The boost of dopamine they give me when it starts to kick in is the only good feeling I feel throughout the day. Maybe I need an increase in the ADD meds, maybe I need put on a couple different meds.. I just don't know.\n\nSee, I warned you about the circles I'd go in.  My problem is that I have a gift and a curse of being able to see all angles. It helps me understand people. But when it comes to myself, all I do is get confused. Too many possibilities, too many connections, too many discrepancies. I spiral. Bottom line is I just want happiness. I need happiness... I have to have it.\n\nThoughts?\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;\n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 394246, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm so tired of feeling this way", "url": "https://www.reddit.com/r/depression/comments/9mp6m0/im_so_tired_of_feeling_this_way/", "whitelist_status": "all_ads", "wls": 6}]}