{"data": [{"author": "abubblelala", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2l1xc0f2", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542537420, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/9y51vi/sex_with_my_boyfriend_21m_brings_up_tears_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9y51vi", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/sex/comments/9y51vi/sex_with_my_boyfriend_21m_brings_up_tears_and/", "pinned": false, "pwls": 1, "retrieved_on": 1542537421, "score": 1, "selftext": "I have a really healthy relationship with my boyfriend when it comes to everything but sex. I was a virgin until I met him 9 months ago. Even so, it was hard to get into my sexuality because of my past. I was raped when I was 18 and I’m still having a tough time getting over it. The first time he tried to have sex with me, I couldn’t relax which made me tight and it hurt (I’m petite and he’s pretty big in both ways) and I got so frustrated with it all that I started to cry. \n\nIt took a few weeks and a bath together for me to finally relax and enjoy each other. However, most of the time I start to cry during sex. Sometimes its because I am overwhelmed with emotion. Sometimes it brings me back to when I was 18. Overall though, my problems were getting better and we had a more intimate and fun sex life. Sometimes we would do it 3 times in one day if I wished! Now it’s getting worse. \n\nI started my college semester and the stress has been through the roof! I’m finding it hard to get wet even if I’m by myself wanting to have a little fun. Sometimes my boyfriend is forced to go away for weeks due to his job but every time we go long periods without sex, that anxiety comes back. I’m not excited like I usually am, I get scared which makes having sex difficult. I love him so very much and he’s been so patient and gentle with me. Neither of us are insecure about our bodies and I feel completely safe with him at all times. We communicate very openly but I just don’t understand why I can’t get out of my head. What steps do I need to take to have a healthier relationship with sex?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 1048934, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Sex with my boyfriend (21M) brings up tears and lots of emotions (20F).", "url": "https://www.reddit.com/r/sex/comments/9y51vi/sex_with_my_boyfriend_21m_brings_up_tears_and/", "whitelist_status": "house_only", "wls": 1}, {"author": "abubblelala", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2l1xc0f2", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542139081, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wsho5/im_facing_the_consequences_of_the_poor_personal/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wsho5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wsho5/im_facing_the_consequences_of_the_poor_personal/", "pinned": false, "pwls": 0, "retrieved_on": 1542139082, "score": 1, "selftext": "I have been depressed and had anxiety since I was 12 but officially diagnosed and committed at 16. I’m currently 20 years old. It all stems from a dysfunctional home life. My dad was an abusive alcoholic and my mom didn’t know how to connect emotionally with me. I was very sensitive and cried all the time. It got worse during my school years. I was bullied and didn’t have great friends yet I excelled in school and extracurricular to avoid negative interactions. \n\nHigh school I stopped trying. I stopped brushing my teeth, showering, doing my hair, bothering with my outfits, etc. hoping somehow I’d die from my neglect.  I got diagnosed and have been trying to pick up the pieces ever since. I reverted back to these damaging behaviors my freshman and sophomore year of college. Now I’m paying the price. I’m borderline underweight, small appetite, and I’ve needed so many root canals and fillings that my family is making fun of me. The guilt I have from this depression behavior is really affecting my ability to heal. I feel as if it’s my fault I have these problems and so I fall into a depression and the behavior starts again. I feel as if I don’t deserve to heal because I did this to myself. I have a boyfriend to live for and dreams I want to fulfill so I’m desperately trying to get better. I cry because I feel like I cut my lifespan in half due to my neglect. Now I want to live a long healthy life.\n\nMy question is how do accept it and not beat myself up over what my Illness made me do to myself? I’m tired of feeling like it solely is my fault (technically it is) when I’ve been asking for help from my parents for so long. I’m ready to heal and move on.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 405406, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I’m facing the consequences of the poor personal hygiene I had during my depression. It makes me feel guilty. How do I shake this guilt while focusing on forgiveness and healing?", "url": "https://www.reddit.com/r/depression/comments/9wsho5/im_facing_the_consequences_of_the_poor_personal/", "whitelist_status": "no_ads", "wls": 0}, {"author": "abubblelala", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2l1xc0f2", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542013763, "domain": "self.relationship_advice", "full_link": "https://www.reddit.com/r/relationship_advice/comments/9wci84/mom_doesnt_want_me_spending_christmas_with_my/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wci84", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 23, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationship_advice/comments/9wci84/mom_doesnt_want_me_spending_christmas_with_my/", "pinned": false, "pwls": 6, "retrieved_on": 1542013763, "score": 1, "selftext": "So I’m 20 years old and I’m really enjoying my first relationship. My boyfriend is 21 and serves in the army. I’m a junior in college. It’s been 9 months so far. We met in January and we were so crazy about each other that we wanted to meet each other’s family. So of course, I traveled with him to his home state in July and fell in love with his family and his hometown over a two week period . My family equally enjoyed him at Easter dinner. He’s been away on missions for awhile so we decided it would be nice if we could travel again to his hometown for his Christmas leave. I told my mom and it didn’t go so well. She got so very angry and said I should get to know him first and that it’s only appropriate that I stay with my family for Christmas and he stay with his. The thing is he begged me to go. And we make each other so very happy. And my family is kinda toxic sometimes so I thought it would be a nice break.  But no, my mom was pissed and it really upset my boyfriend. She told me to go on my vacation and never come back home. I’m heartbroken really. I’ve always been a good daughter but I was really sheltered. But we both have such a genuine connection! My question is should I fight this? Or is my mom correct to keep me home for the holidays? She’s not paying for it, and I only come home for holidays and breaks. I don’t know how to cross the border into adulthood and dating because my family makes it hard. Thank you! Sorry this is so long.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn", "subreddit_subscribers": 931704, "subreddit_type": "public", "thumbnail": "self", "title": "Mom doesn’t want me spending Christmas with my boyfriend and his family.", "url": "https://www.reddit.com/r/relationship_advice/comments/9wci84/mom_doesnt_want_me_spending_christmas_with_my/", "whitelist_status": "all_ads", "wls": 6}]}