{"data": [{"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_ovehc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542291541, "domain": "self.BPD", "full_link": "https://www.reddit.com/r/BPD/comments/9xbk3m/dae_feel_like_positive_thinking_feels_fake/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xbk3m", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "qu", "link_flair_richtext": [], "link_flair_template_id": "ceea27ec-e453-11e4-acc3-22000b3886d8", "link_flair_text": "Questions", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/BPD/comments/9xbk3m/dae_feel_like_positive_thinking_feels_fake/", "pinned": false, "pwls": 0, "retrieved_on": 1542291542, "score": 1, "selftext": "I hope this is flared correctly, wasn't sure if I should tag it as \"questions\" or \"venting\" but here goes I guess.\n\nSo for the past week or so, I've been trying really hard to redirect negative feelings. Whenever I feel myself start to get really depressed or angry or anxious, I've been doing my best to make them constructive. I'll write my feelings/thoughts down and list objective truths. Like for example, if I feel like I'll never have a relationship, I'll write how I feel about it and then write down objective truths such as \"My worth isn't based on a relationship\" or \"it'll happen when it's ready\" and it does actually work really well. I stop feeling bad and I'm able to go back to how I felt before I was triggered by something that made me upset.\n\nThe thing is, I feel good and all but also... empty? I'm so used to carrying around negative feelings. I'm so used to just breaking down and wallowing in my emotions. So when I bring myself to a baseline level of content after feeling bad, I just feel weird. I feel like I didn't experience the bad emotion as completely as I was \"supposed to\" but why would I want to? I don't like being depressed or upset. I like that I'm starting to be able to regulate my emotions for once instead of ignoring them until they explode or something. But I feel like I extinguished something that wasn't meant to be I guess? It just feels improper, even when it feels good and healthy. I almost feel like I'm depriving myself of an emotion I'm meant to have, that I've always had. I'm supposed to be depressed, right? It's all I've ever known.\n\nI'm really proud of this progress though. Maybe it's because I'm still adjusting? It's only been around a week. Does it get less awkward or uncomfortable to do? To I begin to feel more authentic as I continue to do it? Will I always just feel this weird when I regulate my feelings like this?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "BPD", "subreddit_id": "t5_2qqdp", "subreddit_subscribers": 42535, "subreddit_type": "public", "suggested_sort": "top", "thumbnail": "self", "title": "DAE feel like positive thinking feels fake?", "url": "https://www.reddit.com/r/BPD/comments/9xbk3m/dae_feel_like_positive_thinking_feels_fake/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_ovehc", "can_mod_post": false, "contest_mode": false, "created_utc": 1539907918, "domain": "self.ptsd", "full_link": "https://www.reddit.com/r/ptsd/comments/9peqyf/my_therapist_said_i_wasnt_rapedassaulted_i_dont/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9peqyf", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "venting", "link_flair_richtext": [], "link_flair_template_id": "b48cb46a-dae3-11e4-96c9-22000bb30a57", "link_flair_text": "Venting", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 41, "num_crossposts": 0, "over_18": false, "permalink": "/r/ptsd/comments/9peqyf/my_therapist_said_i_wasnt_rapedassaulted_i_dont/", "pinned": false, "retrieved_on": 1539907919, "score": 1, "selftext": "Apologies in advance if what I'm writing doesn't make sense. I'm very tired and also currently dissociating and I don't know if what I'm saying makes sense or if it sounds repetitive. Forgive me.\n\nI got back from the therapist today. I hadn't seen her for over a month, and in between that time period I came to the realization that I think I was raped by my abusive partner. So naturally, I told her that today.\n\nShe said she didn't think it was rape, or even sexual abuse. She said it was certainly emotionally abusive, but nothing else. Because I did technically consent. \n\nFor context, he oftentimes tried very hard to persuade me when he wanted me to sleep with him. It wasn't that I didn't want to do it at all. We weren't technically dating or anything (it was a very complicated situation) and I told him several times that I didn't want to sleep with him if we weren't going to date each other because I had very strong feelings for him and I wasn't interested in casually sleeping with anyone. \n\nThese would turn into episodes an lasting an hour or longer of him trying to persuade me. Sometimes he would be very sweet about it, but each time he would tell me that he was \"helping\" me because he was \"giving me attention\" and he knew I was very lonely and used it to his advantage. I kept saying I didn't feel comfortable with it. But somehow, I always said yes to it, he always turned my no into a yes. I felt he was right, that he was really helping me out because what little he was doing was better than nothing, even if it hurt. Even if I didn't really want to do it and I expressed that to him several times and even cried about it in front of him a few of those times. It always ended up that I would drive over to his home and then I'd end up sleeping with him. And then I would leave and not feel good, like something bad happened but I couldn't place what.\n\nThe last time this occurred was earlier in the year. I only came to this realization maybe a few weeks ago and since then, my mind has felt like it's been ripped to shreds. For the longest time, I didn't want to think it was anything more than just sleeping with him. But then I learned somewhere that sex by coercion or by being worn down is rape, because consent was not freely given.\n\nBut then today, my therapist told me that because I never said no past the moment where I finally agreed, or because force was never used or because he never intoxicated me or anything, then it wasn't rape. Not even sexual abuse or assault. She said I did technically consent (which is true, because I did say yes) and therefore he had no way of knowing. Which I felt was maybe a fair point. It's why I had been wrestling with myself about this, because I know legally there's not much that can be done.\n\nShe mentioned that she wanted to work with me on my self-esteem and self-worth issues because she said that I had gotten myself into that situation because I didn't feel valuable enough. Which is true, I think. But when she worded it like that, it felt like there was blame being put on me. That because I feel bad about myself, I let this happen. I tried to be strong and express to him that I didn't want to sleep with him. I tried several times, I tried for hours on end. But somehow, he got me to throw the towel in. It wasn't that I never tried to contest how I felt, that I never said no to anything. I tried to tell him, I just gave up when I realized that my no didn't mean anything to him. I will agree that I do think I had the option to not sleep with him, but I had felt so weak, and I loved him. I didn't know what else to do. I do feel like he took advantage of my weakness and my feelings for him, I feel like a well adjusted person would have understood the first time I said I didn't want to sleep with them and that they would have ended it there. But my abuser didn't care.\n\nTo add, very early on in our relationship, he did sexual assault me. I explicitly said no to sexual contact and he went ahead anyway. My therapist knows about this and she agreed that that interaction was indeed sexual assault. But I feel like that makes it even worse, that at one point he did very intentionally disregard my no and went on to touch me anyway. He was already a person who was prone to disregarding consent. \n\nI now have no idea what happened to me. All I know is that it hurts, I'm even more confused than ever before. I left my therapist's office feeling worse than when I walked in. It would be one thing if she only meant this on a legal standpoint, I had known that I could realistically never take it to the law and have anything happen because I know how nebulous it is. But then when I hear people say things like \"if you were worn down or coerced until you said yes, then you never really said yes in the first place\" and then to hear the opposite from a professional...I don't know what to do or what to think.\n\nI'm feeling like I'm overreacting. That I'm being sensitive and maybe that I'm lying to myself when I'm saying that I never felt like I was freely able to consent. I could have done many things, I never had to go through with it, but for whatever reason, I complied. Deep down, I feel like I didn't have a choice. But maybe I'm making it all up. I don't know. I feel like I've been triggered because one time before, I told someone I was with at one point about the assault, and he said that I \"should have said no harder.\" And part of me feels like it's happening again. That maybe no one believes me. But I don't think even I believe myself anymore. It doesn't matter how hard I scream when someone touches me, or how badly I panic when someone stands too close to me, or when I have nightmares that my abuser is back, or that I freeze up when I start to remember what happened. Maybe it wasn't that bad. But I just can't tell anymore and that's the absolute worst part.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ptsd", "subreddit_id": "t5_2qm0x", "subreddit_subscribers": 17379, "subreddit_type": "public", "suggested_sort": "new", "thumbnail": "self", "title": "My therapist said I wasn't raped/assaulted. I don't know what's happened to me anymore. TW: rape, sexual assault", "url": "https://www.reddit.com/r/ptsd/comments/9peqyf/my_therapist_said_i_wasnt_rapedassaulted_i_dont/"}, {"author": "Activated_Raviolis", "author_flair_background_color": "", "author_flair_css_class": "modmsg", "author_flair_richtext": [], "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_ovehc", "can_mod_post": false, "contest_mode": false, "created_utc": 1539815690, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9p3dot/i_get_abused_because_im_a_bad_person/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9p3dot", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9p3dot/i_get_abused_because_im_a_bad_person/", "pinned": false, "pwls": 0, "retrieved_on": 1539815690, "score": 1, "selftext": "I have PTSD because I have been emotionally abused and sexually assaulted and raped throughout my life. It hurts. Every day hurts. I've been fantasizing about killing myself for a long while now. Being raped has ruined my life. I will never be the same again. I'm in therapy and I don't know if it's worth it anymore. I cant erase what happened, and no one would love me because I have been raped and abused and assaulted. My last partner left me because of all of this. When I tell someone about the abuse, they get weird on me and get distant. I am incapable of being loved ever again. I don't believe I was ever capable of being loved in the first place because if I was then bad things would have never happened to me.\n\nI have something to do this weekend and then a week full of work. After that, I get a few days off and if I do something to myself then so be it. I need a break. My entire life has been bad and I just want a break.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 105344, "subreddit_type": "public", "thumbnail": "self", "title": "I get abused because I'm a bad person.", "url": "https://www.reddit.com/r/SuicideWatch/comments/9p3dot/i_get_abused_because_im_a_bad_person/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_ovehc", "can_mod_post": false, "contest_mode": false, "created_utc": 1538354215, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/DEG/comments/9kbm5l/a_response_to_the_opinions_ive_seen_of_this_song/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9kbm5l", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 43, "num_crossposts": 0, "over_18": false, "permalink": "/r/DEG/comments/9kbm5l/a_response_to_the_opinions_ive_seen_of_this_song/", "pinned": false, "retrieved_on": 1538354216, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "DEG", "subreddit_id": "t5_2svb6", "subreddit_subscribers": 949, "subreddit_type": "public", "thumbnail": "default", "title": "A response to the opinions I've seen of this song lately.", "url": "https://i.redd.it/8sxe4fodzgp11.jpg"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_ovehc", "can_mod_post": false, "contest_mode": false, "created_utc": 1538202069, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9jue1u/i_want_people_to_hate_me/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9jue1u", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9jue1u/i_want_people_to_hate_me/", "pinned": false, "pwls": 6, "retrieved_on": 1538202070, "score": 1, "selftext": "I got out of an emotionally/sexually abusive relationship earlier this year, I started recovery with therapy + meds and it worked for a while. I'm diagnosed with manic depression plus anxiety and PTSD, working on a bpd diagnosis as well.\n\nI did really well for months, felt like a normal happy human being every day. Then the flashbacks of my relationship (which included a sexual assault) fucked me up. Now I'm back where I started.\n\nI just took more klonopin than I needed to and now I'm sitting in my room, kinda fucked up right now, wanting to die because I don't understand why no one loves me. I've worked so hard with so little to show for it. Asking for love got me abused and hurt and got me in a situation where I have ptsd and nothing but fear and anger. So maybe I want for everyone to hate me instead because at least then I'll know what people truly think of me.\n\nThis entire week, I've reached out to people I care about and received nothing but cold shoulders. My therapist talks about having a good support system but it's been failing me lately. \n\nEarlier this year, a friend of mine died in a car accident. I cant stop thinking about how it should have been me instead. \n\nI apologize for rambling. I'm doped up right now and I just want someone to love me. That's all I've ever asked for in my entire life but apparently that's too much to ask for.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 391081, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I want people to hate me.", "url": "https://www.reddit.com/r/depression/comments/9jue1u/i_want_people_to_hate_me/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534184080, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/ComedyCemetery/comments/970p6t/john_wojacks_chad_twin/", "id": "970p6t", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/ComedyCemetery/comments/970p6t/john_wojacks_chad_twin/", "pinned": false, "pwls": 0, "retrieved_on": 1534184080, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ComedyCemetery", "subreddit_id": "t5_2zzho", "subreddit_subscribers": 344063, "subreddit_type": "public", "thumbnail": "default", "title": "John, Wojack's Chad twin.", "url": "https://i.redd.it/9niczejfjwf11.jpg", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1530075338, "domain": "self.proED", "full_link": "https://www.reddit.com/r/proED/comments/8u6u7z/fear_and_difficult_discussionsbinge_fuel/", "id": "8u6u7z", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "rantrave", "link_flair_richtext": [{"e": "text", "t": "Rant/Rave"}], "link_flair_template_id": "9143bd04-5f3b-11e6-92f1-0e4e7226e7a7", "link_flair_text": "Rant/Rave", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/proED/comments/8u6u7z/fear_and_difficult_discussionsbinge_fuel/", "pinned": false, "pwls": 0, "retrieved_on": 1530075340, "rte_mode": "markdown", "score": 1, "selftext": "I spent nearly all day at work dissociating. I don't really think I got much done, but I don't really remember either. I finally told my mother about my sexual assault and she handled it like a champ. Today has been nothing but hard conversations. I've spent the past week in a really deep depressive episode. I was convinced that I was going to off myself when I got home actually. \n\nAs a result, I binged today. I hit 125, which was my original weight right before my life got really bad and I got fat. I really didn't want to eat, but I felt so stressed that I just had to. I feel like I ruined the flatter stomach I had today. \n\nBecause of today's events, my need for a new therapist has gone way up. I'm terrified that if I start seeing someone then I won't lose anymore weight. At the same time, I really want the help. \n\nI don't want to go to work tomorrow, but I feel like I have to. I want nothing more than to rest because restricting+dissociating constantly for a week has worn me out completely. \n\nSorry for the disjointedness of this post, I am running on fumes and a nap hasn't even helped. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "proED", "subreddit_id": "t5_38934", "subreddit_subscribers": 25443, "subreddit_type": "public", "thumbnail": "self", "title": "Fear and difficult discussions=binge fuel", "url": "https://www.reddit.com/r/proED/comments/8u6u7z/fear_and_difficult_discussionsbinge_fuel/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528962128, "domain": "self.BPD", "full_link": "https://www.reddit.com/r/BPD/comments/8qzzz0/a_vent_about_bpd_and_a_crush_on_my_fp/", "id": "8qzzz0", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/BPD/comments/8qzzz0/a_vent_about_bpd_and_a_crush_on_my_fp/", "pinned": false, "pwls": 6, "retrieved_on": 1528962129, "rte_mode": "markdown", "score": 1, "selftext": "Sorry for the incoming wall of text, I've been building up emotions for months now and I'm relieved that I can let in out in a place like this.\n\nI've finally come to terms with the fact that I most likely have BPD. I've set up an appointment with a psychiatrist, but it won't be for another month or so. I was ashamed and scared about it for so long, hoping that it was anything else, especially because my abuser/abusers had BPD and I wanted desperately to not have that in common with them.\n\nLately, things have been extremely rough for me. Between my declining physical health, relationship issues, an eating disorder, relapse into self harm, among everything else, I'm having an extremely hard time holding on to anything anymore, especially hope.\n\nI recently had a new FP come into my life and it's tearing me apart. They're a friend I met online, and we hit it off really well. We even met up before. I also developed a giant crush on this person, which hurts the most because it's so unobtainable. \n\nThey still have major feelings for their ex, who I suspect is their FP. I'm not a doctor but I see a lot of BPD traits in this person, they've said/done a lot of things before in the past that make me think \"Ding Ding Ding!! That's borderline\"\n\nJealousy is a feeling I forgot I had, I'm so torn about it all. I'm upset because I can't be good enough to ever compare to their ex. I've been declining so much that I could never be good enough. Sometimes my FP will flirt with me or say or do things that make me thing I have a chance, but then they'll talk about how much they miss their ex, or even just hang out with someone else and it's a giant trigger! Lately, my FP has been distant more than usual because I've been feeling worse and it's triggering me even more.\n\nI try everyday not to be like this. The reason why I decided to get mental help again is because I know how awful and unhealthy this is. At the same time, I feel like I have no control over this. Every romantic relationship I've been in has fallen apart because of my mental illness, because I'll get so clingy and demanding. I'm tired of this happening and I'm distraught because it's happening again right in front of me and I don't know how to stop it. I don't know if I realistically have a chance with this person, but it'll never work if I don't get better.\n\nI'm so tired of feeling like or knowing I don't deserve to have someone love me because of how sick I am. It's not just this one thing, nothing about me right now is healthy. Yet all I crave is someone who wants to be with me even though I know I don't deserve it. I hate it.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "BPD", "subreddit_id": "t5_2qqdp", "subreddit_subscribers": 33513, "subreddit_type": "public", "suggested_sort": "top", "thumbnail": "self", "title": "a vent about BPD and a crush on my FP", "url": "https://www.reddit.com/r/BPD/comments/8qzzz0/a_vent_about_bpd_and_a_crush_on_my_fp/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528951034, "domain": "self.proED", "full_link": "https://www.reddit.com/r/proED/comments/8qz22y/dae_use_old_pics_of_themselves_as_thinspoinspo/", "id": "8qz22y", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "disc", "link_flair_richtext": [{"e": "text", "t": "Discussion"}], "link_flair_text": "Discussion", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/proED/comments/8qz22y/dae_use_old_pics_of_themselves_as_thinspoinspo/", "pinned": false, "pwls": 0, "retrieved_on": 1528951036, "rte_mode": "markdown", "score": 1, "selftext": "Does anyone else use older pictures of themselves as inspo? I have full body selfies from when i was around 105-110 and its such effective thinspo because ***holy shit i looked great when I was that small.*** Its way more effective for me than looking at images of other people because I actually know what I'm going to look like when I get that small again. The irony is that when i was that small, my eating disorder was in \"remission\". I had struggled a little bit before, but not nearly as much as I currently am, and the the weight loss was unintentional due to the meds I was taking at the time.\n\nI also use pics from when I was at my HW as reverse thinspo because I looked so bad back then and it's a great deterrent from ever getting that big again.\n\nDoes anyone else do this? It feel so vain to be combing through pictures from like 6-7 years ago but it's such a motivator for losing this weight. It's a relief knowing what I'll look like when I get back to being that small again (slightly smaller actually since my UGW is around 100) and knowing that I'm going to finally look cute af for the first time in years.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "proED", "subreddit_id": "t5_38934", "subreddit_subscribers": 24876, "subreddit_type": "public", "thumbnail": "self", "title": "DAE use old pics of themselves as thinspo/inspo?", "url": "https://www.reddit.com/r/proED/comments/8qz22y/dae_use_old_pics_of_themselves_as_thinspoinspo/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1525675548, "domain": "self.Anxiety", "full_link": "https://www.reddit.com/r/Anxiety/comments/8hljgw/i_made_a_huge_mistake_while_driving_and_i_cant/", "id": "8hljgw", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/Anxiety/comments/8hljgw/i_made_a_huge_mistake_while_driving_and_i_cant/", "pinned": false, "pwls": 0, "retrieved_on": 1525675549, "rte_mode": "markdown", "score": 1, "selftext": "To preface; I'm have only been driving for a year or so, so I don't have a lot of experience. I'm usually an okay driver, if not lacking confidence when I drive. I have mild driving anxiety on top of my general anxiety, it used to be much worse but it's improved since.\n\nI was really tired tonight, I worked all day and ran errands all night. I was running on little sleep and jittery from energy drinks to try to stay awake for the rest of the day until I got home. \n\nI was driving in an unfamiliar area and it was very dimly lit, I was turning left on a 4 way intersection and accidentally turned onto the other lane. Basically I was driving the wrong way for all of 2 seconds. It was mostly empty out so thankfully I didn't hit anyone or anything, but I'm sure people saw and I'm feeling really bad about it now. I was about to turn around really quickly and make a u turn. \n\nI just can't stop thinking about it. I have never made such a big mistake while driving before and I feel so bad about it. I could have hurt/killed someone or myself had I not been out at midnight or so. I can't stop beating myself up about it because that's such a dumb mistake to make...I'm scared that my anxiety over what happened tonight will just make my driving skills worse bc I'm going to be self conscious about it.\n\nTL;DR: drove the wrong way tonight because I was really tired and now I'm worried that I'm the worst driver in the world.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Anxiety", "subreddit_id": "t5_2qmij", "subreddit_subscribers": 169597, "subreddit_type": "public", "thumbnail": "self", "title": "I made a huge mistake while driving and I can't stop being anxious about it.", "url": "https://www.reddit.com/r/Anxiety/comments/8hljgw/i_made_a_huge_mistake_while_driving_and_i_cant/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517690108, "domain": "self.lonely", "full_link": "https://www.reddit.com/r/lonely/comments/7v1wh5/i_want_you_because_i_dont_think_i_can_do_better/", "id": "7v1wh5", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 15, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/lonely/comments/7v1wh5/i_want_you_because_i_dont_think_i_can_do_better/", "pinned": false, "retrieved_on": 1517759620, "rte_mode": "markdown", "score": 13, "selftext": "You're an asshole. You barely talk to me unless you want something from me. When I come to you asking for someone to talk to because I feel like I'm dying, you're so fucking cold. Why do I want you so bad? Because I know for a fact that I can't get anything better than what little I have with you. People time and time again have left me because they can't deal with me. You at least kind of stick around and it gives me hope.\n\nI'm so fucking lonely. But when you acknowledge me I feel normal for at least a moment. But then you're gone and it hurts all the time.", "spoiler": false, "stickied": false, "subreddit": "lonely", "subreddit_id": "t5_2qjny", "subreddit_type": "public", "thumbnail": "self", "title": "I want you because I don't think I can do better (sad rant)", "url": "https://www.reddit.com/r/lonely/comments/7v1wh5/i_want_you_because_i_dont_think_i_can_do_better/", "whitelist_status": "promo_adult_nsfw"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1515794348, "domain": "self.SanctionedSuicide", "full_link": "https://www.reddit.com/r/SanctionedSuicide/comments/7q02yi/why_i_cant_do_this_anymore/", "id": "7q02yi", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/SanctionedSuicide/comments/7q02yi/why_i_cant_do_this_anymore/", "pinned": false, "retrieved_on": 1515863200, "score": 1, "selftext": "Hopefully this is the appropriate subreddit, I have a lot of feelings (mainly suicidal) That I need to vent.\n\nI've struggled with major depression since I was a young child, over half my life. It turned into other things as well like an eating disorder, anxiety, possible bipolar disorder and even possible ptsd. I say possible because my psychiatrist doesn't want to do listen to me or anything but give me Ritalin for whatever reason, partially the reason why I gave up on the mental health care system.\n\nBut I'm so fucking tired. I've always been told that life will get better once I start doing things, like driving and getting a job. I'm still just as suicidal now as I was 10 years ago. At least years ago people took my feelings to heart when I told them how bad i felt, but now everyone kind of throws it to the wayside because they've heard it a million times before. Most people don't give me any mind anymore and it's so damn isolating. I've lived my entire life with an extreme feeling of loneliness and I can't take it any longer. \n\nThe only thing keeping me alive for all this time was the possibility of finding a partner who actually gives a shit about me. I've lost faith with that as well. Men have dumped me and cited my mental illness as the reason why they couldn't be with me anymore. The result is the same whether or not I go through treatment. The guy I currently have feelings for has flat out told me that I'd be cuter if I wasn't so crazy. If people in my life don't leave me upfront, they treat me like shit and put me through hell before leaving. I hang onto every man who comes my way because for a short period of time it's a distraction and I feel ok again. But they always leave me or hurt me and then I'm back at square one. This cycle of abuse and pain feels like it will never end for me, so why not just end it myself at the source? \n\nPeople aren't created equal, and that's certainly the case for me. I'm ugly, I'm fat, I'm sick, I'm unlikable, and I'm unintelligent. This has been reinforced by almost everyone who comes into my life just to ultimately leave.\n\n I can't do this much longer. I told myself to at least hang on for 5 more years, but I don't think I can do it. Circumstances in my life are putting pressure on me to stay around, but everyday I can't stop thinking about how I'd rather be catching the bus instead. I'm absolutely stuck and I'm in so much pain, I could almost explode. If nothing changes then ending my life is the only thing I can do to not feel like this anymore. I don't know what to do. I started self harming again just to ease the urge, but I know it will only last for so long. \n\nSorry for the wall of text. I really needed to get this off of my chest and I felt like this sub was the appropriate place to do it. No one in my life understands my need to kill myself, but reading this sub gives me a little bit of relief knowing that other people somewhere feel the same way. ", "spoiler": false, "stickied": false, "subreddit": "SanctionedSuicide", "subreddit_id": "t5_2wiyw", "subreddit_type": "public", "thumbnail": "self", "title": "Why I can't do this anymore", "url": "https://www.reddit.com/r/SanctionedSuicide/comments/7q02yi/why_i_cant_do_this_anymore/", "whitelist_status": "all_ads"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1512437372, "domain": "self.TrueOffMyChest", "full_link": "https://www.reddit.com/r/TrueOffMyChest/comments/7hm7kq/im_angry_about_my_teeth_and_i_feel_like_i_have_no/", "id": "7hm7kq", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/TrueOffMyChest/comments/7hm7kq/im_angry_about_my_teeth_and_i_feel_like_i_have_no/", "pinned": false, "retrieved_on": 1512515735, "score": 8, "selftext": "Bit of back story: My mother is an amazing, kind and loving woman and always did her best to take care of me and my brother. In terms of parenting, she did an extremely good job, making sure our needs were meet both physically and emotionally. But this one hang up from her past has affected me to the point where it's costing me in my adulthood.\n\nFor whatever reason, she has an aversion to dentists. In my 22 years, I've only seen her go once and that was because she had to get her wisdom tooth removed because it absolutely had to be taken out. Even now she *still* has wisdom teeth that give her issues but she chooses to ignore it instead of getting it taken care of. I dont believe it's an issue of money, as she's paid for other medical things for me and my brother that were very minor. I think she just doesn't want to go for some unknown reason. She also has this thing against braces because she had them as a teen and her teeth went back to where they were before she had them. So I guess she felt like I wouldn't benefit from them, honestly I'm not sure why she feels that way.\n\nNow how this pertains to me: because she doesn't go to the dentist, she has never taken me or my brother. I asked multiple times about braces when I was much younger only to be given the response that they're useless because her teeth reset. I've only seen a dentist once in my entire life, and I was 14 years old and I went only because my father (who goes to the dentist regularly) made it a point to finally take us there. Unfortunately, he had to move states not long after this happened, so I never had anyone to take me to one. On top of that, there have been insurance issues on and off in the past that made it difficult for me to go. I only got the my drivers licence last year, so even if I wanted to go, I was also never able to drive myself. This month, everything finally fell into place for me that allowed me to make appointments to see an orthodontist for my extremely crooked bottom teeth, and for someone to look at my wisdom teeth as they're starting to really cause me a lot of problems. This is where my frustration comes in.\n\nI went in today for a consultation to see what I could do about my crooked teeth. The orthodontist asked why I've only been to the dentist once, and she sounded very surprised to have heard this. She then took a quick look at my gums and told me that they're very weak and unhealthy and that I would have to get a ***gum graft*** in order to even think about getting braces. I asked if this would have been prevented had I had dental work when I was younger like I wanted and she said yes. She also said that the lack of professional dental cleanings and visits is evident by the condition of my teeth, there's a lot of build up in addition to my weak and inflamed gums. All in all, I'm having to go through a lot of hoops to finally get my teeth fixed because it never got done when I was younger. I also found out before the consultation that insurance wont cover braces because the cut off age for coverage is 19. And on top of this, I still likely have to get my wisdom teeth removed. I left the dentist office trying so hard not to cry today, that's how absolutely angry I was.\n\nIt's not like I never at all wanted braces or never asked about getting them, I have asked about when it was going to happen (and eventually why it never happened) a lot. I've spent so much of my life insecure about how bad my teeth are, I've spent nights crying myself to sleep about about how ugly I've felt and how much better I'd be if my teeth were just finally fucking normal for once. I was so happy to finally get the chance to fix them and they're so much worse then I could have ever imagined. I didn't want this, but my mother (who again, I love to pieces and consider my best friend) didn't find it to be that big of a deal. When I told her what it would take for me to have braces, she didn't say a word. We've discussed the issue of my teeth before and she knows how upset I am about the fact that I never got braces or anything as a teen. I don't know if she understands why I'm upset, and I'm going to eventually talk to her about it. But right now I feel too awful to even really speak to anyone.\n\nOn top of feeling mad, I also feel extremely ungrateful for being so mad. Like I said, she always made sure every other need of mine was met and always went above and beyond for me. She is not at all a bad parent or a bad person. I feel like I don't have the right to feel angry for this exact reason. How can I be mad at her for this when she's done everything else for me and then some? I am very fortunate and very thankful for the things she's done for me, but I feel more than slighted about the fact that she dropped the ball on what is turning out to be a giant thing for me. What's worse is that my brother's teeth are worse than mine, and I can't begin to imagine what it's going to be like for him once he finally gets dental work (unlike me however, he really doesn't seem to want to go to a dentist, so that's a whole other issue.) But as ungrateful as I feel, I'm feeling extremely overwhelmed by the burden this is going to be for me to finally have normal teeth. This could have so easily been prevented, as it was never an issue of anything like the lack of money. But it just never happened and that's why I'm upset. Now there's a high level of uncertainty about how paying out of pocket for braces is going to work and about the future health of my teeth. \n\n**TL;DR: Mom never took me to dentist as a kid because she doesn't like them, now I'm an adult and teeth are fucked and need gum surgery because of something that could have been prevented when I was younger but didn't happen.**", "spoiler": false, "stickied": false, "subreddit": "TrueOffMyChest", "subreddit_id": "t5_2yuqy", "subreddit_type": "public", "thumbnail": "self", "title": "I'm angry about my teeth and I feel like I have no right to be.", "url": "https://www.reddit.com/r/TrueOffMyChest/comments/7hm7kq/im_angry_about_my_teeth_and_i_feel_like_i_have_no/", "whitelist_status": "all_ads"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1508825762, "domain": "self.Cuphead", "full_link": "https://www.reddit.com/r/Cuphead/comments/78dx95/cuphead_crashing_on_clip_joint_calamity_and/", "id": "78dx95", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/Cuphead/comments/78dx95/cuphead_crashing_on_clip_joint_calamity_and/", "pinned": false, "retrieved_on": 1508905991, "score": 1, "selftext": "I've spent a day trying asking around to figure this thing out, so far to no avail. I'm running Cuphead on a Windows 10 PC with a copy I got from Steam. The game performs just fine with no lag or anything of the sort until I attempt to enter these 2 levels. When I try to load them, it stays on the loading screen while the audio and the rest of the game eventually loads in the background. I've uninstalled and reinstalled the game, checked the file integrity, ran on compatibility mode for both Windows 8 and 7, ran on admin, and tried a new save file, but nothing seems to work. For reference, I'm running the game on an Intel i3 4010u w/ 4gb of ram, graphics are Intel HD Graphics 4400. I know the specs aren't the best, but I've seen people running the game just fine with similar or the same specs and it seems to work fine. Cuphead for my performs just fine until I try to enter either of these levels, it's almost like they're broken or something. What else can I do?", "spoiler": false, "stickied": false, "subreddit": "Cuphead", "subreddit_id": "t5_32491", "thumbnail": "self", "title": "Cuphead crashing on Clip Joint Calamity AND Mausoleum 1?", "url": "https://www.reddit.com/r/Cuphead/comments/78dx95/cuphead_crashing_on_clip_joint_calamity_and/"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1507588927, "domain": "youtube.com", "full_link": "https://www.reddit.com/r/DeepIntoYouTube/comments/75ct70/an_amv_displaying_the_romance_between_danny/", "id": "75ct70", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": false, "is_video": false, "locked": false, "media": {"oembed": {"author_name": "TheMasterMind1001", "author_url": "https://www.youtube.com/user/TheMasterMind1001", "height": 338, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/CwMA8zTBXwY?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/CwMA8zTBXwY/hqdefault.jpg", "thumbnail_width": 480, "title": "danny devito x richard nixon amv", "type": "video", "version": "1.0", "width": 600}, "type": "youtube.com"}, "media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/CwMA8zTBXwY?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "scrolling": false, "width": 600}, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/DeepIntoYouTube/comments/75ct70/an_amv_displaying_the_romance_between_danny/", "pinned": false, "post_hint": "rich:video", "preview": {"enabled": false, "images": [{"id": "iHUubePv3qstZcnW4KmfPUYTzLsFCOpoJS1yPJurD18", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/iZhUb7CGoqdBnkqu432JZ5PmnZaoc2wuWqXg-3qAUpQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=83175350629dd38aa41b133bf6f6e3fe", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/iZhUb7CGoqdBnkqu432JZ5PmnZaoc2wuWqXg-3qAUpQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=ba435e635ec0f511968bc03473de8c95", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/iZhUb7CGoqdBnkqu432JZ5PmnZaoc2wuWqXg-3qAUpQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=6b33161e09906af3d392ad2a6fea9be7", "width": 320}], "source": {"height": 360, "url": "https://i.redditmedia.com/iZhUb7CGoqdBnkqu432JZ5PmnZaoc2wuWqXg-3qAUpQ.jpg?s=9cf5b922a04f02af2c5ec7ee7405eee5", "width": 480}, "variants": {}}]}, "retrieved_on": 1507670916, "score": 3, "secure_media": {"oembed": {"author_name": "TheMasterMind1001", "author_url": "https://www.youtube.com/user/TheMasterMind1001", "height": 338, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/CwMA8zTBXwY?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/CwMA8zTBXwY/hqdefault.jpg", "thumbnail_width": 480, "title": "danny devito x richard nixon amv", "type": "video", "version": "1.0", "width": 600}, "type": "youtube.com"}, "secure_media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/CwMA8zTBXwY?feature=oembed\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "media_domain_url": "https://www.redditmedia.com/mediaembed/75ct70", "scrolling": false, "width": 600}, "selftext": "", "spoiler": false, "stickied": false, "subreddit": "DeepIntoYouTube", "subreddit_id": "t5_2wq8b", "thumbnail": "https://b.thumbs.redditmedia.com/0wDKrIF2SmIQcZnZCl9iQ_ev40FKfNVle9LVICXAW7Y.jpg", "thumbnail_height": 105, "thumbnail_width": 140, "title": "An \"AMV\" displaying the romance between Danny DeVito and Nixon. 4yrs old, 600~ views.", "url": "https://www.youtube.com/watch?v=CwMA8zTBXwY", "whitelist_status": "all_ads"}, {"approved_at_utc": null, "author": "Activated_Raviolis", "author_flair_css_class": "purple", "author_flair_text": "5'3| 145 | 25.7 | HW: too much | UGW 100", "banned_at_utc": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1502106311, "domain": "self.proED", "full_link": "https://www.reddit.com/r/proED/comments/6s4zo7/dae_ever_feel_the_need_to_destroy_themselves_with/", "id": "6s4zo7", "is_self": true, "is_video": false, "link_flair_css_class": "disc", "link_flair_text": "Discussion", "locked": false, "num_comments": 21, "over_18": false, "permalink": "/r/proED/comments/6s4zo7/dae_ever_feel_the_need_to_destroy_themselves_with/", "retrieved_on": 1502317688, "score": 53, "selftext": "I don't mean feeling the need to die from it per se, but I feel like this ED is a reflection of how badly I want to metaphorically tear myself apart.\n\nLike, I want people to know how much I'm suffering. I want there to be a visual representation of how I've felt for years. Of course there are so many other reasons why I want to be thin/lose weight: to be seen as pretty, to fit into nice clothes, to feel better about myself, for control, etc. But I feel this one so strongly. I want the people I love to finally give a shit about me and I want the people that have hurt me to know what they've done to me. I want for people to see it and just know. It's such an evil thought and I hate it. It's irrational and disgusting but I can't help but feel this way.\n\nAlmost no one knows about my disorder and about the fact that it's all I think about anymore, but when it finally comes to I'm going to be so scared. Am I the only person who feels this way?", "spoiler": false, "stickied": false, "subreddit": "proED", "subreddit_id": "t5_38934", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "DAE ever feel the need to destroy themselves with their ED?", "url": "https://www.reddit.com/r/proED/comments/6s4zo7/dae_ever_feel_the_need_to_destroy_themselves_with/", "view_count": null}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1485318549, "domain": "m.imgur.com", "full_link": "https://www.reddit.com/r/oldpeoplefacebook/comments/5q17ez/my_dads_a_truck_driver_this_is_my_grandma_asking/", "id": "5q17ez", "is_self": false, "locked": false, "num_comments": 1, "over_18": false, "permalink": "/r/oldpeoplefacebook/comments/5q17ez/my_dads_a_truck_driver_this_is_my_grandma_asking/", "post_hint": "link", "preview": {"enabled": false, "images": [{"id": "IXxdOt9jQLVpf6_UH0BJ8NbYxKkHxakoXcrNs6DrJ2Y", "resolutions": [{"height": 70, "url": "https://i.redditmedia.com/JDK-VlbapVsI4nT4_t7j7CbyUOO0Xq5X_5rBpEqL8-c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=f316fabd47c1bf5e9f967fefb194acc3", "width": 108}, {"height": 140, "url": "https://i.redditmedia.com/JDK-VlbapVsI4nT4_t7j7CbyUOO0Xq5X_5rBpEqL8-c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=2efe0b2265b3d092040139a6d372a0cd", "width": 216}, {"height": 208, "url": "https://i.redditmedia.com/JDK-VlbapVsI4nT4_t7j7CbyUOO0Xq5X_5rBpEqL8-c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=29ca2765205912dc8f53786ca0f973fa", "width": 320}, {"height": 416, "url": "https://i.redditmedia.com/JDK-VlbapVsI4nT4_t7j7CbyUOO0Xq5X_5rBpEqL8-c.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=e5565097e52b32ed5f52fbaac29032a5", "width": 640}], "source": {"height": 439, "url": "https://i.redditmedia.com/JDK-VlbapVsI4nT4_t7j7CbyUOO0Xq5X_5rBpEqL8-c.jpg?s=763833d9839d2a6b2f58d5be3e8a1692", "width": 674}, "variants": {}}]}, "retrieved_on": 1489471646, "score": 9, "spoiler": false, "stickied": false, "subreddit": "oldpeoplefacebook", "subreddit_id": "t5_2wf20", "suggested_sort": null, "thumbnail": "https://b.thumbs.redditmedia.com/kAnF93OI0jW8-TwaoywX6CLhGecLRdcvAjGl9SPwH9g.jpg", "title": "My dad's a truck driver, this is my Grandma asking him where he is.", "url": "http://m.imgur.com/gallery/3fcCMAJ"}, {"author": "Activated_Raviolis", "author_flair_css_class": "modmsg", "author_flair_text": null, "contest_mode": false, "created_utc": 1481307370, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/5hfbt1/what_is_there_to_look_forward_to/", "id": "5hfbt1", "is_self": true, "locked": false, "num_comments": 0, "over_18": false, "permalink": "/r/SuicideWatch/comments/5hfbt1/what_is_there_to_look_forward_to/", "retrieved_on": 1484384074, "score": 3, "selftext": "I have had clinical depression since I was 10 years old. I'm 21 now. Every time I think I'm getting better, I just continue to fall harder and harder. I'm likely going to drop out of college because it's making my mental health shittier than it already needs to be and i'm close to flunking out. I have no job, no license, and the friends I do have are too busy with their lives to care about me. The only person that made me feel like I mattered broke up with me and left me with absolutely nothing. Every time someone leaves, they are just taking away a piece of me that wasn't there to begin with. I'm now a shell of my former self and I can't stand being in this husk of a body anymore.\n\nEvery attempt I make to reach out for help goes nowhere. I don't know what else to do. Catching the bus seems like such an appealing idea right now. I've simply been putting it off for so many years now.", "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "thumbnail": "self", "title": "What is there to look forward to?", "url": "https://www.reddit.com/r/SuicideWatch/comments/5hfbt1/what_is_there_to_look_forward_to/"}, {"author": "Activated_Raviolis", "author_flair_css_class": "modmsg", "author_flair_text": null, "contest_mode": false, "created_utc": 1480179272, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/5f0bel/im_tired_of_being_tired/", "id": "5f0bel", "is_self": true, "locked": false, "num_comments": 3, "over_18": false, "permalink": "/r/SuicideWatch/comments/5f0bel/im_tired_of_being_tired/", "retrieved_on": 1484276236, "score": 10, "selftext": "I'm 21 years old and I've struggled with severe depression for over half of my life. I dont remember what its like living a life without depression. At this point, this illness has become a part of me and I dont know what i would do if it was gone.\n\nIf Im happy, its only a distraction from my depression which is always there. Happiness isnt permanent, but my depression sure is. I'm tired of waiting for the moments in between everything where I can finally feel like a \"regular person\". I don't function the way I'm supposed to. Whatever feelings of motivation and drive for life that everyone else has is something that i lack. \n\nMy friends and family simply go silent when I try to reach out to them. They talk about how they'll be there for me when I'm down, but the moment I try to ask for help they go cold. My boyfriend was the only person who would actually try to help me when I reached out to him, but he broke up with me out of the blue today. \n\nI'm making plans for everything right now, because being alive and waiting around for distractions is simply too much anymore. I can only go for so long before something's gotta give, and I'm simply at my breaking point. The love i used to feel for people is starting to turn into contempt and hatred. I have nothing left to give to the world.\n\nI initially was going to wait until i had the basis for some of my stories written down so that someone else can take over for me when I go. They were the only thing i felt a passion for, but im starting to feel like it wont matter if they die with me or not, considering theyre something that no one cared about anyways. Plus, i dont want to trouble anyone anymore than i already have.\n\nim currently out of state on vacation and all i want to do besides dying is to get back home. i hate being here and i miss my bed so badly. ", "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "thumbnail": "self", "title": "I'm tired of being tired.", "url": "https://www.reddit.com/r/SuicideWatch/comments/5f0bel/im_tired_of_being_tired/"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "contest_mode": false, "created_utc": 1478507189, "domain": "self.Vinesauce", "full_link": "https://www.reddit.com/r/Vinesauce/comments/5bl3w1/vinebooru_wont_let_me_log_in/", "id": "5bl3w1", "is_self": true, "link_flair_css_class": "cyan", "link_flair_text": "QUESTION", "locked": false, "num_comments": 0, "over_18": false, "permalink": "/r/Vinesauce/comments/5bl3w1/vinebooru_wont_let_me_log_in/", "retrieved_on": 1484210297, "score": 2, "selftext": "I've uploaded images to the booru before, but this time when I try to add a new pic, I get a message saying that I don't have permission/have to log in. When I log in I get a 403 error and cant post anything. Can anyone help me? I've tried logging in on both my phone, different browsers, and using incognito and nothing works.", "spoiler": false, "stickied": false, "subreddit": "Vinesauce", "subreddit_id": "t5_2uks1", "thumbnail": "self", "title": "Vinebooru wont let me log in?", "url": "https://www.reddit.com/r/Vinesauce/comments/5bl3w1/vinebooru_wont_let_me_log_in/"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1463975207, "domain": "self.tipofmytongue", "full_link": "https://www.reddit.com/r/tipofmytongue/comments/4km40y/tomt_song_a_traptrillwavewhatever_song_that/", "id": "4km40y", "is_self": true, "locked": false, "num_comments": 2, "over_18": false, "permalink": "/r/tipofmytongue/comments/4km40y/tomt_song_a_traptrillwavewhatever_song_that/", "retrieved_on": 1466480725, "score": 1, "selftext": "A few months ago I stumbled upon this trap song of sorts on youtube that used the Great Fairy's Fountain theme from Ocarina of time as an instrumental. The music video (if you could even call it that) was really minimalist and weird as shit. It was basically some sort of 3D model that was distorted and spinning around on a white background. I've been looking everywhere for it and haven't found it, it was kinda obscure so finding it has been kinda difficult.\n\nThanks in advance!", "stickied": false, "subreddit": "tipofmytongue", "subreddit_id": "t5_2r4oc", "thumbnail": "self", "title": "[TOMT] [SONG] A trap/trillwave/whatever song that samples the Great Fairy's Fountain theme from Ocarina of Time", "url": "https://www.reddit.com/r/tipofmytongue/comments/4km40y/tomt_song_a_traptrillwavewhatever_song_that/"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1453942769, "domain": "imgur.com", "full_link": "https://www.reddit.com/r/blunderyears/comments/430sta/middle_school_was_certainly_an_experience_for_me/", "id": "430sta", "is_self": false, "locked": false, "num_comments": 23, "over_18": false, "permalink": "/r/blunderyears/comments/430sta/middle_school_was_certainly_an_experience_for_me/", "post_hint": "link", "preview": {"images": [{"id": "jSV2sFkEOrvBkeAuV1M-QQ1wsp15Dz66DXRgVbelaxQ", "resolutions": [{"height": 60, "url": "https://i.redditmedia.com/jJC7GA8wyi0Xe-u9qOLHtNCZt6B5Vjim5fOxB_p27vA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=5232001d7a86f022466bd78fd8912911", "width": 108}, {"height": 121, "url": "https://i.redditmedia.com/jJC7GA8wyi0Xe-u9qOLHtNCZt6B5Vjim5fOxB_p27vA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=0677919adce726eee076ef1aae6df3ec", "width": 216}, {"height": 180, "url": "https://i.redditmedia.com/jJC7GA8wyi0Xe-u9qOLHtNCZt6B5Vjim5fOxB_p27vA.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=63be09f523986ca9c4b583811f3a9d95", "width": 320}], "source": {"height": 270, "url": "https://i.redditmedia.com/jJC7GA8wyi0Xe-u9qOLHtNCZt6B5Vjim5fOxB_p27vA.jpg?s=36c2fc6308651fefdc92b8a827fe1a61", "width": 480}, "variants": {}}]}, "retrieved_on": 1455037053, "score": 157, "stickied": false, "subreddit": "blunderyears", "subreddit_id": "t5_2vy3g", "thumbnail": "http://b.thumbs.redditmedia.com/1nQ3stWW0Yw-HpXNsfdgKiTqPAFMR2DTCAJf3f7Yu9g.jpg", "title": "Middle school was certainly an experience for me.", "url": "https://imgur.com/a/DqQHd"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1453507105, "domain": "imgur.com", "full_link": "https://www.reddit.com/r/VaporwaveAesthetics/comments/428cki/japanese_duran_duran_vinyl_has_aesthetics/", "id": "428cki", "is_self": false, "locked": false, "media": {"oembed": {"description": "Imgur: The most awesome images on the Internet.", "height": 550, "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FVzYZy%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FVzYZy&amp;image=http%3A%2F%2Fi.imgur.com%2FYofCUDt.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "Imgur", "provider_url": "http://imgur.com", "thumbnail_height": 270, "thumbnail_url": "http://i.imgur.com/YofCUDt.jpg?fb", "thumbnail_width": 480, "title": "Imgur: The most awesome images on the Internet", "type": "rich", "version": "1.0", "width": 550}, "type": "imgur.com"}, "media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FVzYZy%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FVzYZy&amp;image=http%3A%2F%2Fi.imgur.com%2FYofCUDt.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 550, "scrolling": false, "width": 550}, "num_comments": 4, "over_18": false, "permalink": "/r/VaporwaveAesthetics/comments/428cki/japanese_duran_duran_vinyl_has_aesthetics/", "post_hint": "link", "preview": {"images": [{"id": "Hkecx0fhU8_O7K3OORDtLmoLTK3lEgzB9q50LThbwvU", "resolutions": [{"height": 60, "url": "https://i.redditmedia.com/oxmsfMjsj05fvpdzLVgID8CmnqhsNzBQrpV-kGuHFo4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=41b526a9d27de50b290255fa10c11363", "width": 108}, {"height": 121, "url": "https://i.redditmedia.com/oxmsfMjsj05fvpdzLVgID8CmnqhsNzBQrpV-kGuHFo4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=722d858830ad4d8a8ffa2a5b223a03ff", "width": 216}, {"height": 180, "url": "https://i.redditmedia.com/oxmsfMjsj05fvpdzLVgID8CmnqhsNzBQrpV-kGuHFo4.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=b40f6fbd2f3178347cf949f5dacf9972", "width": 320}], "source": {"height": 270, "url": "https://i.redditmedia.com/oxmsfMjsj05fvpdzLVgID8CmnqhsNzBQrpV-kGuHFo4.jpg?s=725caf76e70dc57e3c6b7d5e1c32f584", "width": 480}, "variants": {}}]}, "retrieved_on": 1455023497, "score": 14, "secure_media": {"oembed": {"description": "Imgur: The most awesome images on the Internet.", "height": 550, "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FVzYZy%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FVzYZy&amp;image=http%3A%2F%2Fi.imgur.com%2FYofCUDt.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "Imgur", "provider_url": "http://imgur.com", "thumbnail_height": 270, "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.imgur.com%2FYofCUDt.jpg%3Ffb&amp;key=b1e305db91cf4aa5a86b732cc9fffceb", "thumbnail_width": 480, "title": "Imgur: The most awesome images on the Internet", "type": "rich", "version": "1.0", "width": 550}, "type": "imgur.com"}, "secure_media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FVzYZy%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FVzYZy&amp;image=http%3A%2F%2Fi.imgur.com%2FYofCUDt.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 550, "scrolling": false, "width": 550}, "stickied": false, "subreddit": "VaporwaveAesthetics", "subreddit_id": "t5_35mmz", "thumbnail": "http://b.thumbs.redditmedia.com/Nmho1Qw7sysY_frjuv1cy7iHaNLmp-flO-9RlnohfZw.jpg", "title": "Japanese Duran Duran vinyl has aesthetics", "url": "http://imgur.com/a/VzYZy"}, {"author": "Activated_Raviolis", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1437166057, "domain": "youtu.be", "full_link": "https://www.reddit.com/r/DeepIntoYouTube/comments/3dnzzt/tip_toen_in_my_crocs/", "id": "3dnzzt", "is_self": false, "media": {"oembed": {"author_name": "Melissa Fikse", "author_url": "https://www.youtube.com/channel/UCEEV1SyTWb8K16n9IXJyWXA", "description": "Uploaded by Melissa Fikse on 2014-09-29.", "height": 338, "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHAuWhaKg6WU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHAuWhaKg6WU%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FHAuWhaKg6WU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/HAuWhaKg6WU/hqdefault.jpg", "thumbnail_width": 480, "title": "Tip toen in my crocs", "type": "video", "url": "http://www.youtube.com/watch?v=HAuWhaKg6WU", "version": "1.0", "width": 600}, "type": "youtu.be"}, "media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHAuWhaKg6WU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHAuWhaKg6WU%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FHAuWhaKg6WU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "scrolling": false, "width": 600}, "num_comments": 0, "over_18": false, "permalink": "/r/DeepIntoYouTube/comments/3dnzzt/tip_toen_in_my_crocs/", "post_hint": "rich:video", "preview": {"images": [{"id": "9HVsZy8TEWdOaih1AxdeJeSXV932-oeEFR6U-bSD1SA", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/7YlwmrLVFgJolg_Hm99gjBV9d8NuqgKMNlMjnaTRhiQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=cde5b9eace071332e9651183d1125a49", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/7YlwmrLVFgJolg_Hm99gjBV9d8NuqgKMNlMjnaTRhiQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=62a627ae8ba27adca88bb64064a36607", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/7YlwmrLVFgJolg_Hm99gjBV9d8NuqgKMNlMjnaTRhiQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=887a2c3c5e4e74ba7d4f86832ba643b7", "width": 320}], "source": {"height": 360, "url": "https://i.redditmedia.com/7YlwmrLVFgJolg_Hm99gjBV9d8NuqgKMNlMjnaTRhiQ.jpg?s=9374ad060cee04480e61698eeb51d942", "width": 480}, "variants": {}}]}, "retrieved_on": 1440605227, "score": 0, "secure_media": {"oembed": {"author_name": "Melissa Fikse", "author_url": "https://www.youtube.com/channel/UCEEV1SyTWb8K16n9IXJyWXA", "description": "Uploaded by Melissa Fikse on 2014-09-29.", "height": 338, "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHAuWhaKg6WU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHAuWhaKg6WU%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FHAuWhaKg6WU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.embed.ly/1/image?url=https%3A%2F%2Fi.ytimg.com%2Fvi%2FHAuWhaKg6WU%2Fhqdefault.jpg&amp;key=b1e305db91cf4aa5a86b732cc9fffceb", "thumbnail_width": 480, "title": "Tip toen in my crocs", "type": "video", "url": "http://www.youtube.com/watch?v=HAuWhaKg6WU", "version": "1.0", "width": 600}, "type": "youtu.be"}, "secure_media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=https%3A%2F%2Fwww.youtube.com%2Fembed%2FHAuWhaKg6WU%3Ffeature%3Doembed&amp;url=https%3A%2F%2Fwww.youtube.com%2Fwatch%3Fv%3DHAuWhaKg6WU%26feature%3Dyoutu.be&amp;image=https%3A%2F%2Fi.ytimg.com%2Fvi%2FHAuWhaKg6WU%2Fhqdefault.jpg&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=youtube\" width=\"600\" height=\"338\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "scrolling": false, "width": 600}, "stickied": false, "subreddit": "DeepIntoYouTube", "subreddit_id": "t5_2wq8b", "thumbnail": "http://b.thumbs.redditmedia.com/qMlINaDhezJ75Q31qmFW4f_-fuw3gK7aSBY_lZJVZQQ.jpg", "title": "Tip toen in my crocs", "url": "https://youtu.be/HAuWhaKg6WU"}]}