{"data": [{"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_oncfkln", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541603835, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9v09lm/i_might_have_a_psychoticepileptic_disorder_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9v09lm", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9v09lm/i_might_have_a_psychoticepileptic_disorder_and/", "pinned": false, "pwls": 0, "retrieved_on": 1541603836, "score": 1, "selftext": "I am a 17-year-old Female. \nI have been dealing with hallucinations, nightmares, sleep paralysis and paranoia since I was a little girl. \nI've been seeing my Therapist since I was about 14 and I never told her about all of those things. I only ever told her I was sad, feeling numb, bad in school, i had social anxiety etc. \nWhen I turned 16 I was diagnosed with ADHD and took medication for it, which never seemed to work at all. \n\nYesterday I told my therapist that I get paranoia, I think people can read my mind, that a demon is possessing me, that there is someone in my house. I don't leave the window open without checking underneath my bed before and after. I don't leave the door unlocked when I go to the bathroom even when I am home alone because I fear that someone might break into my house. \ni think people talk behind my back, that people secretly hate me and that I am legit cursed. \nAll of this has been going on for years since i was little. I don't do drugs, these things happen even when I am not depressed and have slept well. \n\nI told her I see, smell, hear and taste things that aren't there. My hallucinations don't happen regularly, but they so seem to make me more paranoid as time goes on, which is what led me to telling my therapist about it. My inner voices sometimes talk to each other, they whisper and I cant understand what they are saying, one time a male voice even scared me because he got loud suddenly. this one happened at night when I was trying to sleep.\nmy brain never shuts off, constant thinking and white noise, its stressing, sometimes i don't notice the white noise and thoughts until i think about them. \n\nless often i might hear a voice, as if it was real. as recently i heard a woman cry as I was waking up. One time I heard a breathing under my bed, it was a woman again. it scared me a lot, I did not know where it came from. \n\nthere is a lot more to it but that would be too much to say, my therapist got really concerned, got another woman to talk to me and she told me i should stop taking my ADHD meds first and then we will see how i feel in two weeks, to see if the meds make it worse or not. \n\nI have been crying a lot about this, as one of my favorite music artists Killed himself last year because he went through a horrible psychotic episode. He was around 50. and I fear that my hallucinations and stuff will get worse WAY worse like it did for him and that I will eventually not be able to take it anymore. Because I am extremely depressed, I am suicidal. but i love my boyfriend, and just like that singer i thought i could never ever leave them  but what if i cant control my mind. \n\nit scares me, it feels like it really has gotten worse. \nNone of my friends understand what I am going through, why i feel like things are talking to me in a language i cant understand. but i have one schizophrenic friend i am just too scared to talk to because I think what if he just thinks i seek attention? that I'm silly or stupid? \n\nmy ex was a schizophrenic and he would always sort of disregard my mental health as not so important or severe because he also had sociopathy and I dont think he quite understood i would tell him about those things because i need help not because I need attention.\n\nTL:DR: \nI show plenty of signs of developing a psychotic disorder and I am scared that it might make me end up committing suicide and that it gets worse. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 403156, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I might have a psychotic/epileptic disorder and idk what to do", "url": "https://www.reddit.com/r/depression/comments/9v09lm/i_might_have_a_psychoticepileptic_disorder_and/", "whitelist_status": "no_ads", "wls": 0}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_oncfkln", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541125910, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9tg5z3/low_empathy_levels/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9tg5z3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9tg5z3/low_empathy_levels/", "pinned": false, "pwls": 0, "retrieved_on": 1541125911, "score": 1, "selftext": "I recently noticed why I act different to other people and why so many people feel hurt by what I say, why it is so fun for me to upset people online though all i write is just a joke. \n\ni took several online test, not 2, not 4 around 12 now. \nand every single one showed me that I have very low empathy levels, all around the same mark. \nand it explains to me why i act certain ways. \ni know online tests don't give me a definitive answer at all, but i think if 12 different tests, which 5 were professional psychopathy tests, tell me I have very low empathy there must be a little truth behind it when i reflect it onto my current life situation. \n\ni definitely do not have autism, and I definitely am not a psychopath. \nthis whole thing devastates me, as I want to have kids some day, i love the idea of being a mother. \ni do feel sympathy, but I read online that if i cant feel empathy my idea of love is just narcissistic. it made me cry, because i love my boyfriend and i dont want it to be true that i only love him for the idea of love, i dont know if thats true. but i love him. he makes me feel things and hes the only one that does. hes the first person i ever felt sorry for. the first person i feel really happy for. i have never in my life felt happy for anyone, that doesnt mean i dont care. \n\nthis whole empathy thing has made me feel horrible the past months, because since i was a kid i felt like a monster because i couldnt make out why i didnt feel much towards my family, there is no warmth. \n\ni dont know if depression can cause a lack of empathy this extremely, i know my depression makes me very numb and i can barely feel love but even when i was very happy, when i wasnt depressed, i didnt feel much for people themselves. \n\nthe most empathetic feelings i have is feeling protective and trying to care for people, but that might be my natural instincts for motherhood.\n\nim scared ill be a horrible mother", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 401544, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Low empathy levels", "url": "https://www.reddit.com/r/depression/comments/9tg5z3/low_empathy_levels/", "whitelist_status": "no_ads", "wls": 0}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535380497, "domain": "self.DrawingPrompts", "full_link": "https://www.reddit.com/r/DrawingPrompts/comments/9apfp7/dt_discussion_thread/", "id": "9apfp7", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "permalink": "/r/DrawingPrompts/comments/9apfp7/dt_discussion_thread/", "pinned": false, "retrieved_on": 1535380498, "score": 1, "selftext": "I have a Canvas I want to over paint and I specically want something eye catching and cool to paint on there. but I really dont know what. any suggestions? it will be hanging in my room. \n\nit can be something funny too. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "DrawingPrompts", "subreddit_id": "t5_2uwhu", "subreddit_subscribers": 2233, "subreddit_type": "public", "thumbnail": "self", "title": "[DT] - Discussion Thread", "url": "https://www.reddit.com/r/DrawingPrompts/comments/9apfp7/dt_discussion_thread/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535298099, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9agfrn/i_feel_like_my_therapist_doesnt_help_me/", "id": "9agfrn", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9agfrn/i_feel_like_my_therapist_doesnt_help_me/", "pinned": false, "pwls": 6, "retrieved_on": 1535298100, "score": 1, "selftext": "I have been going to the same therapist for about 3 years now. When i was 14/15 I had a very happy phase. I felt happiness for the first time in my life, for a whole year i was going good and i lost weight and felt happy, my eating disorder was under control. \n\nthis wasn't caused due to my therapist, it just kind of came randomly, as i was happy with my now ex and a friend of mine helped me a lot through everything. \ni began to fall back into depression when i was 16 and all my irl friends left me. I felt alone, I still do. I havent left the house in 3 months except for like 3 appointments i had to go to. \n\nI am 17 now and I have been severly depressed again for a year now. I have all sorts of problems I have to DIAGNOSE MYSELF partly because my therapist doesnt work with me like i always read it everywhere.  she doesnt ask me questions about myself. She only asks me what i want to do now that i didnt fucking graduate because im so fucking depressed and my adhd and dyscalculia ruined my life. i dont fucking know, if i have to stay in this country and work as a cashier all my life im definitely killing myself.\n\nI diagnosed myself with an eating disorder because its incredibly obvious as i have binge eaten since i was raped as a little kid ( no one knows abt that except a few url friends, i dont plan on talking abt it), i gained a lot of weight back then but I also had phases where i would eat barely or nothing everyday. and i of course am obsessed with wanting to be skinny, when all my friends say im not fat. i dont see it, i see fat. But im not exactly skinny either. \nI was obviously badly depressed for more than 5 years now, my therapist only recently found out?? i told her causually that im depressed and she acted so surprised and my mother said \"no ur not\". \nokay just because i dont try to kill myself in the therapy office it doesnt mean im mentally fine, its obvious i have social anxiety when i get panic attacks because i dont want to be part of a social gathering, when im terrified of buying groceries etc. when i come home crying because a fairly attractive man smiled at me, and i could only think he was laughing about me, making fun of me. and when i stutter and my heart races when i get forced to talk to strangers, which i told her all about.\n its obvious that im depressed when i can feel it and it feels like real pain, and it drains me and i feel nothing and get aggressive. I even told her about how i almost attempted suicide when i was 12 years old, and i cut all over my body and hurt myself in different ways 14-15. plus i was drinking a lot of alcohol.\n im sure you all know exactly what depression and these things are like.\nand i know that people have to tell their therapist about things, but is it normal to get there and just randomly say \" hey listen i have felt the incredible urge to mutilate and kill myself for 5 years now\"? i never got the chance to get comfortable about that, i never got asked how i felt about certain things, how am i supposed to open up? \nI dont want depression medication, i want to be okay and get okay by myself and its driving me crazy i feel helpless. \n\none of my url friends told me to tell my therapist about my eating disorder, last time i finally got the courage to do so. my therapist was surprised and asked me what makes me think that, and eventually said that she will try to help me but its not that bad right now because my weight doesnt fluctuate. well of course you cant see that when i see you once or twice a month, within that goddamn month i have lost and gained weight around 7 times just because i kept on binge eating and starving myself. \n\nOne of my online friends has helped me more as a wannabe therapist in an hour, than my own therapist did in 3 years. is it my fault? He asked me all about things, i found out why i was so scared of having multiply partners, it all made sense why i was scared of abandonment. i never thought abt it that way. but he asked the right questions.\n\ni basically have no other choice than to firstly self diagnose. the only thing they cared about doing tests with me and diagnosing me was my ADHD and Dyscalculia. \ncurrently i dont know if i have body dysmorphia, i did a lot of tests and read a lot about it, everytime it was recommended to seek help. i feel pathetic when i self diagnose, because it feels like im a stupid attention whore, but i just want help and somehow im not getting it. i dont want to have mental breakdowns just because i saw myself naked in the mirror, just because i want to rip my skin off. i want to be okay with myself. \n\nam i just stupid as shit or is there really something wrong with this?\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 381351, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I feel like my therapist doesn't help me", "url": "https://www.reddit.com/r/depression/comments/9agfrn/i_feel_like_my_therapist_doesnt_help_me/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535117803, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/uglyduckling/comments/99xgsv/1417_lost_around_26lbs_sorry_for_the_filter_in/", "id": "99xgsv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/uglyduckling/comments/99xgsv/1417_lost_around_26lbs_sorry_for_the_filter_in/", "pinned": false, "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "Uoh_c5fqKw3P_09ZTFBQl0kFThgrHT1NkEkfR2SPonI", "resolutions": [{"height": 108, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=0ddf24cfb61250b45a30f17a84d5b3a8", "width": 108}, {"height": 216, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=7ad9eb52fd2b5638a33e2426b2c0fb99", "width": 216}, {"height": 320, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=c008b90ebea95b9d80253805d25a2dfa", "width": 320}, {"height": 640, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=2d954294ae3b1e834781eb039d7e31ca", "width": 640}, {"height": 960, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=2c81b07628a0e85d812937d68c69be2f", "width": 960}, {"height": 1080, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=95ec29a393e760e9bba73526f371f561", "width": 1080}], "source": {"height": 1080, "url": "https://i.redditmedia.com/gkYla3lOyZkcRSGvEQENW3Jv-kvP6ti0iks4WyQpqN8.jpg?s=6a69873f567be0b8b9f287ec923f8fb5", "width": 1080}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1535117803, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "uglyduckling", "subreddit_id": "t5_2vz7o", "subreddit_subscribers": 75936, "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/yefNcE248TKPTZHXdTBSuN_yqf-PqMIk3ckzcCxVl1M.jpg", "thumbnail_height": 140, "thumbnail_width": 140, "title": "14-17. lost around 26lbs. sorry for the filter in the first pic and sticker in second..after all im still hella insecure lmao. ( second pic has no filter and isnt edited besides the stickers ) but I got this mile stone 😥", "url": "https://i.redd.it/8dt2cmbvn1i11.jpg", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535085549, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/99uho5/why_did_you_have_to_come_back/", "id": "99uho5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/99uho5/why_did_you_have_to_come_back/", "pinned": false, "pwls": 6, "retrieved_on": 1535085549, "score": 1, "selftext": "I miss it.\nI miss it more than anything. that true sincere emotion. the thought I could feel that again is the only thing keeping me alive. it was beautiful and pure when I first felt it two years ago. it brought me to tears. I looked at the stars and felt fulfillment. the world had color again, color so bright and strong it made me smile in the middle of walking home. when Christmas felt like Christmas again for the first time in so many years. when the smell of pumpkins and leaves in fall gave me that sweet nostalgic feeling. and music made me cry tears of joy and made me want to change the world and myself for the better. when i would stay awake until 4am to see the color before the sun, the sky light up in all different colors so beautiful it took my breath away. when i didn't think about killing myself a single day and i didn't harm myself with anything at all. smells were intense, people were amazing. laughing didn't feel exhausting. and I looked in the mirror and for the first time I didn't hate what I saw. that feeling gave me everything that feeling made everything worth it. \n\nhappiness. \nnothing in this world felt more beautiful than that. but depression came back and i mourn the loss of that simple emotion i once felt. its torture. the worst part aren't the suicidal thoughts, the lashing out, the nightmares. its that I'm so unsure, i fear i will never feel happiness again as it is the only reason i even go on. its the meaning of my life. all i ever do is only done to be eventually happy again. \nwhy did you have to come back to me, i thought i was finally okay and i want to be okay. I'm missing happiness like a passed away loved one. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 380806, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Why did you have to come back", "url": "https://www.reddit.com/r/depression/comments/99uho5/why_did_you_have_to_come_back/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535082009, "domain": "self.eczema", "full_link": "https://www.reddit.com/r/eczema/comments/99u47i/shave_with_the_grain_not_against/", "id": "99u47i", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "permalink": "/r/eczema/comments/99u47i/shave_with_the_grain_not_against/", "pinned": false, "retrieved_on": 1535082010, "score": 1, "selftext": "im so annoyed by people telling me this and every single blog suggesting this as \" THE\" solution. \nnot shaving at all genuinely feels better than the gross stubble on my legs if i shave with the grain, whats the point. if i search up \" how to shave without razor bumps\" because i have shitty eczema sensitive skin, i logically mean i want smooth skin, why the fu*k else would I want to shave my skin. \n\ni really dont know what to do anymore it is so fuckin exhausting. i googled so much and all pages suggest is to \" sHaVe WiTh ThE gRaIn\" or that im \" UsInG tHe WrOnG rAzOr\" its all so useless and not true. \nthe only options left are mostly too expensive or products not avaible in my country, which again would be too expensive to purchase online. \ni hate my skin, i just want nice legs. like goddamn let me have a clean coochie is that too much to ask for i already have regular hormonal acne on my BODY and not just face that sucks enough why do i deserve extremely sensitive skin too. \n\nplease, if anyone has good advice, i need to know, i really do, and for gods sake please dont suggest shaving solely with the grain. \nsorry for the vent", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "eczema", "subreddit_id": "t5_2rqqs", "subreddit_subscribers": 12741, "subreddit_type": "public", "thumbnail": "self", "title": "\" shave with the grain, not against \"", "url": "https://www.reddit.com/r/eczema/comments/99u47i/shave_with_the_grain_not_against/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535047081, "domain": "self.TheFence", "full_link": "https://www.reddit.com/r/TheFence/comments/99pmmc/claudios_song_atlas_made_me_want_to_be_a_mom/", "id": "99pmmc", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "permalink": "/r/TheFence/comments/99pmmc/claudios_song_atlas_made_me_want_to_be_a_mom/", "pinned": false, "retrieved_on": 1535047082, "score": 1, "selftext": "Before I knew this band i for real hated kids.\nmy friend showed me Coheed, i fell in love and one day listened to Atlas. the song was so emotional and so full of love it brought me to tears. I had never before heard such a sincere and loving song about someone's child, it truly changed something inside me, changed the view on parenthood and all. \nand now for some reason i absolutely love kids and the idea of raising one. \n\nwhy does Claudio have to be such a good father and Chondra such a good mother I'm too young to be a mom. \n\nvent over. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "TheFence", "subreddit_id": "t5_2xha1", "subreddit_subscribers": 12584, "subreddit_type": "public", "thumbnail": "self", "title": "Claudios song Atlas made me want to be a Mom", "url": "https://www.reddit.com/r/TheFence/comments/99pmmc/claudios_song_atlas_made_me_want_to_be_a_mom/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534968575, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/99goog/too_depressed_to_do_anything_against_ed/", "id": "99goog", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/99goog/too_depressed_to_do_anything_against_ed/", "pinned": false, "pwls": 6, "retrieved_on": 1534968577, "score": 1, "selftext": "I know what I am doing is bad for me. but its the only thing bringing me joy at the moment and its so horrible. I hate how aware I am of it. I hate how I am aware that im not actually 300lbs. \n\nim not skinny. \n\nbut i get dizzy a lot and I feel weak. one time i felt so numb and i felt so sick, i cooked a good carb meal. ate fish and egg and cheese. i felt horrible about it. felt nauseous. but otherwise i would have probably collapsed. \nand recently I couldnt stop eating less and less. last week, i ate 3 meals total. and that was somehing to be so proud of because i used to binge a lot. eating so much in one day. and currently, i eat half of my plate ( which is even a small portion) and im full. and it feels so good. i feel bad for every food i put in my mouth. but i cant stop acting this way. i cant stop finding my body absolutely disgusting. \ni might just do this as self punishment. im not anorexic. but it also feels like self punishment because i used to self harm. well apparently didnt stop. \ni kind of think \" hey you dont deserve food you didnt do anything today, you dont do anything ever\".\nbut i also fear gaining weight so much. i go from weighing myself everyday, to not weighing myself for a whole month out of fear because i overate twice that month. and often i binge so i stay the same weight. i just want people to see i can do something too. i always get told i dont do anything. i feel like ive never achieved anything in my life. although im aware i have talents. i have potential. but i failed school, because im so depressed, because i have a learning disability and adhd. because no one helped me. and i feel like shit because i need help. i dont want to need help. i want to be good enough to be able to do things on my own. being thin would be that. everyone would show me they are proud i would achieve something without help. \n\ni told my therapist about it and she said its not that crazy right now because my weight doesnt really fluctuate because i binge and purge all the time and only see her about once a month. does that mean im just trying to seek attention. but whenver i eat, or think about food i can just think about how much i hate it. i hate food. i really hate it so much.  why do i hate it so much why do i do this to myself. i wish i was normal, i ate normal, i wasnt depressed and could regulary excercise to be healthy. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 380411, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Too depressed to do anything against ED", "url": "https://www.reddit.com/r/depression/comments/99goog/too_depressed_to_do_anything_against_ed/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533289846, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9488uw/why_do_my_friends_always_leave_me/", "id": "9488uw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9488uw/why_do_my_friends_always_leave_me/", "pinned": false, "pwls": 6, "retrieved_on": 1533289847, "rte_mode": "markdown", "score": 1, "selftext": "[Long Text]\n\nI have been upset about this for quite a while now. And I have always given the blame to me, despite my closest friends telling me that my other friends were just toxic. But are the odds really that high that so many people in my life use me and are toxic and then drop me like dirt? regardless I feel horrible. It feels so lonely and each time i wish i could have been a better person so they would have not left. \nthe last time a really close friend of mine kept on ghosting me over text. ( i dont have any irl friends since they left me too, all thats left are online friends) he ignored me for months each time and came back apologizing. i forgave him everytime because i loved him so much as a friend i didnt want him to go, he made me feel better whenever we called and less lonely. but he kept on ghosting me pretending that's okay to do, so i told him i cant take it anymore and blocked him. after 4 months he messaged me through a second account, asking me why i \"overreacted\" that much and that he \"only\" was busy. I told him i know EXACTLY he wasnt busy, I know he was ignoring me and ghosting me again because hes having some sort of hard time and i told him when hes going through bad shit he doesnt want to talk about he can tell me beforehand so i dont go through emotional hell in those months. and that theres no shame in admitting it. and then he never replied anymore. that was about two months ago. \nand my other friend hasnt messaged me regulary at all anymore since he got a girlfriend. he hasnt messaged me in two months either. allthough i always try. it makes me really sad. i feel lonely because i had to cut off a lot of friends because of their \"toxic\" behavior or they started ignoring me.because they found someone better to talk to. i feel so worthless. i feel like im only ever a potential girlfriend to some of my friends, and when they find someone better im forgotten. i dont even lead anyone on, i always made it clear i wouldnt date any of them. but it keeps on happening. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 374920, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Why do my friends always leave me", "url": "https://www.reddit.com/r/depression/comments/9488uw/why_do_my_friends_always_leave_me/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533162582, "domain": "self.Rapekink", "full_link": "https://www.reddit.com/r/Rapekink/comments/93tq0b/i_think_i_got_my_ldr_bf_into_rape/", "id": "93tq0b", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": true, "parent_whitelist_status": "promo_adult_nsfw", "permalink": "/r/Rapekink/comments/93tq0b/i_think_i_got_my_ldr_bf_into_rape/", "pinned": false, "pwls": 3, "retrieved_on": 1533162583, "rte_mode": "markdown", "score": 1, "selftext": "So ive been dating this boy for a few months, hes my absolute dream guy. when i first talked to him he revealed to me he was a sub. which I of course didnt find as good since I am a sub myself and really into rape. But I truly believe that men are ALWAYS naturally doms, and you can always make a man dominant towards you. I thought its okay if he turned out to stay a sub, i can take that, afterall i love him and i can do vanilla sex too even if it is a lot less exciting than the idea of rape. i slowly began talking to him about my fantasies, and that I would NOT let him have sex with me unless he took what he desired by force. and he rolled with it. after a month or so he admitted to me he found the idea of \"raping\" me incredibly hot. And now i noticed he can be a really big dom if he wants to, just a little awkward at times since hes still a virgin. but to me, that makes it all much better because that means hes more sensitive to teasing. lately hes been very much rapey towards me, and getting into giving me commands and even calling me a \"bitch\" or his \"little fucktoy\". I like the idea of cockteasing him until he cant take it anymore and has to fuck me. i know how much he wants me by default, it turns him on immensely that he will be the first guy to touch my pussy, it turns him on how \"pure\" I am, how I havent even kissed a boy before. hes extremely into my innocense and the fact hes going to take it and be in posession of me like im his property.  and he seems to be a brat tamer too ;). I cant wait to finally see him and tease him until he violently takes my virginity and makes me choke on his dick. Allthough LDR's suck, the waiting makes me nervous and that kind of makes it hotter. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Rapekink", "subreddit_id": "t5_3ht28", "subreddit_subscribers": 29750, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "nsfw", "title": "I think I got my LDR bf into rape", "url": "https://www.reddit.com/r/Rapekink/comments/93tq0b/i_think_i_got_my_ldr_bf_into_rape/", "whitelist_status": "promo_adult_nsfw", "wls": 3}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1529230492, "domain": "self.relationship_advice", "full_link": "https://www.reddit.com/r/relationship_advice/comments/8rq5dl/please_dont_ignore_thisrape/", "id": "8rq5dl", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationship_advice/comments/8rq5dl/please_dont_ignore_thisrape/", "pinned": false, "pwls": 6, "retrieved_on": 1529230493, "rte_mode": "markdown", "score": 1, "selftext": "Okay so this is the only subreddit i get real and good responses on. my post is not abput relationships or anything but i really do need help and i have NO IDEA who to talk to about this. \n\nI am a 17 year old female from germany. \na few minutes ago my best friend, who lives in australia, told me about how a family friend of his got raped by HIS rapist/abuser. \nill have to explain a bit about it its really difficult. \nmy best friend has gone through horrible abuse and sexual abise at his old school when he was a child, in which one of the abusers was a girl. she fucking sexually abused him and when he was a child and when he turned to people to tell them about it, they didnt believe him. they told him to man up and get over it because \"kids will be kids\". now, that girl still lives where he lives and he gets anxiety attacks when he sees her. and if that isnt horrible enough she did something again. my best friend told me that she gave one of his family friends so much alcohol he was almost black out drunk, while she was completely sober. and then she raped him. \ni told my best friend to PLEASE go to the police but hes horribly scared because that girls friends etc will burn his house down or beat the shit outta both of them. hes still scared because the people around him will tell his family friend too to just get over ot or just wont Believe him.\nnow i know this is an unusual post in this thread but i really need help and dont know who to ask for help as im actually in tears about this disgusting whore and rapist. \ni cant go there since i live in germany. \nbut what can i even do at this point?\n\nTl:dr: \n\nbest friends family friend got raped, he doesnt want to say anything out of fear, i live in a different country, what can i do to help?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn", "subreddit_subscribers": 611831, "subreddit_type": "public", "thumbnail": "self", "title": "PLEASE DONT IGNORE THIS/RAPE", "url": "https://www.reddit.com/r/relationship_advice/comments/8rq5dl/please_dont_ignore_thisrape/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528980178, "domain": "self.TheSmallVictories", "full_link": "https://www.reddit.com/r/TheSmallVictories/comments/8r1jb5/my_boyfriend_m18_seems_to_feel_better_because_of/", "id": "8r1jb5", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "permalink": "/r/TheSmallVictories/comments/8r1jb5/my_boyfriend_m18_seems_to_feel_better_because_of/", "pinned": false, "retrieved_on": 1528980179, "rte_mode": "markdown", "score": 1, "selftext": "I recently started [online] dating this boy. and we really love each other. my best friend goes to his school and told me how my bf is laughing much more now and he seems happier since we started dating. my boyfriend also tells me quite a lot that im the best thing that has ever happened to him. He giggles a lot when we talk and it warms my heart to know that hes recieving the love and care he deserves now ( also from my best friend but my bf doesnt acceot it so much because my best feiend is a guy lmao) but yeah, my small victory is that i helped him out of suicidal thoughts and his drug habit got way better ( its just weed nw) . hes also made my life so much better. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "TheSmallVictories", "subreddit_id": "t5_h07fr", "subreddit_subscribers": 1366, "subreddit_type": "public", "thumbnail": "self", "title": "My boyfriend (M/18) seems to feel better because of me", "url": "https://www.reddit.com/r/TheSmallVictories/comments/8r1jb5/my_boyfriend_m18_seems_to_feel_better_because_of/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528922441, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/8qvupw/been_thinking_about_my_ex_and_crying/", "id": "8qvupw", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/8qvupw/been_thinking_about_my_ex_and_crying/", "pinned": false, "pwls": 6, "retrieved_on": 1528922442, "rte_mode": "markdown", "score": 1, "selftext": "im sorry this is going to be long but i feel like such a horrible person.\n(F/17) here, to explain a bit of the situation ill start off with my past relationship.\ni had an over 2 year LDR with a guy (M/19) in the states, I believe he loved me and i sure loved him a lot. that being said i dont love him anymore. I am in a new relationship (M/18) and i couldnt be luckier with anyone in this whole world, hes the most amazing person ever and i havent felt this attached so fast to anyone before. \nbut I think about my ex a lot. and I guess its understandable considering the circumstances. around september or so he started acting different towarss me be because i \"argued\" too much. all though i now know everything i \"argued\" about was justified, i was simply questioning his actions like him not openly admitting on social media that hes in a relationship with me. i was very naive and i still dont know a lot. for 7 months he treated me extremely cold hearted. he didnt say I love you anymore at all and he didnt compliment me nor make an effort to talk to me. he would not be online for days at a time. and when i asked him about it he would say he is busy. this all drove me crazy because i wanted to be with him, i had hope left and I Thought maybe we could work on everything but he constantly made me feel like everything is my fault and that im toxic for not trusting him in those situations. afterall he wasnt a very good boyfriend...\ni was still with my ex when i met my current boyfriend. we didnt talk much at first until he got added to a groupchat i was in. thats when we really started talking and he developed a crush on me. i thought he was cute but didnt want to admit it to myself. i would have never even flirted with him because i dont cheat. even if i was incredibly unhappy in my relationship. anyway i broke up with my ex later on. he never even replied my texts.\n i basically felt numb towarss him because he treated me like im not even considered a friend to him for 7 months straight. i thought that emant im over him and i shortly after got with my current boyfriend. its also a LDR but thats besides the point.\n\nnow, recently ive been having mental breakdowns at night crying over my ex. not because i still love him, i just cant stop thinking about what all we had planned. i cant even tell my best friend about this because i fear he would think i still love my ex and would not understand. ( my best friend is also the irl friend of my boyfriend) i dont even understand myself. im apparently not over my ex but thats incredibly bad for my current relationship right? or is it different because i really dont love him anymore. i love my boyfriend now. but i feel so fucking bad about even thinking about my ex because i know i would be horribly hurt if my boyfriend was still that attached to memories. \nsince im bad at keeping secrets and i felt really bad i even told him. i feel so fucking horrible i want to die eveery night again. my boyfriend made me feel so much less depressed but my ex drags me down despite not being in my life anymore. i threw away all his pictures and even diarys i wrote in about him.\nand i would never take him back. i dont.know why i cry about him why do i feel depressed about him. why do i feel guilt and disgust with myself. i just want it to end and i think its jist depression i just want that im happy again, truly....like i was when we were the happiest...and to even say that disgusts me. how could is ay that when i love my boyfriend? why doesnt he make me that happy? he does, but depression just fucks everything up its so numb. i dont even know", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 360753, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Been thinking about my ex and crying", "url": "https://www.reddit.com/r/depression/comments/8qvupw/been_thinking_about_my_ex_and_crying/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528576140, "domain": "self.relationship_advice", "full_link": "https://www.reddit.com/r/relationship_advice/comments/8pvnb2/how_do_i_handle_ldrs/", "id": "8pvnb2", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationship_advice/comments/8pvnb2/how_do_i_handle_ldrs/", "pinned": false, "pwls": 6, "retrieved_on": 1528576142, "rte_mode": "markdown", "score": 1, "selftext": "[F/17] ive been in a relationship with my boyfriend for a bit more than a month, i know that doesnt seem like much but i have never felt this good about someone before, hes the kindest and most gentle person ive ever known and we have so much in common its insane, and he understands and supports me. so please dont suggest to \"break up\" just because its an LDR. \nI never planned to be in an LDR AGAIN, because my last one went on for over two yearw, but in that one i never realized how wrong my ex treated me, because i was younger and he was my first love. the reason it ended was because he didnt care enough, he ignored me for days on and i had a strong feeling he was hiding soemthing from me anyway, it didnt end just because it was an LDR.\nmy boyfriend didnt want an LDR either at first because we both know its really hard to bear.\n\nnow i dont know if i can do it again. I really fell in love with this boy so deeply, that i couldnt even resist from suggesting to make it official a month ago. and he couldnt either. im finishing school in about a month and he is too at the end of the year. hes 18 now and would get a job right after, so will I. He said he wants to visit me around winter, and im excited for that! but i fear t wont work because soany times my ex and I made plans and it hadnt worked a SINGLE time and im just used to disappointments. i feel really lonely and i forgot how horrible it felt not to be able to kiss,hug or hold the one you love. and all of this loneliness just doubles because I dont have a single friend irl. i have no one to hug irl. \nhow will i survive another one of these LDRs WITHOUT breaking up. i dont want to lose him hes incredibly perfect in every single way and i seriously strongly believe ive finally found the one. and i didnt strongly believe that with my ex. \ni just dont know how to handle loneliness and craving of physical affection anymore. i havent had sex before and i havent kissed a guy before and i havent held hands with a boy before which is pretty embarrassing. but i guess that kinda adds to it more too, the older i get the more ill crave those things. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn", "subreddit_subscribers": 597705, "subreddit_type": "public", "thumbnail": "self", "title": "How do I handle LDRs?", "url": "https://www.reddit.com/r/relationship_advice/comments/8pvnb2/how_do_i_handle_ldrs/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527265989, "domain": "self.relationship_advice", "full_link": "https://www.reddit.com/r/relationship_advice/comments/8m34fy/fear_of_having_sex/", "id": "8m34fy", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 13, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationship_advice/comments/8m34fy/fear_of_having_sex/", "pinned": false, "pwls": 6, "retrieved_on": 1527265989, "rte_mode": "markdown", "score": 1, "selftext": "I'm [F/17] currently in my second long distance relationship. it wasn't planned since i promised myself to never get into another one again because my last one lasted over 2 years and we hadn't met up once ( which was more of his fault since he didn't care enough after all).  but my new boyfriend [M/18] happened to be the most perfect person I've ever met and i just fell in love with him more and more.\n\n anyway I have a problem. \nHe told me he wanted to see me in winter. so around December 2018 or January 2019 . first I was excited because I swear I never wanted to be with someone so badly as I do with him but...\nI am scared of sex. I am still a virgin, well not really. When I was still a child I was raped, not vaginally but orally. and I believe that scarred me so much I get little anxiety attacks over seeing a penis. When I get unwanted dick pics from people I get bad anxiety attacks.\nAlthough I've seen his 'thing' before twice and i feel really comfortable with him, i still got scared and i started to feel symptoms of an anxiety attack ( just symptoms i wouldn't get one). I didn't tell him this because I think he would just think i find him gross or something, which I don't! i feel sexually attracted to him, i do think about having sex with him. I even think about oral sex but when it is really about losing my 'virginity' i get so scared. I'm actually terrified. I am at least glad he is a virgin too, that makes it easier for me if i am honest. but i don't know if i am ready for sex this winter, if i still get anxiety attacks over seeing male genitalia. I know I really want to have sex with him, but there is something that tells me i just cant do it and I'm too scared to. when I think about actually touching it i get really angsty, even though i know i want it in some way and it drives me crazy because i don't want to be this prude i want to be sexually open but i don't know how. i don't know how to be a slut either not even towards him. i try to be a little slutty sometimes, like sending nudes but i would never be able to send him a picture of my peach. i just cant. and that's not because my private parts are especially gross or ugly, i just cant do it because i am in some way ashamed of myself. and I'm pretty sure that has a lot to do with my trauma from my childhood. I don't know if i should tell him that i might not be ready by then, or if i should get over myself because its not that bad. i know he will be gentle, i know he will be careful and patient because that's just who he is. but I'm still scared. extremely. \n\nhow do I deal with this because I cant get a therapist for it ( i wouldn't be able to tell my therapist about my trauma, she doesn't know about it ) .\n\nI also really want to lose my virginity to him, i really do. its just so incredibly hard for me to even think about", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn", "subreddit_subscribers": 568925, "subreddit_type": "public", "thumbnail": "self", "title": "fear of having sex", "url": "https://www.reddit.com/r/relationship_advice/comments/8m34fy/fear_of_having_sex/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1523903510, "domain": "self.AeshmaHendrix", "full_link": "https://www.reddit.com/r/u_AeshmaHendrix/comments/8cptin/i_hate_life_so_much/", "id": "8cptin", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": true, "permalink": "/r/u_AeshmaHendrix/comments/8cptin/i_hate_life_so_much/", "pinned": false, "retrieved_on": 1523905814, "rte_mode": "markdown", "score": 1, "selftext": "Im venting on here because I dont want to vent to any of my friends. They just get sad too and worry. \n\nThe love of my life is possibly leaving me and it feels horrible. \nMy friends hate themselves. \nOne of my close friends, who allthough he lives far away, means the world to me, is currently dying. And doesnt know how long he will have. I met him knowing hes rly sick, and that he should have actually died a few years back. \nAnd i dont know how to cope with it. I love him so much. Why does life do this to us. \nIm in emotional pain. \nAll my friends try so hard but life keeps licking their ass. It seems to all get worse. \nMy best friend lives so far away too. And im completely lonely here. I have heavy Depression again. \nEspecially since my s/o makes me feel un loved and unwanted for the past 6 months and doesnt even listen to me or aknowledge when i try to talk to him. And i cant confront him properly becuz its an LDR. \nAnd im currently trying to cope with it but the thing with my friend hurts me bad too. \nI cry every night about the people i love. Because they have been abused and hurt and are depressed because of it, and i wish i could help but i cant. I just want them to have the happiness they deserve. I just want to hold them in my arms but i cant because im so fucking poor. I want to stand by their side to give them the support they deserve. But i cant and im so pathetic. And i feel so guilty for planning out my suicide weeks ago, because one of my friends Texted me that his friend killed himself. And i dont want him to be upset if i do. Im a burden dead and alive its horrible. \nPlease god just make it better for them atleast. They deserve to have a good life. I dont want my other friend to attempt suicide again. \nI dont go to school anymore because t depressed me too how they are. And nobody knows that here. \nAnd now a friend fell in love wih me and i feel bad because it hurts him i dont want him the same way. \nAll i do is make people sad and feel guilty. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "u_AeshmaHendrix", "subreddit_id": "t5_9f3oc", "subreddit_subscribers": 0, "subreddit_type": "user", "suggested_sort": "qa", "thumbnail": "self", "title": "I hate life so much", "url": "https://www.reddit.com/r/u_AeshmaHendrix/comments/8cptin/i_hate_life_so_much/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1523213800, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/8as36b/guilty_suicide_and_lost_love/", "id": "8as36b", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/8as36b/guilty_suicide_and_lost_love/", "pinned": false, "retrieved_on": 1523216346, "rte_mode": "markdown", "score": 1, "selftext": "I cant stop thinking about my suicide. \nAnd i feel so bad about it, so fucking guilty. Because people care about me, even if they live across the Globe only. \nAnd i know that if I kill myself a few of my friends will too, because im mostly the last positive/support ive person.in their lives. \nIm a burden alive and dead.\nI wish nobody cared about me it would be so much easier.\nAlmost daily i think exactly about how id write my letter, what id leave behind, what id do before i end it and how id do it.\nWhat song id listen to, and its a very sweet song. A song about love, and it makes me feel at peace. It reminds me of how much i love my friends, how much i love my boyfriend even when our relationship is seeming to end. And it breaks me down each time, because when i used to listen to it id cry of joy, now its just pain. It feels like my Organs are going to explode. \" i still wonder if i ever felt the pain\", that was what made me happy, because he made me happy, my boyfriend. And i know that love comes and goes, but he gave me my happiness, before i met him i didnt even know what happiness felt like, it was as if a grey world was suddenly filled with colors of every kind, for two years on. And i feel guilty because hes even more mentally ill and i cant fucking help him, i could never. The only reason it doesnt work out is because im so fucking weak and useless and immature. I cant fucking handle his episodes. \nI know id write a letter to my friends, explaining that im so sorry, and that they have better chances than i ever had. Id finish the book im writing, which is about a man that goes through rough patches in life, and loses everything, but in the end gains hope, and its ironic because ive almost lost all hope. Its inspired by stories and expiriences of friends. Writing about suicide and people overdosing, about illness that takes a loved one, eating disorders that are barely understood by anyone properly.\n But maybe one day ill be hopefull again, and the book is finished. Then i would write my story on the last pages, and i hope that if i dont lose hope, that atleast a few suicidal people will read it and change their minds, because i barely can stand it anymore. \n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 343061, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Guilty Suicide and lost love", "url": "https://www.reddit.com/r/depression/comments/8as36b/guilty_suicide_and_lost_love/", "whitelist_status": "all_ads"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1522857904, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/89qsoo/help/", "id": "89qsoo", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/89qsoo/help/", "pinned": false, "retrieved_on": 1522885712, "rte_mode": "markdown", "score": 1, "selftext": "I dont know what to do anymore. The only reason im alive is because i dont want my friends to lose hope too. Because im mostly the support and positive person. \nBut as i lay here, listening to music. I started crying because i am so lonely. Everything in my life is on long distance, friendships, my relationship. \nOne of my friends is dying, others are depressed too and want to die, one has tried to kill himself but survived. My life is a meds and my therapist doesnt know about most of it. \nMy medication Might drag me down too idk. \nBut school is probably the biggest factor, i feel worthless and stupid due to it. Because i cant graduate because im so bad. I have dyscalculia and they dont want to make things easier for me because i am \" too old\". So im gonna fail school.\nI miss my family in another country and my best friend lives so far away too. \n\nGod i really just want to feel human contact. To find love. And the love of my life barely talks to me anymore, he says its busy. Which i believe. But its unbearable when i havent heard his voice in over 6 months. \n\nIm close to breaking up but that Might just be a mistake because that just me being a selfish cunt that only wants attention right? I dont know. I cant even find friends irl. \nEach day i wake up texting my friends i feel more miserable because i cant hug any of them nor can we Hang out. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 342033, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Help", "url": "https://www.reddit.com/r/depression/comments/89qsoo/help/", "whitelist_status": "all_ads"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1522699491, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/894hox/how_do_i_deal_with_loneliness/", "id": "894hox", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": false, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/894hox/how_do_i_deal_with_loneliness/", "pinned": false, "retrieved_on": 1522763684, "rte_mode": "markdown", "score": 2, "selftext": "Half a year ago i lost my last irl friends. \nNow i only have Internet friends whom i sure love to hell and back, they are the best friends i could ever ask for, but things get extremely lonely. \nI have never had really good friends irl. \nI was always too weird, annoying or different. \nI never really had a loving hug with a friend even. \nI never had a true bond with a friend irl. \nNever had a friend with the same interests, because they barely exist here.\nAnytime im on the phone with my best friend i get super happy but also sad, we talk a lot about how cool it would be if we lived near each other, he says his friends would def like me, he says he would hug me everyday. And i know he would, he is my best friend. And i really wish i could hug my other friends, just be with them. I am really fucking lonely, even at school. I talk to a few people that ive known for years, but we arent really friends, im too weird yet again. Trust me, i have tried millions of times being friends with people different from me, it just doesnt ever work out. \nAnd plus that i have social anxiety, so that makes making friends irl incredibly hard too. I just wish i could see any of them. My best friend said he wants to visit me summer next year, i was so excited until i realized he will go back home again too and all the joy i woukd have felt, would be gone. \nI love him so much, and i love my other friends so dearly too. I sometimes just start crying because i realize i have never really had friends irl and have ALWAYS been lonely. \n\nI really just want a real friend here, someone that doesnt actually think im stupid, weird, annoying or unbearable. Just once. Id be glad. And i dont know how to deal with this loneliness anymore it feels like actual physical pain sometimes. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 341575, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "How do i deal with loneliness", "url": "https://www.reddit.com/r/depression/comments/894hox/how_do_i_deal_with_loneliness/", "whitelist_status": "all_ads"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1522521469, "domain": "self.TheSmallVictories", "full_link": "https://www.reddit.com/r/TheSmallVictories/comments/88kntx/made_my_friend_feel_a_little_better_about_himself/", "id": "88kntx", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": false, "num_comments": 5, "num_crossposts": 0, "over_18": false, "permalink": "/r/TheSmallVictories/comments/88kntx/made_my_friend_feel_a_little_better_about_himself/", "pinned": false, "retrieved_on": 1522582582, "rte_mode": "markdown", "score": 23, "selftext": "I drew my friend today, I think he is a very beautiful young man, he doesnt. I made him smile with the drawing. He made it his profile pic. \n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "TheSmallVictories", "subreddit_id": "t5_h07fr", "subreddit_subscribers": 1112, "subreddit_type": "public", "thumbnail": "self", "title": "Made my friend feel a little better about himself", "url": "https://www.reddit.com/r/TheSmallVictories/comments/88kntx/made_my_friend_feel_a_little_better_about_himself/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1522508175, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/88j4yg/i_really_need_advice/", "id": "88j4yg", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/88j4yg/i_really_need_advice/", "pinned": false, "retrieved_on": 1522560779, "rte_mode": "markdown", "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 340894, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "default", "title": "I really need advice", "url": "https://www.reddit.com/r/depression/comments/88j4yg/i_really_need_advice/", "whitelist_status": "all_ads"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1522313647, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/87zrag/how_to_find_friends/", "id": "87zrag", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": false, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/87zrag/how_to_find_friends/", "pinned": false, "retrieved_on": 1522363827, "rte_mode": "markdown", "score": 6, "selftext": "I know I probably sound extremely pathetic but I just dont know how to find friends that like the stuff I like. I live in germany, so metalheads dont just Hang out in the skate Parks, in General i rarely see them. I cant go to concerts to meet them because most of them are 18+, and I am not 18 yet. There is a concert I want to go to so bad, but cant because of that. And I am really sad because all these years I tried being friends with people completely different, and all it did was make me more depressed and feel like I was a mistake. Clubs are 18+ too. I really dont know what to do, because I just once want to feel like I belong somewhere into a group of people. I sound so lonely and desperate I apologize\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 340360, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "How to find friends", "url": "https://www.reddit.com/r/depression/comments/87zrag/how_to_find_friends/", "whitelist_status": "all_ads"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1521413980, "domain": "self.AeshmaHendrix", "full_link": "https://www.reddit.com/r/u_AeshmaHendrix/comments/85eya3/i_made_my_friend_smile/", "id": "85eya3", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": true, "permalink": "/r/u_AeshmaHendrix/comments/85eya3/i_made_my_friend_smile/", "pinned": false, "retrieved_on": 1521474873, "rte_mode": "markdown", "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "u_AeshmaHendrix", "subreddit_id": "t5_9f3oc", "subreddit_subscribers": 0, "subreddit_type": "user", "suggested_sort": "qa", "thumbnail": "self", "title": "I made my friend smile", "url": "https://www.reddit.com/r/u_AeshmaHendrix/comments/85eya3/i_made_my_friend_smile/"}, {"author": "AeshmaHendrix", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1515400033, "domain": "self.Anxiety", "full_link": "https://www.reddit.com/r/Anxiety/comments/7ox7g1/do_i_care_too_much/", "id": "7ox7g1", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Anxiety/comments/7ox7g1/do_i_care_too_much/", "pinned": false, "retrieved_on": 1515460555, "score": 9, "selftext": "I think I care and worry too much about people, even strangers. Im a very emotional Person and I think its a Problem because I will legit cry over someone I only know as a singer or youtuber etc. \nA good example is when I cried because of this man that had died off leukemia. Because a year ago I found a picture of him on the Internet and it inspired me to finally start writing my book, and the Main character is inspired by him. And when my friend found out who he was recently, my Main character and he had so much in common, and then I found out that man had died last year, which in my eyes made me way too emotional. \n\nOr when I get super happy over a youtuber being happy or my favorite singer. Its just weird and I feel like I have no right to be emotionally invested into any of these people because I infact dont really know them. So that worries me even more, I feel like I seem like a pretentious idiot to others and that upsets me. And I just worry too much in General. Idk ", "spoiler": false, "stickied": false, "subreddit": "Anxiety", "subreddit_id": "t5_2qmij", "subreddit_type": "public", "thumbnail": "self", "title": "Do I care too much?", "url": "https://www.reddit.com/r/Anxiety/comments/7ox7g1/do_i_care_too_much/", "whitelist_status": "all_ads"}]}