{"data": [{"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1bre3vhb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542164680, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ww4n3/sex_and_depression/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ww4n3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": true, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9ww4n3/sex_and_depression/", "pinned": false, "pwls": 0, "retrieved_on": 1542164681, "score": 1, "selftext": "I am 27. I haven't had sex since I was 19. I honestly don't even remember it very vividly as it was a hookup. I was diagnosed last year with Major Depression and anxiety and spent much of the subsequent time really working on becoming healthy. I feel like I have made great strides is all areas of my personal life except for dating and sex. I feel real anxiety when it comes to dating, not with meeting new people, or asking people out,  I feel like I know what to do but deep down I am unattractive and if I try to make things more flirtatious or physical or whathave you I am going to get \"found out,\" and exposed as an unattractive person who is inexperienced and therefore inept and embarrassing. Its easier to enjoy a conversation and go home than it is to risk intimacy, even if the moment is trending that way because of the potential for it to go bad and that for me would be incredibly damaging, like I think it would start a downward spiral and I'd lose all of the positive momentum I've made in taking my life back from my mental illness.  If it goes down the way I am imagining, but thats a big if too. I know I am missing out on something wonderful but I don't know what to do, I have a councillor I see but this isn't something that is as easy to talk about as depression with someone who just isn't experienced with this stuff. I'm just tired of missing out on the joys of life. I'm scared I'm never going to have a healthy sexual experience. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 405544, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "nsfw", "title": "sex and depression.", "url": "https://www.reddit.com/r/depression/comments/9ww4n3/sex_and_depression/", "whitelist_status": "no_ads", "wls": 0}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1bre3vhb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542164069, "domain": "self.SexPositive", "full_link": "https://www.reddit.com/r/SexPositive/comments/9ww1pw/do_i_need_to_see_a_sex_therapist/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ww1pw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": true, "permalink": "/r/SexPositive/comments/9ww1pw/do_i_need_to_see_a_sex_therapist/", "pinned": false, "retrieved_on": 1542164070, "score": 1, "selftext": "I am 27. I haven't had sex since I was 19. I honestly don't even remember it very vividly as it was a hookup. I was diagnosed last year with Major Depression and anxiety and spent much of the subsequent time really working on becoming healthy. I feel like I have made great strides is all areas of my personal life except for dating and sex. I feel real anxiety when it comes to dating, not with meeting new people, or asking people out,  I feel like I know what to do but deep down I am unattractive and if I try to make things more flirtatious or physical or whathave you I am going to get \"found out,\" and exposed as an unattractive person who is inexperienced and therefore inept and embarrassing. Its easier to enjoy a conversation and go home than it is to risk intimacy, even if the moment is trending that way because of the potential for it to go bad and that for me would be incredibly damaging, like I think it would start a downward spiral and I'd lose all of the positive momentum I've made in taking my life back from my mental illness.  If it goes down the way I am imagining, but thats a big if too. I know I am missing out on something wonderful but I don't know what to do, I have a councillor I see but this isn't something that is as easy to talk about as depression with someone who just isn't experienced with this stuff. I'm just tired of missing out on the joys of life.  I am getting older every year and farther away it seems from being able to have a healthy sexual experience. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SexPositive", "subreddit_id": "t5_2r7c9", "subreddit_subscribers": 36552, "subreddit_type": "public", "thumbnail": "nsfw", "title": "do I need to see a sex therapist?", "url": "https://www.reddit.com/r/SexPositive/comments/9ww1pw/do_i_need_to_see_a_sex_therapist/"}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1bre3vhb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542164011, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/9ww1g0/i_think_i_might_need_to_see_some_form_of_a_sex/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ww1g0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": true, "parent_whitelist_status": "house_only", "permalink": "/r/sex/comments/9ww1g0/i_think_i_might_need_to_see_some_form_of_a_sex/", "pinned": false, "pwls": 1, "retrieved_on": 1542164013, "score": 1, "selftext": "I am 27. I haven't had sex since I was 19. I honestly don't even remember it very vividly as it was a hookup. I was diagnosed last year with Major Depression and anxiety and spent much of the subsequent time really working on becoming healthy. I feel like I have made great strides is all areas of my personal life except for dating and sex. I feel real anxiety when it comes to dating, not with meeting new people, or asking people out,  I feel like I know what to do but deep down I am unattractive and if I try to make things more flirtatious or physical or what have you I am going to get \"found out,\" and exposed as an unattractive person who is inexperienced and therefore inept and embarrassing. Its easier to enjoy a conversation and go home than it is to risk intimacy, even if the moment is trending that way because of the potential for it to go bad and that for me would be incredibly damaging, like I think it would start a downward spiral and I'd lose all of the positive momentum I've made in taking my life back from my mental illness.  If it goes down the way I am imagining, but thats a big if too. I know I am missing out on something wonderful but I don't know what to do, I have a councillor I see but this isn't something that is as easy to talk about as depression with someone who just isn't experienced with this stuff. I'm just tired of missing out on the joys of life. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 1045621, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "nsfw", "title": "I think I might need to see some form of a sex therapist but I don't have access to one. 27M", "url": "https://www.reddit.com/r/sex/comments/9ww1g0/i_think_i_might_need_to_see_some_form_of_a_sex/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1bre3vhb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540186225, "domain": "self.dating", "full_link": "https://www.reddit.com/r/dating/comments/9qatee/how_do_you_keep_your_confidence_up_26m/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qatee", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "dating", "link_flair_richtext": [{"e": "text", "t": "I Need Advice"}], "link_flair_template_id": "19ec58c2-9f74-11e7-81a1-0e2bf15991f0", "link_flair_text": "I Need Advice", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/dating/comments/9qatee/how_do_you_keep_your_confidence_up_26m/", "pinned": false, "pwls": 1, "retrieved_on": 1540186226, "score": 1, "selftext": "I am a pretty confident guy, I am extraverted, I have fun I stay busy with lots of my hobbies and my friends. I am generally pretty happy but the one thing I know i'm not happy with is my dating situation. I am just not meeting people I am into. I am on all the apps and I don't get matches that I'm into. I don't think I have any unrealistic expectations about myself but to be striking out as much as I am, and to be as romantically lonely as I am, its making it harder and harder to not have your self worth start to come into question. I can't remember the last time I felt like wow this girl is definitely attracted to me. That is kind of crazy if I try to think about it objectively.  I don't know what I'm supposed to fix or what else I should do and that makes the loneliness feel like its something intrinsic to me.  I don't want to sound bitter or angry because I'm genuinely none of those things I am just lonely and a little frustrated. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "dating", "subreddit_id": "t5_2qhb1", "subreddit_subscribers": 44558, "subreddit_type": "public", "thumbnail": "self", "title": "How do you keep your confidence up? [26M]", "url": "https://www.reddit.com/r/dating/comments/9qatee/how_do_you_keep_your_confidence_up_26m/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1536642954, "domain": "self.dating", "full_link": "https://www.reddit.com/r/dating/comments/9eupaa/knowing_what_you_need/", "id": "9eupaa", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/dating/comments/9eupaa/knowing_what_you_need/", "pinned": false, "pwls": 1, "retrieved_on": 1536642955, "score": 1, "selftext": "I thought maybe I had no time for a relationship, It wouldn't be fair to a partner because of how much my life revolves around my goals and ambitions. I thought maybe I'd hook up with people but I'd never meet anyone I was interested.\n\nThe main thing I want is neither. I just want to feel wanted. I just want the feeling of knowing someone is thinking of you fondly. I haven't felt it in a long time and It feels petty and whiny to be so sad about that. This feeling of restlessness is apart of me as much as any other feelings are. Feeling intimate with another person is an important part of me and It feels unhealthy to live the way that I have. \n\nI truly believe there's nothing more I can do. All I do is live my life and enjoy as much of it as I can. Do work I love, be around friends that I love, experience things that are new, be extroverted and open and embracing of new people.  I really don't think I can do anything else that would classify as a positive change. Its just when I look back or take stock of things something is always missing, and its this very real, very deep feeling of loneliness, of feeling unwanted.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "dating", "subreddit_id": "t5_2qhb1", "subreddit_subscribers": 41627, "subreddit_type": "public", "thumbnail": "self", "title": "Knowing what you need.", "url": "https://www.reddit.com/r/dating/comments/9eupaa/knowing_what_you_need/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534570545, "domain": "self.dating_advice", "full_link": "https://www.reddit.com/r/dating_advice/comments/989edp/coming_at_this_from_the_wrong_place_mentally_27m/", "id": "989edp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/dating_advice/comments/989edp/coming_at_this_from_the_wrong_place_mentally_27m/", "pinned": false, "pwls": 6, "retrieved_on": 1534570546, "score": 1, "selftext": "I don't know if I really want someone or if I just want to feel wanted. I haven't felt that feeling in a long time, I almost forget how it feels. I'll preface this by saying I do have similar posts to this one in other subreddits I guess I'm piecing the feedback I get into something I can't doubt. \n\nI've spent a majority of my early 20s neither hooking up with anyone, and honestly not having a lot of romantic situations as a whole. I don't look at hookups as a especially fun idea,I spent most of my mid and late teens being in long term relationships.  I wonder what life experiences and lessons I could have learned had this gap in my early 20s  been less apparent in my life, am I missing out on becoming a better partner going forward? am I missing out on learning things about myself? I am not approaching this with a sense of entitlement, more like a grass actually being greener on the other side. It just feels like somethings missing and I haven't known how to address it.\n\nMy life is genuinely pretty good and getting better. I am experiencing a lot of new and exciting things, I am extraverted, I flirt I am the epitome of \"putting yourself out there\" and honestly it really isn't forced.  I am genuine about what I enjoy and what my values are. This doubt really only hits me when I sit to think about things and realize no matter how many things I enjoy and do to fill my time, I still feel lonely.  At the same time it is hard to continue to believe that I am good enough, when I feel like I am doing everything right and nothing feels like in this area is working. \n\nI just would love to learn how to think about this in a different way. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "dating_advice", "subreddit_id": "t5_2s4kl", "subreddit_subscribers": 402570, "subreddit_type": "public", "thumbnail": "self", "title": "Coming at this from the wrong place mentally. [27m]", "url": "https://www.reddit.com/r/dating_advice/comments/989edp/coming_at_this_from_the_wrong_place_mentally_27m/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534213716, "domain": "self.dating", "full_link": "https://www.reddit.com/r/dating/comments/974lbl/i_can_feel_myself_becoming_a_little_bitter_and_i/", "id": "974lbl", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "dating", "link_flair_richtext": [{"e": "text", "t": "Venting"}], "link_flair_template_id": "a616c322-194e-11e5-ab91-0ed1c06bdad7", "link_flair_text": "Venting", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/dating/comments/974lbl/i_can_feel_myself_becoming_a_little_bitter_and_i/", "pinned": false, "pwls": 1, "retrieved_on": 1534213717, "score": 1, "selftext": "I recently went to a concert with a friend to see a band I love. Live music is something that genuinely makes me happy. I think the big city can make a person really focus a lot on the negatives, the disconnects, the every man for themself type  rat race that exists, and so to be in a venue with a few hundred people that are enjoying themselves, loving something that you love, I always think thats quite cool.  a couple of times I'd see this young couple a row or two infront of me sharing a tender moment during some of the songs. Normally I'd think little of it, just two people being happy in this really happy environment. I caught myself feeling sad that I couldn't remember the last time I had a moment like that. I  don't think it was jealousy but just more of an awareness that something in my life has been missing, even in an environment that makes me feel happy. It wasn't a good feeling. I don't want to feel like that again. I don't want to look at happy people and feel anything other than happy.\n\nI have to preface this story with this: \n\nI've mentioned in previous posts that I've made really important strides of personal growth in a lot of areas in my life. One of the areas where that isn't the case is relationships and dating. I've spent a majority of my early 20s  neither hooking up with anyone, and honestly not having a lot of romantic situations as a whole.  I wonder what life experiences and lessons I could have learned had that been less true, am I missing out on becoming a better partner going forward? am I missing out on learning things about myself? I am not approaching this with a sense of entitlement, more like a grass actually being greener on the other side.  It just feels like somethings missing and I haven't known how to address it.\n\nMy life is genuinely pretty good and getting better. I am experiencing a lot of new and exciting things, I am extraverted, and I am genuine about what I enjoy and what my values are.  At the same time it is hard to continue to believe that I am good enough, when I feel like I am doing everything right and nothing feels like in this area is working? \n\nThanks for reading. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "dating", "subreddit_id": "t5_2qhb1", "subreddit_subscribers": 39684, "subreddit_type": "public", "thumbnail": "self", "title": "I can feel myself becoming a little bitter and I hate it.", "url": "https://www.reddit.com/r/dating/comments/974lbl/i_can_feel_myself_becoming_a_little_bitter_and_i/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533963329, "domain": "self.dating", "full_link": "https://www.reddit.com/r/dating/comments/96e2m5/figuring_out_my_mindset_when_it_comes_to_dating/", "id": "96e2m5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "dating", "link_flair_richtext": [{"e": "text", "t": "Venting"}], "link_flair_template_id": "a616c322-194e-11e5-ab91-0ed1c06bdad7", "link_flair_text": "Venting", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/dating/comments/96e2m5/figuring_out_my_mindset_when_it_comes_to_dating/", "pinned": false, "pwls": 1, "retrieved_on": 1533963330, "score": 1, "selftext": "This year has been a really interesting journey of developing myself and getting healthier. I finally had the time and effort to address my long term mental heath issues (MDD) and I am in a much healthier place now. Even when my depression was at its worst I was never socially awkward, I am extraverted, I flirted, I danced, because thats what normal healthy people do most of the closest people in my life are women, I have never had a hard time talking to women in general either. I worked really really hard to make sure nobody in my life could possibly know what was going on deep down.\n\nI've opened myself up to those closest to me and it's been better than I could have ever imagined, my close friendships have never been stronger. I feel like a lot of areas in my life are improving. The only area of my life that I feel my depression still touches is dating and sex. I can't remember what its like to have someone want me, or feel sexual tension. That scares me. I rarely find myself attracted to someone enough to actually go on a date or pursue a hook up but a part of me also feels like I am not good enough or hot enough to for someone even if I was interested in them. I am proud of the person I am, of my character and I feel like the only way someone could want me romantically or sexually is because they got to know that part of me, to make up for the areas that I feel like aren't objectively good enough. I feel like my dating life has been a bad sitcom, that theres an element of luck to meeting a compatible person that I just don't seem to have. I have spent a sizeable chunk of my 20s alone, and I wonder what life experiences and lessons I could have learned had that been less true, am I missing out on becoming a better partner going forward? am I missing out on learning things about myself? It just feels like somethings missing and I don't know how to address it.\n\nOk I don't want this to sound like some woe is me sob story. My life is genuinely pretty good and getting better. I am experiencing a lot of new and exciting things, its just those experiences contrast the romantic loneliness even more. How do I continue to believe that I am good enough, when I feel like I am doing everything right and nothing feels like in this area is working? It really seems like the only thing missing is luck, how do I even begin to control for that? I work really hard to do the right things, be extraverted be outgoing and try to have fun, to not focus on this outcome thing, or force things that aren't there. \n\nIn reading this I feel like i'm making no sense but if I am I'd love some help.\n\n**\\*\\*TL;DR\\*\\*:** Less depressed guy with a newer lease on life, still not doing the whole romantic/sex/dating thing well despite feeling like he's doing the right things. Feelsbadman.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "dating", "subreddit_id": "t5_2qhb1", "subreddit_subscribers": 39521, "subreddit_type": "public", "thumbnail": "self", "title": "Figuring out my Mindset when it comes to dating 27M", "url": "https://www.reddit.com/r/dating/comments/96e2m5/figuring_out_my_mindset_when_it_comes_to_dating/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533596588, "domain": "self.asexuality", "full_link": "https://www.reddit.com/r/asexuality/comments/95668r/i_think_i_am_somewhere_on_this_spectrum_but_id/", "id": "95668r", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/asexuality/comments/95668r/i_think_i_am_somewhere_on_this_spectrum_but_id/", "pinned": false, "pwls": 6, "retrieved_on": 1533596589, "rte_mode": "richtext", "score": 1, "selftext": "I don't know if I need a emotional connection to have sexual attraction, at a bare minimum I think I need to feel comfortable with the entire situation if that makes sense? The person, the environment etc.  I think I could feel sexual attraction to a person I just met, but It would be something cursory, like I couldn't just have sex with that person even though I can acknowledge that there'd be a set of circumstances where I would. I recently made really important strides in a life long journey with Bipolar disorder. I am in a place where my friendships and other relationships are healthy and fufilling, I am just wondering if my lack of confidence in the romantic relationship sense is from a strained mental health origin or from a Asexual, Gray, demisexuality covered up by years of mental illness. I am lonely. and not like friend lonely. romantically lonely. I have great friends. many of them are diverse in thought, gender, and ideas, but I still feel like somethings kind of missing. I've spent most of my early 20s alone and I am starting to wonder what about myself am I missing out on learning and experiencing by spending these years so alone.\n\nAny help would be wonderful Thank you!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "asexuality", "subreddit_id": "t5_2qv0q", "subreddit_subscribers": 23528, "subreddit_type": "public", "thumbnail": "self", "title": "I think I am somewhere on this spectrum but I'd like to know where.", "url": "https://www.reddit.com/r/asexuality/comments/95668r/i_think_i_am_somewhere_on_this_spectrum_but_id/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533595804, "domain": "self.demisexuality", "full_link": "https://www.reddit.com/r/demisexuality/comments/9562ko/i_think_i_am_demisexual_but_i_dont_know_and_the/", "id": "9562ko", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "permalink": "/r/demisexuality/comments/9562ko/i_think_i_am_demisexual_but_i_dont_know_and_the/", "pinned": false, "retrieved_on": 1533595805, "rte_mode": "richtext", "score": 1, "selftext": "I don't know if I need a emotional connection to have sexual attraction, at a bare minimum I think I need to feel comfortable with the entire situation if that makes sense? I think I could feel sexual attraction to a person I just met, but It would be something cursory, like I couldn't just have sex with that person even though I can acknowledge that there'd be a set of circumstances where I would. I recently made really important strides in a life long journey with Bipolar disorder. I am in a place where my friendships and other relationships are healthy and fufilling, I am just wondering if my lack of confidence in the romantic relationship sense is from a strained mental health origin or from a demisexuality covered up by years of mental illness. I am lonely. and not like friend lonely. romantically lonely. I have great friends. many of them are diverse in thought, gender, and ideas, but I still feel like somethings kind of missing. I've spent most of my early 20s alone and I am starting to wonder what about myself am I missing out on learning and experiencing by spending these years so alone.  \n\nAny help would be wonderful Thank you!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "demisexuality", "subreddit_id": "t5_2s5lq", "subreddit_subscribers": 5361, "subreddit_type": "public", "thumbnail": "self", "title": "I think I am Demisexual but I don't know and the resources make it even more confusing!", "url": "https://www.reddit.com/r/demisexuality/comments/9562ko/i_think_i_am_demisexual_but_i_dont_know_and_the/"}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532895554, "domain": "self.relationships", "full_link": "https://www.reddit.com/r/relationships/comments/92xox6/26m_what_is_the_line_between_alone_and_lonely/", "id": "92xox6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "new", "link_flair_richtext": [], "link_flair_template_id": "", "link_flair_text": "[new]", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationships/comments/92xox6/26m_what_is_the_line_between_alone_and_lonely/", "pinned": false, "pwls": 6, "retrieved_on": 1532895555, "rte_mode": "richtext", "score": 1, "selftext": "This year has been a really interesting journey of developing myself and getting healthier. I finally to the time and effort to address my long term mental heath issues (MDD) and I am in a much healthier place now. Even when my depression was at its worst I was never socially awkward, I am extraverted, I flirted, I danced, because thats what normal healthy people do most of the closest people in my life are women, I have never had a hard time talking to women in general either. I worked really really hard to make sure nobody in my life could possibly know what was going on deep down.\n\nI've opened myself up to those closest to me and it's been better than I could have ever imagined, my close friendships have never been stronger. I feel like a lot of areas in my life are improving. The only area of my life that I feel my depression still touches is dating and sex. I can't remember what its like to have someone want me, or feel sexual tension. That scares me. I rarely find myself attracted to someone enough to actually go on a date or pursue a hook up but a part of me also feels like I am not good enough or hot enough to for someone even if I was interested in them. I am proud of the person I am, of my character and I feel like the only way someone could want me romantically or sexually is because they got to know that part of me, to make up for the areas that I feel like aren't objectively good enough. I feel like my dating life has been a bad sitcom, that theres an element of luck to meeting a compatible person that I just don't seem to have. I have spent a sizeable chunk of my 20s alone, and I wonder what life experiences and lessons I could have learned had that been less true, am I missing out on becoming a better partner going forward? am I missing out on learning things about myself? It just feels like somethings missing and I don't know how to address it.\n\nOk I don't want this to sound like some woe is me sob story. My life is genuinely pretty good and getting better. I am experiencing a lot of new and exciting things, its just those experiences contrast the romantic loneliness even more. How do I continue to believe that I am good enough, when I feel like I am doing everything right and nothing feels like in this area is working? Again I work really hard to do the right things, be extraverted be outgoing and try to have fun, to not focus on this outcome thing, or force things that aren't there.\n\nIn reading this I feel like i'm making no sense but if I am I'd love some help.\n\n**\\*\\*TL;DR\\*\\*:** Less depressed guy with a newer lease on life, still not doing the whole romantic/sex/dating thing well despite feeling like he's doing the right things. Feelsbadman.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "subreddit_subscribers": 1415937, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "[26/M] What is the line between alone and lonely?", "url": "https://www.reddit.com/r/relationships/comments/92xox6/26m_what_is_the_line_between_alone_and_lonely/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532894873, "domain": "self.relationships", "full_link": "https://www.reddit.com/r/relationships/comments/92xltk/26m_what_is_the_line_between_alone_and_lonely/", "id": "92xltk", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "m-io personal", "link_flair_richtext": [], "link_flair_template_id": "0408f570-cb01-11e2-8906-12313d163d8f", "link_flair_text": "Personal issues", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationships/comments/92xltk/26m_what_is_the_line_between_alone_and_lonely/", "pinned": false, "pwls": 6, "retrieved_on": 1532894874, "rte_mode": "richtext", "score": 1, "selftext": "This year has been a really interesting journey of developing myself and getting healthier. I finally to the time and effort to address my long term mental heath issues (MDD) and I am in a much healthier place now. Even when my depression was at its worst I was never socially awkward, I am extraverted, I flirted, I danced, because thats what normal healthy people do most of the closest people in my life are women, I have never had a hard time talking to women in general either. I worked really really hard to make sure nobody in my life could possibly know what was going on deep down. \n\nI've opened myself up to those closest to me and it's been better than I could have ever imagined, my close friendships have never been stronger. I feel like a lot of areas in my life are improving. The only area of my life that I feel my depression still touches is dating and sex.  I can't remember what its like to have someone want me, or feel sexual tension. That scares me. I rarely find myself attracted to someone enough to actually go on a date or pursue a hook up but a part of me also feels like I am not good enough or hot enough to for someone even if I was interested in them. I am proud of the person I am, of my character and I feel like the only way someone could want me romantically or sexually is because they got to know that part of me, to make up for the areas that I feel like aren't objectively good enough. I feel like my dating life has been a bad sitcom, that theres an element of luck to meeting a compatible person that I just don't seem to have.  I have spent a sizeable chunk of my 20s alone, and I wonder what life experiences and lessons I could have learned had that been less true, am I missing out on becoming a better partner going  forward? am I missing out on learning things about myself? It just feels like somethings missing and I don't know how to address it. \n\nOk I don't want this to sound like some woe is me sob story. My life is genuinely pretty good and getting better.  I am experiencing a lot of new and exciting things, its just those experiences contrast the romantic loneliness even more. How do I continue to believe that I am good enough, when I feel like I am doing everything right and nothing feels like in this area is working? Again I work really hard to do the right things, be extraverted be outgoing and try to have fun, to not focus on this outcome thing, or force things that aren't there. \n\nIn reading this I feel like i'm making no sense but if I am I'd love some help.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "subreddit_subscribers": 1415900, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "[26/M] What is the line between alone and lonely?", "url": "https://www.reddit.com/r/relationships/comments/92xltk/26m_what_is_the_line_between_alone_and_lonely/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1531901727, "domain": "self.SexPositive", "full_link": "https://www.reddit.com/r/SexPositive/comments/8ztktl/how_to_get_over_nerves/", "id": "8ztktl", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": true, "permalink": "/r/SexPositive/comments/8ztktl/how_to_get_over_nerves/", "pinned": false, "retrieved_on": 1531901728, "rte_mode": "richtext", "score": 1, "selftext": "My prospects of losing my virginity this summer looks pretty good. I have a summer fling going on and it seems like things are progressing to where after we hang out again we might hookup. I have spent a lot of time studying sex, and how important foreplay is and how to be communicative. I just don't want her to know I'm a virgin, or be anything other than fun in bed. How do I get over this, What can i do to assure myself that things will be fine and she'll have a good time, because I'm not sure if I can enjoy it if I'm doubting that she is. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SexPositive", "subreddit_id": "t5_2r7c9", "subreddit_subscribers": 34115, "subreddit_type": "public", "thumbnail": "nsfw", "title": "how to get over nerves.", "url": "https://www.reddit.com/r/SexPositive/comments/8ztktl/how_to_get_over_nerves/"}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1531900951, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/8ztifx/how_to_get_over_being_nervous/", "id": "8ztifx", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/sex/comments/8ztifx/how_to_get_over_being_nervous/", "pinned": false, "pwls": 1, "retrieved_on": 1531900951, "rte_mode": "richtext", "score": 1, "selftext": "My prospects of losing my virginity this summer looks pretty good. I have a summer fling going on and it seems like things are progressing to where after we hang out again we might hookup. I have spent a lot of time studying sex, and how important foreplay is and how to be communicative. I just don't want her to know I'm a virgin, or be anything other than fun in bed. How do I get over this, What can i do to assure myself that things will be fine and she'll have a good time, because I'm not sure if I can enjoy it if I'm doubting that she is. \n\nThose who got over Dryspells how do you deal with the nerves?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 959868, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "How to get over being nervous.", "url": "https://www.reddit.com/r/sex/comments/8ztifx/how_to_get_over_being_nervous/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1531279642, "domain": "self.SexPositive", "full_link": "https://www.reddit.com/r/SexPositive/comments/8xw52l/virginity_and_antidepressants/", "id": "8xw52l", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "permalink": "/r/SexPositive/comments/8xw52l/virginity_and_antidepressants/", "pinned": false, "retrieved_on": 1531279643, "rte_mode": "richtext", "score": 1, "selftext": "I've mentioned this in other posts  in another sex subreddit but a big reason I believe for a lack of sexual intimacy in my own life has been from battling Bipolar Disorder. Not wanting to subject a potential romantic partner to the burden of my mental health ended a lot of the relationships I was in before they could really start. I would make the conscious decision to forgo emotional and physical intimacy for the calculated safety of knowing I could hide my issues if I didn't embrace the vulnerability of letting your guard down as you get to know someone. I still had a libido, I still had desires, I was just too scared of everything that came with it. I had friendships and dated socially and many of those friendships were with women, friendships I still have today. For some reason sex just never really happened. And I find myself soon to be 27 years old without having had sex.\n\n2 years ago I decided to seek help, and 2 years of therapy and months of medication I finally feel like I am healthy and happy and normal. But the Antidepressants I'm on have really done a number to my sexual desire. I was wondering if anyone on this subreddit has experience with a healthy sex life while on antidepressant and anti anxiety medication? I am finally healthy enough to have healthy relationships but I feel less physically ready to have them.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SexPositive", "subreddit_id": "t5_2r7c9", "subreddit_subscribers": 33867, "subreddit_type": "public", "thumbnail": "self", "title": "Virginity and Antidepressants.", "url": "https://www.reddit.com/r/SexPositive/comments/8xw52l/virginity_and_antidepressants/"}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1531278494, "domain": "self.DeadBedrooms", "full_link": "https://www.reddit.com/r/DeadBedrooms/comments/8xw0hf/antidepressants_and_sex_virginity_specifically/", "id": "8xw0hf", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/DeadBedrooms/comments/8xw0hf/antidepressants_and_sex_virginity_specifically/", "pinned": false, "pwls": 1, "retrieved_on": 1531278495, "rte_mode": "richtext", "score": 1, "selftext": "I've mentioned this in other posts on the sex subreddit but a big reason I believe for a lack of sexual intimacy in my own life has been from battling Bipolar Disorder. Not wanting to subject a potential romantic partner to the burden of my mental health ended a lot of the relationships I was in before they could really start. I would make the conscious decision to forgo emotional and physical intimacy for the calculated safety of knowing I could hide my issues if I didn't embrace the vulnerability of letting your guard down as you get to know someone. I still had a libido, I still had desires, I was just too scared of everything that came with it. I had friendships and dated socially and many of those friendships were with women, friendships I still have today. For some reason sex just never really happened. And I find myself soon to be 27 years old without having had sex.\n\n2 years ago I decided to seek help, and 2 years of therapy and months of medication I finally feel like I am healthy and happy and normal. But the Antidepressants I'm on have really done a number to my sexual desire. I was wondering if anyone on this subreddit has experience with a healthy sex life while on antidepressant and anti anxiety medication? I am finally healthy enough to have healthy relationships but I feel less physically ready to have them.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "DeadBedrooms", "subreddit_id": "t5_2t25p", "subreddit_subscribers": 82587, "subreddit_type": "public", "thumbnail": "self", "title": "Antidepressants and Sex (virginity specifically)", "url": "https://www.reddit.com/r/DeadBedrooms/comments/8xw0hf/antidepressants_and_sex_virginity_specifically/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1bre3vhb", "can_mod_post": false, "contest_mode": false, "created_utc": 1531276067, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/8xvqa8/antidepressants_and_sex/", "id": "8xvqa8", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/sex/comments/8xvqa8/antidepressants_and_sex/", "pinned": false, "pwls": 1, "retrieved_on": 1531276068, "rte_mode": "richtext", "score": 1, "selftext": "I've mentioned this in other posts on this subreddit but a big reason I believe for a lack of sexual intimacy in my own life has been from battling Bipolar Disorder. Not wanting to subject a potential romantic partner to the burden of my mental health ended a lot of the relationships I was in before they could really start. I would make the conscious decision to forgo emotional and physical intimacy for the calculated safety of knowing I could hide my issues if I didn't embrace the vulnerability of letting your guard down as you get to know someone. I still had a libido, I still had desires, I was just too scared of everything that came with it. I had friendships  and dated socially and many of those friendships were with women, friendships I still have today. For some reason sex just never really happened. And I find myself soon to be 27 years old without having had sex. \n\n2 years ago I decided to seek help, and 2 years of therapy and months of medication I finally feel like I am healthy and happy and normal. But the Antidepressants I'm on have really done a number to my sexual desire.  I was wondering if anyone on this subreddit has experience with a healthy sex life while on antidepressant and anti anxiety medication? I am finally healthy enough to have healthy relationships but I feel less physically ready to have them.  ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 954299, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Antidepressants and Sex", "url": "https://www.reddit.com/r/sex/comments/8xvqa8/antidepressants_and_sex/", "whitelist_status": "house_only", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1529604903, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/8su6cx/dryspells/", "id": "8su6cx", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": true, "parent_whitelist_status": "promo_adult", "permalink": "/r/sex/comments/8su6cx/dryspells/", "pinned": false, "pwls": 1, "retrieved_on": 1529604904, "rte_mode": "richtext", "score": 1, "selftext": "I am on a 2 year dryspell and with summer being in full swing the prospects of that ending are looking more and more likely.  I find when I am on dates, or meeting new people I get really nervous at the idea of having sex and being rusty.  It also makes me a little bit gunshy when it comes to flirting and pursuing women because I am scared that if we do hookup things won't go well. I am not sure what to expect when I do have sex in terms of how good I will be and the nervousness won't help the situation when it does happen but if it is a hookup I don't want to be awful after so long. Any help on not being scared of the rust?  ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 939403, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "nsfw", "title": "Dryspells", "url": "https://www.reddit.com/r/sex/comments/8su6cx/dryspells/", "whitelist_status": "promo_adult_nsfw", "wls": 3}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527106870, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/8lml3y/how_do_you_know_if_youre_some_spectrum_of_asexual/", "id": "8lml3y", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "promo_adult", "permalink": "/r/sex/comments/8lml3y/how_do_you_know_if_youre_some_spectrum_of_asexual/", "pinned": false, "pwls": 1, "retrieved_on": 1527106871, "rte_mode": "richtext", "score": 1, "selftext": "So in a previous post I mentioned how due to health and then in turn mental health circumstances I have ended up becoming a 26 year old virgin. I am in a much healthier place now and can finally focus on actually having a fruitful dating and hopefully fun sex life.  I am not socially awkward, I am very extraverted and in fact speak to a whole host of people for a living right now. I flirt and I ended my previous post with the thought that nobody in my life actually would know or believe that I had never had sex. \n\nSo I am a few months into this new life as a single person dating and I am realizing that no matter what app, or bar scene or co\\-ed sport, or outdoorsy type situation I find myself in with the opposite sex, I rarely find myself attracted to someone enough to actually go out there and try and date. I am almost dating just for the sake of dating and its starting to feel like a chore instead of being fun. I don't know why I don't feel attracted to these women, I am definitely not  into men whatsoever so I am not sure what is going on or what to do. I feel like its a switch, I have been attracted to women before and remember it being almost like a switch, but that the relationships were very passionate when that switch was flipped on. \n\nIn reading this I feel like i'm making no sense but if I am I'd love some help. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 918393, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "How do you know if you're some spectrum of Asexual?", "url": "https://www.reddit.com/r/sex/comments/8lml3y/how_do_you_know_if_youre_some_spectrum_of_asexual/", "whitelist_status": "promo_adult", "wls": 1}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527105976, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/8lmgvh/antidepressantsnsecond_thoughts_or_regrets/", "id": "8lmgvh", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/8lmgvh/antidepressantsnsecond_thoughts_or_regrets/", "pinned": false, "pwls": 6, "retrieved_on": 1527105977, "rte_mode": "richtext", "score": 1, "selftext": "This is my alternative or Throwaway account I guess. After more than 13 years \\(basically since puberty\\) of knowing that I had symptoms that felt like depression, I finally got the help I needed. I was 23 I decided to spent the entirety of the year focussed on being healthy above anything else. I sought out councillors, therapists and physicians and was prescribed Prozac and Wellbutrin. I feel better. It made therapy easier to connect to, it made the techniques easier to implement and it made me not feel destroyed by my symptoms. I am still on them and I still feel good. I have a degree in Psychology and pay attention to the myriad of medical and professional opinions about antidepressants. I've heard everything about them not being a cure, about them not addressing the real causes of depression. Sometimes I feel guilty for needing them. Like I should be able to come off of them now. They bridged me from a mindset grounded in despair and now I am in a place of optimism. Is that the drug? is that me? I was wondering what you're thoughts are on  this stuff. I wish I didn't need them sometimes, but the fact is I am a better person on them than off, atleast I think I am, I haven't gone off to see the other side in a long time. \n\nI'd love to hear your experiences with SSRI's", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 355550, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Antidepressants:nSecond thoughts or regrets?", "url": "https://www.reddit.com/r/depression/comments/8lmgvh/antidepressantsnsecond_thoughts_or_regrets/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1525833122, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/8i2jsc/building_momentum/", "id": "8i2jsc", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/8i2jsc/building_momentum/", "pinned": false, "pwls": 6, "retrieved_on": 1525833123, "rte_mode": "richtext", "score": 1, "selftext": "after 13 years of dealing with Major Depression Disorder I finally decided to get help. I decided that I would give myself all of 2018 to have getting better be my primary focus.  I am 5 months in an I after a lot of baby steps I finally feel like I am making progress. I finally feel like I've started to find the right medication, Finally met a therapist I connect with and finally feel healthy enough that I am building momentum in a few different areas of my life.  I can't believe this is probably what normal people feel like automatically.\n\nThis is where things get scary\n\nAny advice on how I can keep this going and not fuck this up? Is there any experience you have that can give me some insight into whether this is getting better or I can expect things to drop back to my normal old symptoms? \n\nI've learned a lot about myself, about others and about depression from this process of trying to get better. I am grateful for every babystep made and have tried to take every setback in stride.  I just  don't want it to be for nothing. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 352153, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Building momentum?", "url": "https://www.reddit.com/r/depression/comments/8i2jsc/building_momentum/", "whitelist_status": "all_ads", "wls": 6}, {"author": "AlternativeSecond", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1525724951, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/8hqpqu/throwaway_late_bloomer_virginity_help/", "id": "8hqpqu", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": true, "parent_whitelist_status": "promo_adult", "permalink": "/r/sex/comments/8hqpqu/throwaway_late_bloomer_virginity_help/", "pinned": false, "pwls": 1, "retrieved_on": 1525724953, "rte_mode": "richtext", "score": 1, "selftext": "I am 25 and a virgin and I need help that I haven't found in similar posts. I don't have social anxiety,  a healthy amount of my friends are women, actually like 60/40. I am active in extracurriculars and the community,  None of my friends would believe it if I told them the truth Im extraverted, I am not afraid to put myself out there, I enjoy public speaking I just don't think I fit whatever stereotype this situation would suggest I am. I just lied about losing it in highschool. I have been in relationships, Gotten to third base.  I attribute  my virginity to a couple of things, for most of my life I have dealt with Bipolar Disorder, I went untreated until this year and finally got the help and medication I need, If I was normal before I'm genuinely healthier than I've ever been now. I also have an all or nothing sort of switch when it comes to attraction to the opposite sex, it means my platonic relationships are fulfilling and successful but it also means that I don't meet a lot of women that I am into and when I do, they're taken or not interested or what have you. It just feels my pool of potential partners is smaller and I can't really get over it because it feels like something is missing to the point of almost discomfort when i'm on dates with women I don't feel a strong physical attraction to.  I don't feel bad about the situation I'm in beyond the social need to hide it because I am not the same person I was and I genuinely had bigger fires in my life to put out. \n\nI am not really sure what to do I want to lose it but I want to have sex with someone I'm into. I also love learning about sex, I love looking at real couples doing it and learning, I love looking online about how to go down, or ways to finger or ways to make your partner feel comfortable and enjoy the experience I believe sex is not just expression but a skill and if I am going to be with one person monogamously one day I want to develop a lifetime worth of skills \\(I know I sound like Napoleon Dynamite\\). \n\nI am just not really sure what to do or how to make this situation better.  I'd love to hear others point of view on this. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 907966, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "nsfw", "title": "Throwaway, Late Bloomer Virginity help?", "url": "https://www.reddit.com/r/sex/comments/8hqpqu/throwaway_late_bloomer_virginity_help/", "whitelist_status": "promo_adult_nsfw", "wls": 3}]}