{"data": [{"author": "amyrator", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zmwuz", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542691841, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/mathmemes/comments/9yp4ww/elegant_proof/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yp4ww", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": true, "is_robot_indexable": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 15, "num_crossposts": 0, "over_18": false, "permalink": "/r/mathmemes/comments/9yp4ww/elegant_proof/", "pinned": false, "retrieved_on": 1542691842, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "mathmemes", "subreddit_id": "t5_3fz4c", "subreddit_subscribers": 6372, "subreddit_type": "public", "thumbnail": "default", "title": "Elegant proof", "url": "https://i.redd.it/5wwxlqjd9fz11.jpg"}, {"author": "amyrator", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zmwuz", "can_mod_post": false, "contest_mode": false, "created_utc": 1539912823, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9pfbo1/running_out_of_options/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pfbo1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9pfbo1/running_out_of_options/", "pinned": false, "pwls": 6, "retrieved_on": 1539912824, "score": 1, "selftext": "I was diagnosed with depression ~2 years ago, but I’m pretty sure I’ve struggled with it for close to 9 years (I used to live in a country with not many mental health resources, and a lot of stigma around depression). I’m a college student and I’m on my fifth semester of college. My gpa is very low because I failed two semesters of college because of my depression, I had no motivation to do anything and I essentially could not see a future for myself. Not to mention I had undiagnosed ADHD which made it that much more difficult for me to pass my classes. I’ve managed to get myself together and stay in college.\nBut this semester has been particularly difficult for me; I am now on meds for Depression, anxiety, and adhd. However I haven’t taken my meds in a long time because I am upset at the fact that it seems I am unable to function without medicine, whereas my friends and family don’t need to swallow six pills everyday in order to be functional members of society. \nRecently, I’ve been having a very difficult time. I have cried everyday for the past month or so. I’m beginning to hate my room because I have cried so much in it, that all I can think about when I walk in is how sad I am. I’m usually able to hide my depression quite well from my friends and family, partly because I’m a very private person, and also because my depression is my problem and I feel like no one else should have to deal with it. A lot of my friends tell me I’m a ray of sunshine in their lives, and that I make them very happy and they look forward to seeing me and talking to me everyday, and I’m happy that I can be sunshine to other people, but I wish I wasn’t burning up inside. At times I hang out with friends and it takes everything in me to not burst into tears. But I’ve been pretending for so long that I think I’m forgetting how to. \nRecently I’ve been slipping up, my depression has been finding its way out of my head and into my words. People are starting to notice, people are starting to offer up their support, people are starting to ask if I’m okay, and I hate it. I hate that I can no longer keep up the facade, because I’m overflowing. I hate that I’m so exhausted. I hate that my roommates have heard me cry through the walls. I hate that I can’t even keep it together at school. I hate that I fight back tears during lunch. I hate that I can’t speak during lunch because I’m scared my voice will shake. I hate that I can’t even pretend to be happy anymore. \nWhat am I gonna do when I can’t be anyone’s sunshine anymore? Everyone will leave, because no one wants to deal with this. They’ll talk behind my back about how they’re “worried about me”. I’ll be alone, and out in the open for everyone to see. \nI feel like I’m losing myself and I don’t know what to do. Getting out of bed is hard. Sleeping is hard. Eating is hard. I’ve lost 20lbs in the past month. I sit at my desk to do homework but I just cry. I cry until I can’t anymore. I wake up with swollen eyes, and I continue to cry. I stand still as the days pass through me. I’m isolating myself from my friends. I don’t even remember what my laugh sounds like. \nWhenever I had a bad day, I used to tell myself that the sun would rise, and it was easy to believe this before because truly, the sun did rise. But now, it’s been dark for so long, it doesn’t seem like the sun is coming up anytime soon. I’m finding it hard to convince myself that this darkness will be followed by a sunrise, and this scares me because this was the only thing that got me through the night. this night is the longest it’s ever been. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397607, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Running out of options", "url": "https://www.reddit.com/r/depression/comments/9pfbo1/running_out_of_options/", "whitelist_status": "all_ads", "wls": 6}]}