{"data": [{"author": "Billie-Blue", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1istf9xr", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540571728, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9rmba6/i_need_help/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9rmba6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9rmba6/i_need_help/", "pinned": false, "pwls": 0, "retrieved_on": 1540571729, "score": 1, "selftext": "(The post is really complicated, mods can delete if it's a total nonesense)\n\nI don't even know how to start. I feel like shit. \n\nCurrently, I am on my final year of high school. In may I'll be writing the \"most important exam in my life\". The result is crucial to go to any college or university. I should be happy and excited. And I was, for a while...\n\nI have no motivation. None at all. \n\nI'm diagnosed with clinical depression and ADHD, plus have bad thyroid. As a result, I'm always sleepy (to the point of sleeping 11 - 12 hours daily with episodes of 16 - 18 hours of sleep once every two weeks or so), can't focus on anything that's not interesting to my stupid brain and I see no point in fighting it. \n\nI am on constant medication. I tried therapy, but no results, it keeps coming back. The doctors keep saying that all of my problems are because \"I have too little of vitamin D\".\n\nParents are not helping at all. My father believes in conspiracy theories, is an anti-vaxxer and tries to force me into being a perfect money making machine for his retirement. My mother is a fanatic catholic, and tries to blame me for my illnesses, because I'm \"not praying and I'm possessed\". They both dismiss anything I say, and don't care about how I feel.\n\nRecently... I got worse. I don't know how to deal with it, since it's the first time when it's not a typical depressive episode where I just... feel bad. I don't care about anything. I can't care. I'm unable to find anything interesting. I try to read books, look for new information, create music, play with my pets, other things that used to make me better... Nothing brings me joy anymore, and nothing can make my brain active again. I just kinda exist. Watch some stupid videos on youtube, sometimes play some video games, no emotions, no nothing. \n\nI skip school. I hate it. I used to love mathematics and my geography lessons. I tried to do extra biology myself... I can't give two fucks about it anymore, can't focus on lessons, can't even focus on procrastinating in class. I don't care if I pass, where will I go, how will I end up. Couple of months ago it'd give me a panic attack. \n\nI feel like I'm dead. I'm letting everyone down. I want to change, to be like I used to be: not exactly happy, but satisfied with my work. I want to give a shit about something and not be a brain dead zombie. I want to know why I'm so fucked up. I want to stop being a useless waste of everything.... I don't know how...", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 399377, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I need help...", "url": "https://www.reddit.com/r/depression/comments/9rmba6/i_need_help/", "whitelist_status": "no_ads", "wls": 0}]}