{"data": [{"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541651578, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/9v6yqp/i_dont_really_know_how_to_approach_this_situation/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9v6yqp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/ADHD/comments/9v6yqp/i_dont_really_know_how_to_approach_this_situation/", "pinned": false, "pwls": 0, "retrieved_on": 1541651580, "score": 1, "selftext": "Hello, I'm 17 years old and a senior in high school. When I was 15, after a terrible sophomore year and grades that absolutely ruined my GPA, I was diagnosed with both ADD and depression, and was given medication for both (Focalin and Celexa). I was under the impression that most medications work the same if they're made for the same illness, so when I returned to my psychiatrist for a checkup, I told her both worked very well and that I was feeling a lot happier, so I continued taking them.\n\nJunior year rolled around, and things were so much better than last year. I had a lot more drive, I got my work done, and I flourished socially, reconnecting with a lot of friends I sort of pushed away the year before. During this year, I made sure to take my focalin, but I gradually stopped taking celexa, because I felt like I didn't really need it. The summer after Junior year, I talked to my psychiatrist and got celexa taken off my prescription, still taking focalin. \n\nNow, it's my Senior year, and I am so fucked. It started off great, I got my work done and such, but all of the sudden, I lost my drive. I no longer could focus. I don't know when it started. The work I had was minimal, and I thankfully had very little homework, but I neglected five major assignments of this year, and now all of them are pressing down on me full force. I'm missing two essays in an allied health program (I want to be a nurse), I haven't done a psychology project that was due multiple weeks ago, and I told my teacher I emailed him the project, which he believes, and I haven't touched my college applications. I'm also missing a Senior Project essay on volunteer work I did during Junior year that was due a week ago, and it's required for me to graduate. Y'all wanna know what I'm doing about it? Nothing. I just wasted a four day weekend curled up in a chair on my phone, with my laptop open not 10 feet away with five blank documents all opened up. In fact, that's what I'm doing right now. Every day I took my meds, yet I still find myself just sitting in this damn chair. \n\nI have a regularly scheduled meeting with my psychiatrist tomorrow, should I say anything? I have slept plenty, yet I still feel so tired, and getting up out of this chair just to get my phone charger is itself a monumental task. Should I ask for a different type of medication? I don't particularly feel the same kind of depression I did two years ago, but this situation is leaving me feeling hopeless as I just watch the same youtube videos 100 times over instead of trying to just get my stupid work done. I'm so pissed at myself, because if I don't get this work done my life will be ruined, the dream I've had of becoming a male nurse since middle school will never come to fruition, and my parents will undoubtedly be dissapointed in me. I just don't know. Could somebody please help me out here, I don't know what to say or who to say it to, I just know SOMETHING isn't right anymore.\n\nSorry if this was hard to read/follow. Believe it or not, I took my medication 5 hours ago, and I haven't left this chair since. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "subreddit_subscribers": 316215, "subreddit_type": "public", "thumbnail": "self", "title": "I don't really know how to approach this situation, could I please get some help?", "url": "https://www.reddit.com/r/ADHD/comments/9v6yqp/i_dont_really_know_how_to_approach_this_situation/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541383721, "domain": "/r/interestingasfuck/comments/9u9ik7/the_way_my_shorts_change_color_in_the_presence_of/", "full_link": "https://www.reddit.com/r/interestingasfuck/comments/9u9ik7/the_way_my_shorts_change_color_in_the_presence_of/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9u9ik7", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": false, "is_video": true, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/interestingasfuck/comments/9u9ik7/the_way_my_shorts_change_color_in_the_presence_of/", "pinned": false, "pwls": 6, "retrieved_on": 1541383722, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "interestingasfuck", "subreddit_id": "t5_2qhsa", "subreddit_subscribers": 2744296, "subreddit_type": "public", "thumbnail": "default", "title": "The way my shorts change color in the presence of a blue Xbox controller", "url": "https://v.redd.it/vwrnxcj07fw11", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541167393, "domain": "self.smashbros", "full_link": "https://www.reddit.com/r/smashbros/comments/9tkcyt/how_prepared_should_i_be_for_the_initial_release/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9tkcyt", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "#494949", "link_flair_css_class": "switch", "link_flair_richtext": [{"e": "text", "t": "Ultimate"}], "link_flair_template_id": "328ff9f0-9493-11e8-bb38-0eab79b479bc", "link_flair_text": "Ultimate", "link_flair_text_color": "light", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/smashbros/comments/9tkcyt/how_prepared_should_i_be_for_the_initial_release/", "pinned": false, "pwls": 6, "retrieved_on": 1541167394, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "smashbros", "subreddit_id": "t5_2qiep", "subreddit_subscribers": 385960, "subreddit_type": "public", "thumbnail": "self", "title": "How prepared should I be for the initial release date for Smash Ultimate?", "url": "https://www.reddit.com/r/smashbros/comments/9tkcyt/how_prepared_should_i_be_for_the_initial_release/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540762917, "domain": "self.NoStupidQuestions", "full_link": "https://www.reddit.com/r/NoStupidQuestions/comments/9s71em/how_come_dogs_can_take_a_dump_without_peeing_but/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9s71em", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 14, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/NoStupidQuestions/comments/9s71em/how_come_dogs_can_take_a_dump_without_peeing_but/", "pinned": false, "pwls": 6, "retrieved_on": 1540762918, "score": 1, "selftext": "Every time I take my dog out to do his business, its always one or the other, and I've never seen him do both at the same time. How come humans don't have this superpower when we take dumps?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844", "subreddit_subscribers": 697967, "subreddit_type": "public", "thumbnail": "self", "title": "How come dogs can take a dump without peeing, but us humans ALWAYS pee every time we take a dump?", "url": "https://www.reddit.com/r/NoStupidQuestions/comments/9s71em/how_come_dogs_can_take_a_dump_without_peeing_but/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540191730, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qbd55/i_thought_i_was_past_this_now_im_scared_for_my/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qbd55", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qbd55/i_thought_i_was_past_this_now_im_scared_for_my/", "pinned": false, "pwls": 6, "retrieved_on": 1540191731, "score": 1, "selftext": "When I was 15 years old, after an absolutely abhorred sophomore year of high school, therapy, and the start of puberty (I know, I was a late bloomer), I was diagnosed with both ADD and depression, but by the time I could get medicated my grades already plummeted, the school year ended, and my GPA suffered. That year was the closest I came to suicide, and it scared me. That summer, I promised myself I would change, and I did. My mental health started to clear up, I got my learner's permit, and I was myself again. I was happy. Junior year rolled around, and still, things were great. I didn't put the past behind me, I simply accepted it as a part of me now, as it always will be. I told two of my closest friends about my experience that year, and although both of them sympathized with me, it was clear, fortunately, that neither had ever gone through anything similar. Academically and socially, I improved, and although I was able to revitalize old friendships and make new ones, the grades I got could never bring up my GPA high enough to what I thought was acceptable. By the end of my junior year, I thought it was over. I thought I had beaten depression. I knew the ADD would always be with me, and I always took my medication for that, but something, some voice deep down, told me to stop with the antidepressants, that they weren't natural, that I didn't need them to be happy. I don't know why I did it, but... I listened. I stopped taking my meds, which didn't take a lot of effort, and the next time I met with the person who had diagnosed me, I told her I didn't want them anymore, and she took me off them. I dumped the rest into a waste system our city used to combat the opioid epidemic, and that was that. I continued taking my ADD medication, and I thought I was happy. I believed I was happy. I TOLD myself that I was happy. I lied to myself. I didn't realize it, but I wasn't happy. The summer after I ended my junior year wasn't when it started to set in, I was too busy travelling and hanging with friends. I don't know how this came back, but by the middle of August, I began to feel something... familiar. It scared me when I recognized it, but not enough for me to speak up. What if my pharmacist thinks I just want to abuse them? What if people I know find out? What if this was just a small episode? These lingering doubts in my mind held me back until the beginning of this year. It started out well enough, as a now senior I felt somewhat empowered, but then it hit, and now I find myself caught in the same pit as two years ago, when all this started. I simply lost interest in my life, again, and now I don't know what to do.\n\n&amp;#x200B;\n\nI don't know what to do anymore. I'm scared. As of right now, it's 2:42 in the morning, and I have multiple papers and a big project due, not to mention the project and some papers are late and I had to lie for extra time. Plus, I haven't done a thing for my college applications, and I want to go to a nursing school. I hate myself. I don't have a shred of hope left in me, because even with my medication, I decide to waste my life posting this ridiculous cry for help on this godforsaken website. I really don't mean that, not the lack of hope, the godforsaken website. I... I want my life back. I want the drive I had last year, I want the real me, the real smile I wore to school. I want to be able to sincerely laugh with my friends instead of forcing a fake laugh out, which I'm getting paranoid they can see through. Please... if anybody knows what this feels like, I want to know what to do. I want to be a male nurse, I want to be someone my family can be proud of, I want to live my own life again.\n\n&amp;#x200B;\n\nI have two older brothers, both have just left for college, and only one of those brothers, my mom, and my two friends know about this. My father and my other brother don't know about this. I left therapy after sophomore year, and I haven't spoke to my therapist since. Sophomore year is still the closest I've been to suicide, but I feel like if this keeps up, the feelings I already have will grow, until I can't control them or myself anymore.\n\n&amp;#x200B;\n\nThanks to anyone who took the time to read this, it means a lot.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398256, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I thought I was past this, now I'm scared for my future.", "url": "https://www.reddit.com/r/depression/comments/9qbd55/i_thought_i_was_past_this_now_im_scared_for_my/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "can_mod_post": false, "contest_mode": false, "created_utc": 1537397840, "domain": "self.disney", "full_link": "https://www.reddit.com/r/disney/comments/9h9yc2/a_spectacular_night_at_disney_world/", "id": "9h9yc2", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "#014980", "link_flair_richtext": [{"e": "text", "t": "Walt Disney World"}], "link_flair_template_id": "cb852b1e-bbba-11e8-8fb5-0e08357abbe2", "link_flair_text": "Walt Disney World", "link_flair_text_color": "light", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/disney/comments/9h9yc2/a_spectacular_night_at_disney_world/", "pinned": false, "pwls": 6, "retrieved_on": 1537397841, "score": 1, "selftext": " \n\nAbout two months ago, 16 year old me, my 18 year old brother and my dad went off for a week long trip to Disney World. This was for no special occasion or anything, we just loved Disney, my dad and I especially. It was around this time that I was starting to learn the value of things, getting jobs and whatnot, so I really appreciated this trip much more than usual (our family has been a DVC member for years). It was a great trip, and the majority of it was what you would expect from Disney. Then, the last day of the trip completely blew my mind as to how amazing the Disney staff really is.\n\nTo give some context, I always love to try everything at Disney, and that'll sometimes mean I get left alone while the rest of my family relaxes, and since it was just me, my brother and my dad, there wasn't much stress put on sticking together. Also, this particular trip I had let out my childish mind more than usual, as I had the ingenious idea to make it a goal to get a picture with every Disney character I could find, although I kept to the ones wearing full suits because it was just easier that way, and I found them more enjoyable to be around. This goal directed a lot of the trip, leading into the last day, where we spent our time at Animal Kingdom.\n\nI had just finished getting the last pictures I needed, with Donald and Daisy Duck at Magic Kingdom (I got up early to get them quickly), so I thought my goal was complete, until my family got to Dinoland, U.S.A, where I found a special event going on called Donald's Dino Bash, which hosted Launchpad McQuack and Scrooge McDuck for pictures. I got pictures with the two of them easily, but although my current goal was completed, I thought of something that would change my day completely.\n\nAfter we finished our last FastPass at Everest, my brother and my dad left for the resort, because my bro wasn't feeling well and my dad went to take care of him, so I was alone. It was while I was exiting DINOSAUR that I thought of it: getting my favorite characters to sign my Disney hat, which I had long before the trip. After a very kind cashier at the DINOSAUR gift shop donated me her Sharpie to use, I got Scrooge's, Donald's, Launchpad's, and Daisy's signature on the top of my hat's rim thingy, and I wondered who else I wanted. Immediately what came to mind began my journey: Chip and Dale. When I met them, I thought they were genuinely the coolest characters, because of how funny the duo was, so I desperately wanted their signature. Thus, my journey began, and I checked my Mickey Mouse watch to see that it was about 5:30.\n\nThe first place I looked was Magic Kingdom, because when I went there early that morning for Donald and Daisy I saw them at the main entrance, but by then I already had their picture. After I noticed they weren't there, I wasted 15 minutes asking 5 different employees and getting 15 different answers as to where they could be in the park, until finally I gave up, and headed to the next area that I knew they had a spot in: Hollywood Studios.\n\nThe time was about 6:30 when I got there, and after speeding through the gates, I went to where I first met the duo, on Commissary Lane, only to find a simple souvenir stand with one employee, who generously offered me the times for tomorrow when they would be there. I thanked her profusely, and almost calmed down when I remembered I couldn't make those times. Tomorrow I left for home. I sprinted back to the bus. 6:45. The times are important because at 6:30, I was supposed to be at Teppan Edo, Epcot, for dinner with my dad and brother, who felt good enough to be there. I told my dad I was running late because the bus wasn't coming, but that was it. They didn't know what I was doing. I stood at the bus sign for a solid thirty seconds when I remembered a few days before, back at Epcot, I had seen Chip wandering around this restaurant I had never been to at The Land, called The Garden Grill, and I made the simple connection that wherever Chip was, so was Dale.\n\nWhen I got to Epcot, it was already 7:15. My dad and brother had finished dinner and were making their way back to the resort to rest before the fireworks at 9, so I was still a lone wolf. Tired from running, I defeatedly trudged through the automatic doors of The Land, and glanced at Soarin' before coming face to face with the Garden Grill. This was it. If they weren't here, then this whole ordeal would have been for nothing. Luckily, I saw them, greeting the different families, but my night was far from over.\n\nWhen I reached the front of the restaurant, I met the lady who would save my night. Her name was Stephanie, and after a short conversation about my lonesome journey to meet Chip and Dale just so they would sign my hat, she clearly felt bad, but she and I knew that there was only one way to meet the characters.\n\nReluctantly, I asked to be seated, party of one.\n\nTwo minutes passed, it was about 7:30, and my table was ready. At a booth designed to seat almost 6 people, I sat alone. Before I went up, I sent my dad one final text, telling him I was fine and eating dinner, but that was it, because before I could send anything else, my phone died. I was left at the mercy of The Garden Grill and its staff. Little did I know, there was a lot going on behind the scenes, as Stephanie, my hostess, worked her tail off to make this the most magical night ever for me. She managed to first find someone with a samsung charger who was willing to give it up, then took my phone to charge (with my consent, of course). After that, she knew I wanted pictures, so she convinced what was basically her supervisor to give up her phone so she could take pictures as all the characters passed by to greet me (Chip, Dale, Mickey and Pluto were the four going around). After eating to my heart's content and getting not only Chip's and Dale's, but Mickey's and Pluto's signature on the underside of my hat, I felt completely rejuvenated. Even though I was all alone, meeting all four of those characters was the most uplifting moment of my life. I was at such a low, sacrificing my family dinner just for a signature. I cried while waiting for my table, but having my hostess by my side, getting a hug from Mickey and Pluto (telling them I had a rough night), and personally sharing what happened with Chip and Dale (followed by tears, a thank you, and a big hug), was the biggest turnaround I ever had from any bad experience with Disney. I'm so glad my hostess was there to masterfully flip my situation around completely. My night was saved. But it doesn't end there.\n\nBy this time, about 8:50, I had finally received all the pictures my hostess took in great condition, as my phone had charged and I confirmed they were there. After receiving the photos, paying the bill, and thanking both Stephanie and my server - a sympathetic man named Tom - Stephanie suggested she walk me down to ride Soarin', since I didn't do that when I went a few days ago. Once more, miracles came to life. The greeters allowed me to use the FastPass line, and because of that, I got to ride on the last ride just in time. When I got off, I wanted to thank Stephanie one last time, so I went to do so, but I was told she had to clock out. I waited a few minutes, met up with her, and we walked out to the buses, chatting along the way. It was 9:15, and I had missed the fireworks with my family, but I didn't care. I had an amazing experience, and when the time came that we had to say goodbye, we hugged, I cried and thanked her many times, and we went our separate ways. \n\nI always wanted to share this story, but I never found the time to until now, and sharing it makes me hope that it makes others appreciate the tremendous lengths Disney goes to so they can guarantee that every guest has a magical visit, no matter what situation they're in. That hat means so much more to me now, and I want to frame it so my friends can ask, and I get to share this wonderful experience that completely made my Disney vacation. I'm now 17, but even still, I know I can be as young as I want to when I see those magical gates of pure Disney magic.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "disney", "subreddit_id": "t5_2qh8g", "subreddit_subscribers": 127504, "subreddit_type": "public", "thumbnail": "self", "title": "A Spectacular Night at Disney World", "url": "https://www.reddit.com/r/disney/comments/9h9yc2/a_spectacular_night_at_disney_world/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "can_mod_post": false, "contest_mode": false, "created_utc": 1537397243, "domain": "self.WaltDisneyWorld", "full_link": "https://www.reddit.com/r/WaltDisneyWorld/comments/9h9voi/a_spectacular_night_at_disney_world/", "id": "9h9voi", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "#00a6a5", "link_flair_richtext": [{"e": "text", "t": "Trip Report"}], "link_flair_template_id": "c2dd7eb8-9a71-11e8-9a61-0e1bc8da3394", "link_flair_text": "Trip Report", "link_flair_text_color": "light", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/WaltDisneyWorld/comments/9h9voi/a_spectacular_night_at_disney_world/", "pinned": false, "pwls": 6, "retrieved_on": 1537397244, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "WaltDisneyWorld", "subreddit_id": "t5_2te6p", "subreddit_subscribers": 67082, "subreddit_type": "public", "thumbnail": "self", "title": "A Spectacular Night at Disney World", "url": "https://www.reddit.com/r/WaltDisneyWorld/comments/9h9voi/a_spectacular_night_at_disney_world/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1vj2s4as", "can_mod_post": false, "contest_mode": false, "created_utc": 1536282230, "domain": "self.WaltDisneyWorld", "full_link": "https://www.reddit.com/r/WaltDisneyWorld/comments/9dp8gs/a_truly_spectacular_disney_experience/", "id": "9dp8gs", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/WaltDisneyWorld/comments/9dp8gs/a_truly_spectacular_disney_experience/", "pinned": false, "pwls": 6, "retrieved_on": 1536282231, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "WaltDisneyWorld", "subreddit_id": "t5_2te6p", "subreddit_subscribers": 66068, "subreddit_type": "public", "thumbnail": "self", "title": "A Truly Spectacular Disney Experience", "url": "https://www.reddit.com/r/WaltDisneyWorld/comments/9dp8gs/a_truly_spectacular_disney_experience/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532995464, "domain": "self.disney", "full_link": "https://www.reddit.com/r/disney/comments/939he8/an_unforgettable_disney_experience/", "id": "939he8", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/disney/comments/939he8/an_unforgettable_disney_experience/", "pinned": false, "pwls": 6, "retrieved_on": 1532995465, "rte_mode": "markdown", "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "disney", "subreddit_id": "t5_2qh8g", "subreddit_subscribers": 121934, "subreddit_type": "public", "thumbnail": "self", "title": "An Unforgettable Disney Experience", "url": "https://www.reddit.com/r/disney/comments/939he8/an_unforgettable_disney_experience/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Butter_Patrol", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532930099, "domain": "self.disney", "full_link": "https://www.reddit.com/r/disney/comments/931jc3/an_unforgettable_disney_experience/", "id": "931jc3", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/disney/comments/931jc3/an_unforgettable_disney_experience/", "pinned": false, "pwls": 6, "retrieved_on": 1532930100, "rte_mode": "markdown", "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "disney", "subreddit_id": "t5_2qh8g", "subreddit_subscribers": 121852, "subreddit_type": "public", "thumbnail": "self", "title": "An Unforgettable Disney Experience", "url": "https://www.reddit.com/r/disney/comments/931jc3/an_unforgettable_disney_experience/", "whitelist_status": "all_ads", "wls": 6}]}