{"data": [{"author": "carelessfunction", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_27f56jkf", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541750412, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9vimzb/im_hopeless/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9vimzb", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9vimzb/im_hopeless/", "pinned": false, "pwls": 0, "retrieved_on": 1541750412, "score": 1, "selftext": "Never posted on reddit before and not that good at english but I have to rant. I have been diagnosed with BP2 and I fucking hate myself. Going through serious depressive episode right now. I'm ranting here since I hate putting my problems on even my psychiatrist or my closest friends (who are somehow still here after me being an asshole) that actually care and listen, because everytime I think about putting my problems to them I get really anxious and have had panic attacks because I dont want to ruin happy peoples lives. I've always been too emphatic, so much that it actually just feels terrible which it shouldn't. I'm really sorry I'm sharing my problems to you even. I'm pretty sure one day the bubble I've been gathering all of this time is going to explode, tbh I think it exploded right now. I don't see the point of giving anything on any aspect of my life since I'm going to kill myself regardless at some point. I have tried studying in three different schools but can't make anything to work. All of these school starts were made while hypomanic and I quit them in under a year. I'm completely useless and have not achieved anything remarkable in my life. Today I tried to overdose with speed on purpose, had overdose in the back of my mind and was acting like I dont care what is going to happen to me while continually injecting many doses. ''Luckily'' I'm still alive. Unluckily I cant sleep for couple days after this while having depressive thoughts. Speed and alcohol actually makes me happy for a while even though after those come down I feel worse than ever for several days. I used to have many friends, girlfriends and loved my personality and myself generally. Now the only time I feel anything is during hypomania and I can't even describe my feelings I feel during that time. That's also the only time I make any new friendships, have sex with random girl or even socialize in general. And then I fall to great depression everytime that I can't control and ruin those relationships I have managed by isolating myself and pushing everyone away. I have pushed everyone important for me away for the past 5 years and I hate myself for that. The older I get the less I enjoy my life. I'm really sorry for this insanely fucking depressing post that makes no sense probably. Just rambling while coming down from drugs. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 403638, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm hopeless", "url": "https://www.reddit.com/r/depression/comments/9vimzb/im_hopeless/", "whitelist_status": "no_ads", "wls": 0}, {"author": "carelessfunction", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_27f56jkf", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541749737, "domain": "self.bipolar2", "full_link": "https://www.reddit.com/r/bipolar2/comments/9vikyj/im_hopeless/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9vikyj", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "permalink": "/r/bipolar2/comments/9vikyj/im_hopeless/", "pinned": false, "retrieved_on": 1541749738, "score": 1, "selftext": " Never posted on reddit before and not that good at english but I have to rant. I have been diagnosed with BP2 and I fucking hate myself. Going through some serious depression episode right now. I'm ranting here since I hate putting my problems on even my psychiatrist or my closest friends (who are somehow still here after me being an asshole) that actually care and listen, because everytime I think about putting my problems to them I get really anxious and have had panic attacks because I dont want to ruin happy peoples lives. I've always been too emphatic, so much that it actually just feels terrible which it shouldn't. I'm really sorry im sharing my problems to you even. I'm pretty sure one day the bubble I've been gathering all of this time is going to explode, tbh I think it exploded right now. I don't see the point of giving anything on any aspect of my life since I'm going to kill myself regardless at some point. I have tried studying in three different schools but can't make anything to work. All of these school starts were made while hypomanic and I quit them in under a year. I'm completely useless and have not achieved anything remarkable in my life. Today I tried to overdose with speed on purpose, had overdose in the back of my mind and was acting like I dont care what is going to happen to me while continually injecting many doses. ''Luckily'' I'm still alive. Unluckily I cant sleep for couple days after this while having depressive thoughts. Speed and alcohol actually makes me happy for a while even though after those come down I feel worse than ever for several days. I used to have many friends, girlfriends and loved my personality and myself generally. Now the only time I feel anything is during hypomania and I can't even describe my feelings I feel during that time. That's also the only time I make any new friendships, have sex with basically random girl or even socialize in general. And then I fall to great depression everytime that I can't control and ruin those relationships I have managed by isolating myself and pushing everyone away. I have pushed everyone important for me away for the past 5 years and I hate myself for that. The older I get the less I enjoy my life. I'm really sorry for this insanely fucking depressing post that makes no sense probably. Just rambling while coming down from drugs. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "bipolar2", "subreddit_id": "t5_31khp", "subreddit_subscribers": 7077, "subreddit_type": "public", "thumbnail": "self", "title": "I'm hopeless", "url": "https://www.reddit.com/r/bipolar2/comments/9vikyj/im_hopeless/"}, {"author": "carelessfunction", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_27f56jkf", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541747607, "domain": "self.BipolarReddit", "full_link": "https://www.reddit.com/r/BipolarReddit/comments/9vieao/feeling_really_down/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9vieao", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/BipolarReddit/comments/9vieao/feeling_really_down/", "pinned": false, "pwls": 0, "retrieved_on": 1541747608, "score": 1, "selftext": "Never post on reddit and not that good at english but I have to rant. I have been diagnosed with BP2 and Anathodia and I fucking hate myself. I'm ranting here since I hate putting my problems on even my psychiatrist or my closest friends that actually care and listen, because everytime I think about putting my problems to them I get really anxious and even have had a couple panic attacks because I dont want to ruin happy peoples lives. I'm really sorry im sharing my problems to you even. I'm pretty sure one day the bubble I've been gathering all of this is going to explode.  I don't see the point of giving anything on any aspect of my life since I'm going to kill myself regardless at some point. Today I tried to overdose on speed by continually injecting. ''Luckily'' I'm still alive. I used to have many friends, girlfriends and loved my personality and myself generally. Now the only time I feel anything is during hypomania and I can't even describe my feelings I feel during that time. That's also the only time I make any new friendships and then I fall to great depression everytime that I can't control and ruin those relationships I have managed by isolating myself and pushing everyone away. I have pushed everyone important for me away for the past 5 years and I hate myself for that. I actually used to love life even though i have had BP2 symptoms all my life since i remember, from what, 13-14 years old? But I never really understood it. The older I get the less I enjoy my life.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "BipolarReddit", "subreddit_id": "t5_2qzru", "subreddit_subscribers": 26646, "subreddit_type": "public", "thumbnail": "self", "title": "Feeling really down", "url": "https://www.reddit.com/r/BipolarReddit/comments/9vieao/feeling_really_down/", "whitelist_status": "no_ads", "wls": 0}]}