{"data": [{"author": "darkmoonsea", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1sjxtx4k", "can_mod_post": false, "contest_mode": false, "created_utc": 1538498373, "domain": "self.alcoholism", "full_link": "https://www.reddit.com/r/alcoholism/comments/9ks8ck/is_it_recovery_if_you_never_let_the_addiction/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ks8ck", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/alcoholism/comments/9ks8ck/is_it_recovery_if_you_never_let_the_addiction/", "pinned": false, "pwls": 1, "retrieved_on": 1538498373, "score": 1, "selftext": "Does it count as recovery if you've never let the addiction begin? \n\nMy mom and dad are severe alcoholics, but dad turned to smoking weed once he started getting too old to handle the booze. Both started when they divorced when I was young. I watched for years them turning to the whiskey to cope with our struggles and relaxing for once. I watched for years the booze turning them into abusers. \n\nThose are the 2 things I battle with while staring at the bottle of whiskey on my counter for weekends with my roommates. \n\nI work full time overnight, and coming home from work I find myself wanting to take a swig or two to try and grasp to the warm feeling I receive from it on the nights we take shots for fun. It works to help me forget everything happening in my life. I also know that I become so angry and nasty when I drink, even just a little bit. All of my pent up anger and stress from my day to day life come flooding out all at once; and I feel so free\n\nFor once I allow myself to feel everything, when my mind is clouded my thoughts are clear. And it's dangerous. \n\nI'm only 19 dealing with me weighing between drinking to cope and coping without drinking. I'm already finding myself following the path of recovery without it never fully starting", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "alcoholism", "subreddit_id": "t5_2rgl1", "subreddit_subscribers": 14773, "subreddit_type": "public", "thumbnail": "self", "title": "Is it recovery if you never let the addiction begin?", "url": "https://www.reddit.com/r/alcoholism/comments/9ks8ck/is_it_recovery_if_you_never_let_the_addiction/", "whitelist_status": "house_only", "wls": 1}, {"author": "darkmoonsea", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1sjxtx4k", "can_mod_post": false, "contest_mode": false, "created_utc": 1538496858, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ks075/im_diagnosed_i_recognize_my_symptoms_in_my_day_to/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ks075", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ks075/im_diagnosed_i_recognize_my_symptoms_in_my_day_to/", "pinned": false, "pwls": 6, "retrieved_on": 1538496859, "score": 1, "selftext": "I still find myself running from it everyday, unable to accept it no matter how hard I try", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 392060, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm diagnosed, I recognize my symptoms in my day to day life; and yet", "url": "https://www.reddit.com/r/depression/comments/9ks075/im_diagnosed_i_recognize_my_symptoms_in_my_day_to/", "whitelist_status": "all_ads", "wls": 6}, {"author": "darkmoonsea", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1sjxtx4k", "can_mod_post": false, "contest_mode": false, "created_utc": 1535843939, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/trees/comments/9c7k13/first_toke_up_after_a_tolerance_break_from_hell/", "id": "9c7k13", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/trees/comments/9c7k13/first_toke_up_after_a_tolerance_break_from_hell/", "pinned": false, "pwls": 1, "retrieved_on": 1535843940, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_subscribers": 1190370, "subreddit_type": "public", "thumbnail": "default", "title": "First toke up after a tolerance break from hell. Been exactly 2 months since I moved to the other side of this state and lost all of my connections. Took me a long ass time, but finally found a plug in this shitty ass town (illegal state)", "url": "https://i.redd.it/sq0t4lc1npj11.jpg", "whitelist_status": "house_only", "wls": 1}, {"author": "darkmoonsea", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533820020, "domain": "self.trees", "full_link": "https://www.reddit.com/r/trees/comments/95w9sk/i_miss_weed_how_it_helped_me_illegal_state/", "id": "95w9sk", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/trees/comments/95w9sk/i_miss_weed_how_it_helped_me_illegal_state/", "pinned": false, "pwls": 1, "retrieved_on": 1533820021, "rte_mode": "richtext", "score": 1, "selftext": "This is a long one, but I really want to talk about it and I feel like this might be the place to do so. If it doesn't belong here, just let me know and I'll take it down and post it in a subreddit more appropriate. I've just been following this one since I made a reddit, and the community here seems like one that wouldn't mind listening and talking.\n\nI hate to admit that I've been smoking since I was a young teenager. At the age of 14, my sister had peer pressured me into smoking weed with her. I was a champ first go so to speak, it was a small party with a bunch of stoners and she didn't want me to feel left out. What harm could it really do? So I partook it in the games like roach king, and participated in shot guns, all while hotboxing the entire house. For the first time in my life I wasn't just her little sister that tagged along; I was finally apart of it all.\n\nI smoked from time to time the following years, scared off a bit from it as my dad was against me smoking as a minor and someone had mixed a blunt with K2 while I was unaware of it, and it lead to me having a seizure. It broke my newfound relationship with weed. It also broke the newfound bond I shared with my sister and friends. \n\nAfter graduating high school at 17 in May 2017, I ended up going through a complete mental snap. We don't really know what caused it, but it broke a dam that held back so much. After months of trial and error to escape my problems, I admitted myself to the mental hospital when I turned 18 the following August and was diagnosed with a crazy amount of disorders. To name a few, the key ones; borderline personality disorder, OCD, PTSD, major depressive disorder with psychotic features, perception disturbance and dissociative disorder. I was 18 for less than a month, and suddenly the world fell on my shoulders. How was I supposed to be okay with these disorders?\n\nI took the meds, I did the therapy, I tried. But everything was so far ingrained into who I was, that taking it all away turned me into a blank slate. I wouldn't describe it as being a zombie, but becoming hyper aware as to how little I knew myself without the symptoms fucked up my head. I had to stop the meds. As much as they helped me feel better during the crisis, once it was over the benefits just got in the way. A few months pass and something told me to rekindle this relationship with weed. \n\nI finally said yes the next time my sister asked me to smoke with her (she asked me every time she had weed) and it felt like a weight was lifted off of my chest and I could actually breathe. Of course the paranoia from the K2 incident was still there, but I fought against it and kept smoking every time she asked me if I wanted to. It eventually led to me going out with her everyday to go and smoke with her friends, and eventually buying weed for myself for the first time. Our relationship as sisters grew into a bond that no one could break, and weed became my best friend. My dad started to smoke with me soon afterwards, even opening up my world to concentrates when we could afford it. My family finally felt like a family, I wasn't ignored anymore.\n\nBut it did more than that, so much more. Getting high would force me into a single \"reality\" and I wouldn't slip into dissociative episodes anymore, my compulsions weren't as frequent, my emotions were at a \"regular\" and manageable level, and my learned behavior from past traumas weren't needed as much. Weed let me **function** again. I was able to get a job in customer service despite my psychiatrist wanting me to go on disability and deemed me incapable of working, and I maintained it for 6 months before I moved out of town. I was able to take up things I enjoyed again, like how I began listening to music for pleasure for the first time in 9 months. \n\nThis passionate memoir about how weed has been my savings grace does not end in a happy ending though. Early May this year, I was forced to move out of my dads house because it became abusive and toxic: my family could no longer smoke weed due to CPS being called on my sister and her 2 kids. Their dependency on weed for their own emotional and mental problems led to abuse and neglect directly towards me. I moved into a family friends house to escape it, and before I had a chance to go and pick up what I had left, my family had empty out my room and thrown everything away. All I had to my name was a week worth of clothes and a few possessions from my childhood. \n\nThe situation at my family friends became toxic as well, leaving no choice but to move what little bit I had hours away to stay in a friends living room. So on the second of last month, I ended up here and I've never been so devastated. Estranged from my family at 18, barely anything to my name, and I've never felt so lost. I hold my head up though. I got a new job and work full time, I'm making friends outside of my roommates. The only thing missing is weed. With my roommates not being stoners (but are supportive of me smoking) and too scared to try and find a dealer out here as I know almost nothing about weed personally, my sister and dad always dealt with it for me to keep me safe, my mental health is dwindling and fast.\n\nMe and my long term boyfriend are set to get married December 2019 and he's military. He's stationed in the town I just moved from for the next three years, otherwise I'd save up and relocate to a legal state where access is easy. It'd be easy, I only really have the 2 friends that are my roommates and him. Everything else has been ripped away from me. \n\nI miss weed more than anything, escaping my reality and living in a functioning one was so much easier. And it's not hard to see as to how beneficial it would be at a time like this. But for now I'm standing my ground, biting my tongue and powering through. I picked up smoking cigarettes to maybe take some edge off of it all, and now I'm finally opening up and talking about this all for the first time.\n\nMy birthday is August 22, I will be 19, and a lot has changed for me in the matter of a year. I wish I still had weed to help me through.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_subscribers": 1178036, "subreddit_type": "public", "thumbnail": "self", "title": "I miss weed: how it helped me (illegal state)", "url": "https://www.reddit.com/r/trees/comments/95w9sk/i_miss_weed_how_it_helped_me_illegal_state/", "whitelist_status": "house_only", "wls": 1}, {"author": "darkmoonsea", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532111747, "domain": "self.DDLGconfess", "full_link": "https://www.reddit.com/r/DDLGconfess/comments/90ijcz/he_refuses_to_look_into_daddy/", "id": "90ijcz", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "permalink": "/r/DDLGconfess/comments/90ijcz/he_refuses_to_look_into_daddy/", "pinned": false, "retrieved_on": 1532111748, "rte_mode": "markdown", "score": 1, "selftext": "~Its a long one~\n\nMy boyfriend is the sweetest man I've ever met, he loves and adores me despite my very colorful and gruesome past, he wants to spend the rest of his life with me and I him. \n\nHe was a virgin. Was, now he's not, and we have an okay sex life but I'm not satisfied. I was never able to handle a genuine ddlg relationship, just some of the aspects in the bedroom. But I crave it so bad, constantly. \n\nHe won't touch me maliciously, at all. He has never smacked my ass, never choked me, never tied me up, never used toys, never pulled my hair, never just taken control and enjoyed my body as his own playground. And he never will. I've begged and begged for him to do something, anything! He just won't do it, he won't even try to explore it with me.\n\nI'm fine with letting go of the daddy kink for him, and I tried so hard to be alright without all of the fun stuff in the bedroom, but it's getting so hard. I've never cheated in any past relationships, nor have I cheated on him in this own, but the thought keeps creeping up like vomit in the back of the throat. \n\nWe're a long distance relationship until we get married in May, less than a 2 hour drive from each other. He's just military, so it's next to impossible for him to come visit. When he does it's great, we kiss and cuddle and go to the amusement park. It's always a great time and I love him more than anything for always trying to make it work between us.\n\nWe video chatted sexually for the first time the other night and I couldn't stop thinking about all of the aspects of ddlg that would benefit our sex life from afar if he would JUST CONSIDER IT. I got upset and told him I had to leave and I'll text him later. I've been avoiding it ever since because it just makes my blood boil.\n\nI live with my best friend of 3 years (we have a sexual past together at that) and her boyfriend, and they have a ddlg based sex life. We've considered a 3 some so many times, but the rule would always be me and the boyfriend can't touch each other. Mostly because her previous boyfriend was madly in love with me before dating her and it fucked with her head really badly. So it's mostly to keep her calm about the idea of losing her boyfriend to me, I respect that. I love my best friend and I never even considered it a problem, but\n\nI was fine with that arrangement when I wasn't with my current boyfriend because I was being satisfied by a close friend turned FWB (that did give me everything I've ever wanted in the bedroom, except be willing to love me). \n\nI've had to back out so many times because I crave that contact from a man and the boyfriend gives it to my best friend so willing and not just in private but in front of me as well. I don't want to jeopardize our roommate situation let alone our friendship or my relationship with my boyfriend all over some kinky contact. Now my desperation for this contact is forcing an attraction to the boyfriend \n\nMy boyfriend does know about the 3some, he's fine with it because he knows I have no sexual attraction to the boyfriend. Which you now know isn't the case\n\nI already know the solution is to talk to my roommates and let them know how I feel as well as sit my boyfriend down and really explain to him about everything. I know, I know. I've done laps and laps in my head about it for a month now. Just really needed to vent because if I bottled it up any longer, I was going to end up snapping on my best friend when I don't mean to. \n\nTL:DR my boyfriend won't sexually satisfy me and I can't stop day dreaming about the sexual contact my best friend receives from her boyfriend (both are my roommates) to the point that I can't even allow myself to be in a 3 some with them that I've agreed to so many times before\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "DDLGconfess", "subreddit_id": "t5_354y7", "subreddit_subscribers": 3125, "subreddit_type": "public", "thumbnail": "self", "title": "He refuses to look into Daddy", "url": "https://www.reddit.com/r/DDLGconfess/comments/90ijcz/he_refuses_to_look_into_daddy/"}]}