{"data": [{"author": "Dazven", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_pozcl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542767236, "domain": "self.reddeadredemption", "full_link": "https://www.reddit.com/r/reddeadredemption/comments/9yz0a8/mark_johnson_bounty_mission/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yz0a8", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/reddeadredemption/comments/9yz0a8/mark_johnson_bounty_mission/", "pinned": false, "pwls": 6, "retrieved_on": 1542767238, "score": 1, "selftext": "I took this bounty as I find bounty hunting missions rather fun. But when I got to him, listened to their conversation, and then listened to his proposal of coming peacefully I decided that I would let him go. Walking away actually provoked a voice line of \"he's showing us clemency, run before he changes his mind\" and him as well as his family escaping took me to a mission failed screen. \n\n&amp;#x200B;\n\nAm I not allowed to let them go? I really do not want to take him in when he really seems like a changed man with a family. I mean he was unarmed, surrendered, and tried to come peacefully. Whatever he did in the past and with his attitude isn't worth a $25 bounty for separating him from his family.\n\nI know it's a game, but I like to do good rather than some side mission that forces me to take in someone who doesn't seem that criminal.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "reddeadredemption", "subreddit_id": "t5_2rn7o", "subreddit_subscribers": 309127, "subreddit_type": "public", "thumbnail": "self", "title": "Mark Johnson Bounty Mission", "url": "https://www.reddit.com/r/reddeadredemption/comments/9yz0a8/mark_johnson_bounty_mission/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Dazven", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_richtext": [{"e": "text", "t": "new user/low karma"}], "author_flair_text": "new user/low karma", "author_flair_text_color": "dark", "author_flair_type": "richtext", "author_fullname": "t2_pozcl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542407533, "domain": "self.starcitizen", "full_link": "https://www.reddit.com/r/starcitizen/comments/9xqydl/gun_pippers_are_we_stuck_with_this_design/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xqydl", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "#00a6a5", "link_flair_css_class": "concern", "link_flair_richtext": [{"e": "text", "t": "CONCERN"}], "link_flair_template_id": "d5ebf22e-3538-11e5-829c-0e707a1ba6df", "link_flair_text": "CONCERN", "link_flair_text_color": "light", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 15, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starcitizen/comments/9xqydl/gun_pippers_are_we_stuck_with_this_design/", "pinned": false, "pwls": 6, "retrieved_on": 1542407533, "score": 1, "selftext": "I'm not trying to complain too much here, but the current design is just rather simplistic and unfitting for this game in my opinion. As a comparison look at modern aircraft pippers (They differ per country of course) vs the SC lag pippers.\n\n&amp;#x200B;\n\nReal:\n\n [https://wiki.hoggitworld.com/images/5/5c/HUD\\_GUNS\\_ANNOTATED.png](https://wiki.hoggitworld.com/images/5/5c/HUD_GUNS_ANNOTATED.png)\n\n&amp;#x200B;\n\nSC:\n\n[https://i.imgur.com/XeCo3W1.jpg](https://i.imgur.com/XeCo3W1.jpg)\n\n&amp;#x200B;\n\nSC's pippers are rather mundane and come off as rather unintuitive to the pilot. This isn't to say they don't perform their function, but they just don't seem to be as practical. I realize that for different configurations the pippers in SC do change a bit, but to me they can be so much better. There are aspects to it that are just far more practical, the larger pipper and the range bar particularly. \n\nIt isn't a perfect method, but the current pippers are just too simplistic. I can deal with them, but I'd rather see something different in the future. I may just be too used too DCS and expect applications such as the MFD's to be a bit more like modern aircraft (Though the current implementations are definitely a mess though). \n\nThoughts, differing opinions, alternate designs, hate?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starcitizen", "subreddit_id": "t5_2v94d", "subreddit_subscribers": 135619, "subreddit_type": "public", "thumbnail": "self", "title": "Gun Pippers, are we stuck with this design?", "url": "https://www.reddit.com/r/starcitizen/comments/9xqydl/gun_pippers_are_we_stuck_with_this_design/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Dazven", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_pozcl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542338259, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9xibzs/this_is_my_first_post_i_really_dont_know_what_to/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xibzs", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9xibzs/this_is_my_first_post_i_really_dont_know_what_to/", "pinned": false, "pwls": 0, "retrieved_on": 1542338260, "score": 1, "selftext": "I'm sorry for the length of this, but if anyone could read this I would appreciate. I've never told anybody this information before this.\n\n&amp;#x200B;\n\nFirst and foremost I want to say that I'm not really sure what to post, this is just fueled by the courage I get from drinking. Without doing so I just don't know if I would. I'm a male, 24, currently a college student on my last month.\n\n&amp;#x200B;\n\nThe first question is why am I depressed? I don't have a real reason to feel like this when I was younger, but it progressed over time and I never found a real reason why. Plenty of others have a reason, but me, I just forced it on myself only making it worse. \n\nI have a good family, one that helps me to do things others can't financially. But I still feel alone, I can't tell if people I know are friends or again just people I know. Even then they are just co-workers, and they act as friends, but I still feel like they aren't. \n\nI guess I can go back a little bit, during middle school and two years into high school I had about 4 friends, but I ended up transferring high schools two years in and lost two of them. The remaining were good friends of mine, but there were definite differences between us all. Both were abusers of drugs (Which I joined in on), they were great and kept me going in a way. I felt normal when I was with them, but when I wasn't I felt out of place. I always sat alone during lunch, pushed those away who tried to be my friend, essentially I just didn't want any more contact outside of the two friends I had.\n\n&amp;#x200B;\n\nWhen college came around it was a difficult time, one of the friends was a roommate and the other was a long distance friend. I stopped interacting with my friend who was a roommate due to how many people he hung out with and his behavior, and the other was out of reach. Once my friend who was my roommate dropped out (About three months into college) I fell out of contact with both and relied 100% on online contacts (Through Steam and gaming). I want to say it was after my roommate dropped out, but after about a month or so in I essentially became a NEET. \n\n&amp;#x200B;\n\nI was afraid to go out of my room, I could hardly talk to people, I stopped going to class, I spent money far beyond what I could afford, washed my clothes one time a semester, limited myself to one meal if not any to not have to ask my parents for money (Most of my food was from a vending machine), was put on academic probation for failing every class (For two semesters I failed every class because I stopped going to them and lied to my parents). I was pretty much at the height of committing suicide for a year, it was in my mind every day and was occurring often during those days. The only thing that kept me going was some folks online, particularly one of them which I am afraid to even talk to now (He is still on my friends list for Steam, but I feel like I am too weird now that even those online won't accept me).\n\n&amp;#x200B;\n\nEventually at the end of the first year of college I ended up having a grand mal seizure which was my first (I am diagnosed with partial complex seizure). I stopped taking my medicine, eating, and generally just stopped taking care of myself. A person from the room over called the paramedics for me which is the one reason I feel like I am still alive. After that I continued college at another school where I could live at home, this helped me a bit. I stayed there for about a year and a half and was able to at least pass the classes I was in as well as find some work around my city. \n\nEventually I transferred to another college which was much better, and I improved myself over those years to make myself a great student academically. It has made me feel better, I am not so bad as who I was six years ago, but I am still lacking and still feel as if I am not a normal human. Social situations are hard, I've practiced my facade for years and that gets me through them, but anything beyond small talk and the like and I just can't do it. I've become an alcoholic as well, drinking 100-200 beers a month, and I can feel the effects it has on my health, but I can't quit no matter what I tell myself or say that I am going to a support group. I feel like I'm going back to the state I was in six years ago (The NEET phase), it is gradually moving but I can feel myself going back to that stage and I just can't take any more time of that. It was the worst time in my life, I tried so hard not to feel as bad as that, but I could never shake it completely.\n\n&amp;#x200B;\n\nThis is too long and I can't put everything down on why I feel like I do, but I just only few happy in brief moments and use escapism through other mediums (Including those that some might feel inappropriate for a male) to not feel as I do. I want to change it, it has gone so long, but I just don't have anyone who can understand and everyone else who might be able to do something is at the very least 100 miles away (Therapist excluded, but I can't afford them and I can't ask my family without telling them \\[They wouldn't understand\\]).\n\n&amp;#x200B;\n\nThere may be one person (Also a co-worker) who has talked about himself and depression (Which I believe he still struggles with \\[He is on medication, but I feel his personality with actually being a really social person just makes me fear saying anything). Hell I have a neurologist appointment tomorrow and all I want to do is ask him to increase the dosage of Trazodone for me to the anti-depressant level (I am currently using it as a sleep aid which I just started a month ago), but I can't because my mother wants to go with me. \n\n&amp;#x200B;\n\nEssentially, I don't feel like an adult, I can't initiate social interaction unless I am forced into it (Work), I feel worthless, I feel like I don't and probably don't have friends (Definitely didn't for six years a little after I turned 18), I don't even want to type the rest. I just don't know what to do, I don't even know why I am typing all of this out, maybe I just needed to say it, but what is there for me? Why do I feel like this? I shouldn't, but this is it. I am an alcoholic 24 year old, about to graduate, no future, no friends, little to no social skill, boring, and sad \"adult\". \n\n&amp;#x200B;\n\nIf you read through all of this you are a good or bored person, if not I understand. This is just a pitiful post of someone who is doesn't know how to do anything.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 406197, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "This is my first post. I really don't know what to say", "url": "https://www.reddit.com/r/depression/comments/9xibzs/this_is_my_first_post_i_really_dont_know_what_to/", "whitelist_status": "no_ads", "wls": 0}]}