{"data": [{"author": "DepressedAWD", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2ftm6v6l", "can_mod_post": false, "contest_mode": false, "created_utc": 1539942108, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9piaek/im_sick_of_hearing_itll_get_better_it_hasnt_for/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9piaek", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 28, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9piaek/im_sick_of_hearing_itll_get_better_it_hasnt_for/", "pinned": false, "pwls": 6, "retrieved_on": 1539942109, "score": 1, "selftext": "Been On AntiDepressants, Mood Stabilizers, Anxiety Meds, Vitamins, Therapy for 10 years, Depression is only getting worse and I'm sick of hearing the same things.\n\nI've heard all the remedies as well. Get more sun, Get out more (easier said than done with severe social anxiety and agoraphobia), Exercise (done it), Diet (done it), Vitamins (done it). I've done it all. \n\nIt's gotten to the point where the doctors who prescribe my meds just straight up give up and I don't blame them because I do too.\n\nI've been depressed and suicidal for 21 years, since the age of around 5-6. I know that's hard to believe for some but I can remember clear as day even back then wanting to die every single day and thinking about it constantly and contemplating ways of doing it. I was always tired and even fought to sleep all day while kids in pre-school were off the walls. I've never had motivation, the will to live, nor the desire to live and I'm just tired.\n\nAt age 26 I've never had a job and I know that the longer I wait the more fucked I am but I literally cannot find strength to leave the house, I have no desire to have a job because I have no desire to live and if I do find the strength to leave the house I have such bad anxiety that it isn't for long. I live on disability and with my father (because it is impossible to live on disability alone) And plan to take my life once he passes because I will most likely be homeless by then and have only stayed alive for my folks anyways. I lost my mother this year to cancer, she was quite possibly one of the most supportive people in my life and my main reason for not ending it by now so my support system is severely limited. I'm honestly only alive to help take care of family members.\n\n&amp;#x200B;\n\nBesides the depression I was recently diagnosed with interstitial cystitis so when the severe depression and anxiety aren't keeping me inside, the pissing every 5 seconds does or the severe pain is. (which, what job will allow me to go to the bathroom every 5 seconds?)\n\nMy life is a waste and I know it's my fault, I'm in a hole and can't get out. Financially I'm fucked, Mentally I'm barely keeping it together with it getting worse each day and the only end I see is my own at my own hand.\n\nThe guilt of me not financially helping more kills me, the guilt of being a disappointment to my folks tears me up, The guilt of living on disability while my father still works makes me feel like such a piece of shit, the fear of being on the street (and being too much of a coward to end it) wrecks me.\n\nWaiting for the inevitability of my loved ones passing and me being alone and not knowing WHAT to do and not having ANYONE to turn to and also being too much of a coward also wrecks me.. Nothing is good. Every day is agony.\n\nI've been depressed for 21 years and I cannot tell you the amount of times I've heard \"It'll get better\". I know its a statement said just to \"make the person feel better\" but it doesnt even give false hope at this point, its a spit in the face. Better never comes. WORSE does. \n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397689, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm sick of hearing \"It'll get better\", It hasn't for 21 years. I don't want better, I just want it to stop.", "url": "https://www.reddit.com/r/depression/comments/9piaek/im_sick_of_hearing_itll_get_better_it_hasnt_for/", "whitelist_status": "all_ads", "wls": 6}]}