{"data": [{"author": "Doleful_Artist", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_24qxz1lw", "can_mod_post": false, "contest_mode": false, "created_utc": 1539201112, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9n2uuy/should_i_27_f_break_up_with_my_fiance_26_m_to/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9n2uuy", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9n2uuy/should_i_27_f_break_up_with_my_fiance_26_m_to/", "pinned": false, "pwls": 6, "retrieved_on": 1539201114, "score": 1, "selftext": "This is my first reddit account and first post, so I'm sorry for being really nervous.\n\n&amp;#x200B;\n\nI have been with my guy for going on 3 years, but I've known him longer. We've been engaged for 1 and are currently in an LDR.\n\n&amp;#x200B;\n\nSome background about me:\n\nI was diagnosed with depression and anxiety after a suicide attempt years before I met him and have been learning to accept and live with it ever since. Apparently they believe I've been this way since I was a child (I am a CSA survivor, and depression also runs in my family) but I was not aware, and in some serious denial, until after the suicide attempt. Earlier this year my cousin (more like a brother to me) died in our home in his sleep, and I spent 10 minutes giving CPR to his dead body before paramedics arrived. Needless to say, I now have PTSD from the event. I take a few daily meds to keep a handle on things and I've done therapy in the past, but right now I don't have health insurance so things can get kind of tight on that end. I have not been able to attend therapy for the PTSD.\n\n&amp;#x200B;\n\nNow my fiance has been with me throughout all of this. He tries his hardest to support me and keep me grounded, which I know is a very hard job. After my cousin died, he flew back to be with me the moment he could and really held me together. I can never thank him enough for being a stable presence in my life. Right now I'm out of work (I was laid off a little while ago) and we decided I'd finally buckle down and give it a go with my art. It's hard with the mental stuff and the medication often bogging things down, but I've been picking up in productivity a lot lately and he has been cheering me on every step of the way. I don't have too many monthly expenses and he is the one supporting me at the moment until I find myself a part-time job after his coming visit this month.\n\n&amp;#x200B;\n\nI'm here now because we've just had a fight, and he said something that really hurt me, but in the end I don't really know if I even have the right to be upset about it. He's been increasingly irritable with me over small things, not all of which are unjustified. Today we had what should have been the most minor of incidents, but it blew up. I admit that I wasn't as calm as I might sound now. He storms off (or away from the computer/phone) when he gets upset, and I told him that I would rather him tell me if he's storming off because of me or something else. When he leaves like that, I always think I did something to really piss him off and he will ignore me for hours, only leaving my mind to race. He told me something along the lines of \"Well maybe you should try not calling me and crying in my ear for an hour\", referring to when I am going through an episode or having a panic attack.\n\n&amp;#x200B;\n\nI've held things back in the past in order to not weigh him down with all of my mental issues and sadness, but when I did that he pleaded with me to open up to him and kept assuring me that he knew what he was getting into with this relationship. I know he wants to help me, but I'm feeling more and more resentment towards me the longer things go on... I feel like dead weight, worse than useless because I'm actively making his life harder. I really love him more than anything, but I hate feeling like he's gone from loving me to just putting up with me.\n\n&amp;#x200B;\n\nI can't talk to him because after the escapade we had he blocked me. I don't believe in telling friends/family about relationship spats (unless it comes to abuse) because later on when you make up, the friends/family still resent the person and that's not good for the relationship either. The few times I have done that it's backfired and made it harder for us to resolve things because he's upset that I went talking behind his back. So I feel like I have nowhere to turn right now. I feel physically ill bottling this all up, and I almost went and cut myself. But that would only make him even angrier once he found out...\n\n&amp;#x200B;\n\nI don't want to make him feel responsible for my mental ups and downs or what I do when I lose sight of myself. That's too much pressure for any person. I know he wants to be there for me and he says that he's perfectly prepared to deal with this type of relationship, but now I honestly don't think that he is. I think that I'm hurting him, and that he does care but would feel too guilty to leave me given everything that's going on with me. I don't want to be without him. I really don't know what I'd have to look forward to every day (and I know the generic answers to that, but I'm serious).\n\n&amp;#x200B;\n\nI know I'm not the perfect fiancee. I'm honestly downright awful a lot of the times with how depressing I am. I'm a lot of stress. But I'm also tired of feeling like such a burden to the people I love.\n\n&amp;#x200B;\n\n**TL;DR: My depression has become a huge burden on my partner and I don't know if I should let him go for his own good or keep trying to fix things.**\n\nI just want us to be happy, but I don't want to put him through any more trouble than I already have... Please tell me that breaking things off isn't the answer. Please. Show me some other way to make this right.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 394574, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Should I [27 F] break up with my fiance [26 M] to spare him from dealing with my depression?", "url": "https://www.reddit.com/r/depression/comments/9n2uuy/should_i_27_f_break_up_with_my_fiance_26_m_to/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Doleful_Artist", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_24qxz1lw", "can_mod_post": false, "contest_mode": false, "created_utc": 1539164871, "domain": "self.relationships", "full_link": "https://www.reddit.com/r/relationships/comments/9my16r/should_i_27_f_break_up_with_my_fiance_26_m_to/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9my16r", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "que", "link_flair_richtext": [], "link_flair_text": "[queue]", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationships/comments/9my16r/should_i_27_f_break_up_with_my_fiance_26_m_to/", "pinned": false, "pwls": 6, "retrieved_on": 1539164871, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "subreddit_subscribers": 1689988, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Should I [27 F] break up with my fiance [26 M] to spare him from dealing with my depression?", "url": "https://www.reddit.com/r/relationships/comments/9my16r/should_i_27_f_break_up_with_my_fiance_26_m_to/", "whitelist_status": "all_ads", "wls": 6}]}