{"data": [{"author": "Eddiukrkf", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13wowx", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1539796835, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9p0o71/stuck/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9p0o71", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9p0o71/stuck/", "pinned": false, "pwls": 6, "retrieved_on": 1539796836, "score": 1, "selftext": "Sorry for grammar and no punctuation sorry for horrible typing in general. If you even read all of it thanks. I don’t know what I expect to get out of this but feedback would be nice. \nI’m supposed to be a senior I messed up my life I feel like so much has happened and I’ve done so little to help myself I’m lost in time I don’t know the days some time it haunts me that I’m not in school I got out because I was cutting stressed developing major depression and social anxiety after I got out I got diagnosed with that It all came out of no where but I’m sure it was the school that triggered what had been building  up the high school had a lot of work in a short amount of time doable for awhile and later in the first year we had to be doing college classes I made it so far but started getting panic attacks everyday before I got to school for a week then my mother got me out to get me diagnosed and then she put me on meds which I went into a self destructive state where I abused lorazepam started to forget what I had done some days little after that I got into a lot and blacked out I only remembered some that happened that day it was considered an overdose I took 9 pills should’ve got admitted to a hospital didn’t until a month after didn’t get anything done there but had horrible sleep and didn’t eat really anything for a week another month then I cut myself had to be taken to the hospital and stitched up I’m not really sure if these were attempted suicides I don’t think about this all happened two years ago it feels so much longer but still fresh I wish it was so I could do things different year 10 came tried to got back hid in the administration room for a month only with going to class a few times I was still taking lorazepam but wasn’t abusing but wasn’t helping either I was a bit schizophrenic on it I was done I had a disgusting panic attack I just kept repeating ‘I don’t want to be here’ ‘I wanna die’ it was pathetic and embarrassed the administration saw and this other teacher I didn’t know I’ve gotten way better and it’s very pathetic that I’ve been doing nothing for two year I was doing computer work for the first year but that doesn’t count for shit I know I have get my ged and I know there is a package where I can also get my high school diploma I haven’t asked my mom about it I really think she got tried of me I wasn’t the best daughter then and I’m still not now  I’m pretty worthless my dad is isn’t help he was drinking during that time my mom said maybe I haven’t been my best this month too I’ve been cutting again and bruising myself drinking a bit too much i wish I had weed it helps a lot with euphoria and motivation and gives me self esteem and not a care in the world but I don’t want to depend on it because it does too much work this post makes me hurt I wish a was sad and often I sad but I’m not. I do things I like but can’t stick to it but I always go back to it. I’m barely getting taught to drive but my anxiety is fucking it up. But yeah most of the time I’m just watching live music on my phone and only time it get out is if I’m going to the store with my mom and going to concerts with my sister or going to see family which all of this doesn’t even happen often. I’m just taking up space I’d rather be doing productive things with/for the environment (not sure what I mean by this but working around nature I guess)or doing labor work like woodworking. I just want to be a productive person and be social. I’ve had friends like a few weeks ago come up to my house and started to talk to me I gave her my number but nothing I didn’t get hers I want way to nervous. I don’t know what I’m doing here. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397107, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Stuck", "url": "https://www.reddit.com/r/depression/comments/9p0o71/stuck/", "whitelist_status": "all_ads", "wls": 6}]}