{"data": [{"author": "except-i-dont", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2geak1tg", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540181846, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qac8v/honest_and_vulnerable_dont_know_what_to_do/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qac8v", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qac8v/honest_and_vulnerable_dont_know_what_to_do/", "pinned": false, "pwls": 6, "retrieved_on": 1540181847, "score": 1, "selftext": "As the title says, I’m just going to go through my thoughts and type as a try to sort through the chaos in my mind while being as brutally honest as possible. I apologize if this gets too wordy, doesn’t seem to have continuity or read well, or if it just may not belong here, I just don’t know what else to do. (On mobile, please bear with the poor formatting) this may be VERY long. Please don’t feel obligated to read, I just need to write to process. Thanks\n\nCreated a separate account as I feel it’s really the only way to be comfortable with going through the following while also being 100% honest with myself and as well as securing my identity. \n\n**Background**\n\nNot really sure where to begin. I’m in my early 20’s, I recently graduated from college, I have a loving family, and I have depression. I think there’s a common misconception that most of the world has regarding depression. I’ve been told that I shouldn’t be depressed because my current life isn’t as bad as someone else’s, that I’m not *REALLY* battling depression. \nIf this is your view and you must comment below, please try to refrain from being negative. That’s all I ask.  Also, I may have different world views from the vast majority of the people who will read this. If you have a different view, I completely respect that, but also please try to be positive. \n\nI was born and raised in a very religious (Christian) family. My father was/is a pastor and I’ve been raised and taught the Christian standards of living, and I still hold to them. That’s not what this post is about, but I feel like I should give as much information as necessary in order to describe my unique situation. \n\n**Depression**\nIt all started when I was in my pre-teenage years. I was a very happy, active, and outgoing kid. I loved being outside, loved sports, and loved being around people. I’ve always lived with a microscope on my life, as that’s what it’s like to live as a child of someone who leads people as a job and has to always be an example to others. (No hate to my parents, them being real with their lives in private and public is a main reason why I still hold several of the values I was raised with. I respect that even in hardships or in private, they are who they say they are). It’s difficult being a PK, you’re either rebellious or you’re one of those kids that feels like they have to act perfect all the time. I wouldn’t say it’s anything like being a child of the president, but there’s still pressure and still people watching intently, waiting for you to mess up. \n\nAnyway, in my pre-teenage years I loved playing baseball, my favorite sport. I was really good, played every position, and could hit the ball as far as I wanted to (slight exaggeration). One summer, I began to experience chest pains and had trouble breathing. I went to the doctor and was initially diagnosed with Asthma. I was given an inhaler and a medicine called prednisone, a steroid with many uses. \n\nAs time went on, I began having severe joint pains in my legs and arms. I also was having extended pains in my chest and trouble breathing. I went to the hospital and was diagnosed with a type of Arthritis and given more medication. It didn’t help. The pain would get so unbearable that I could not sleep most nights and the only brief pain relief i found was from sitting in a bath full of water at the hottest temperature I could stand. My arms began to lock overtime at the elbow in a bent position in addition to the excruciating pain. I obviously had to stop playing baseball. \n\nI was taken to the emergency room that Halloween when the pain had gotten to a point where it was too much. Spent a week admitted and they could not figure out what was wrong with me. Was on heavy doses of morphine during this time in order to relieve the pain. Turns out, the asthma diagnoses was wrong and the prednisone that was prescribed, actually masked the symptoms of what I actually had. When the doctors figured out what was wrong with me, my entire life changed. \n\nI couldn’t believe what I was being told, much of it didn’t even feel real. Cancer? Aggressive? Stage 4?\n\nAs a child, I honestly had no idea what the next two years would entail. \n\nIll skip ahead because there’s honestly a lot that I’m pretty sure my mind has blocked me from remembering at this point. Long story short (not really, I’m sorry), I went through two years of chemotherapy and several surgeries. My prognosis wasn’t great initially and some would even say it’s a miracle I’m even alive today (if you believe in miracles, that is), but I am alive. For now at least. \n\nDuring this time, I was in a pinnacle part of my childhood. I remember having so many friends before cancer. so many visitors initially—so many people in the community doing whatever they could to reach out and help my family and me. It was really encouraging at first. As time went on, i received less visitors, less people reaching out, less cards, less messages. I was still battling cancer, arguably in a worse state than initially, but it felt like I was forgotten (I know I wasn’t, but that’s how it felt). I had to be homeschooled and kept away from public places due to my immune system being so low. I gained a lot of weight due to the strong drugs I was taking and I also lost my hair—twice— in the process. I saw my friends continue on with their lives through the lens of technology, growing more tolerant of life without me in it. \n\nCancer sucks at any point in life and is arguably one of the hardest things to overcome... but for me, it was almost as hard acclimating to the “new norm”of life during and after fighting cancer. I went back to school my freshman year and everything was... *different*. \n\nI had a visibly different appearance, felt cognitively inadequate, and every interaction with people felt engulfed by the elephant in the room. Nobody was my friend anymore, people only interacted with me because they felt sorry for me. My hand-eye coordination had suffered and I was never able to return to sports or be as athletic as I could/should have been. The chemo had delayed puberty for me, so add that to the list. High school was an absolute nightmare. \n\nI pressed through and eventually graduated, but my high school experience was not good to say the least. \nI kept telling myself that college would be better, everyone would be starting fresh, it would be easy to make friends, etc. \nBy this point, I’m not the same happy kid that I once was. I’m so insecure about virtually every aspect of myself that doing literally anything would would make me uncomfortable. Still, I tried, with hope for a better future. \n\nFirst semester of college sucked, I was placed in a small dorm room with two other guys and didn’t really get along with either of them. I wanted so badly to make friends, but every time I tried, I was always somehow an odd one out. First week in, everyone already had friend groups, again, of which I was not part of any. Nights and days began to blur as I wouldn’t move from my bed. I had no reason to exist in reality, nothing to look forward to. Dreams at night were the only thing I could even enjoy. I would lie to my parents who would periodically call to see how things were going. I got to some pretty dark places and became obsessed with the idea of death, but I was not bold enough to do anything. I would constantly just wish that cancer would have killed me the first time around. If life doesn’t get better after, what is the point? \n\nOne day I went out set with the plan to kill myself, but my parents somehow got in touch with my RA because nobody could get ahold of me. He ended up finding me before I did anything and I broke down. My parents came up immediately and I told them what I was dealing with — what I had BEEN dealing with. It was a process, but I got the help I needed and saw therapists / psychiatrists /counselors — the whole 9 yards. \nI was somehow able to make it through my first semester with grades that were not totally unsalvageable and eventually made the classes up. I wasn’t planning on going back to school, but felt that after I got help, things actually could get better and that I should tough it out. I mean, I’ve beat cancer, how hard could this be?\n\nThe rest of college was still a struggle and constant battle with depression. I was also diagnosed with ADHD and anxiety, both of which (included alongside depression) are long term side effects or have chances of increased severity after chemotherapy. But I was able to make it through. \n\nSenior year came around and the job/career search was the priority. I had been told throughout college that I still had time to decide what I wanted to do with my life and not to worry. Well, there I was in my final semester with no idea what I was doing or what I wanted to do. I had no passion for anything in life. I have no talents or abilities that set me apart from others. I’m essentially average or below average in just about every category. I was just going through the motions of life, but had nothing to truly live for. \n\nI applied and interviewed for several places and only got a job offer from one of them. I’m not going to go into too much detail here, but essentially it was a job that requires a lot of prerequisite testing for multiple licenses in order to legally do the job. I was ecstatic about the offer and honestly thrilled. I felt as if life was finally coming around my direction and actually going to be fulfilling. \n\nProblem with this specific job was, I was unable to actually start until i passed the licensing exams. Turns out, the company doesn’t pay for the tests up front, but instead reimburses you when you make it through the testing process. I ended up moving back home after graduating for what I thought was going to be a brief time until I got through the exams. The following summer sucked. I did nothing but eat, breathe, sleep, and study. I was so motivated to pass to start working. Around this time, my grandmother ended up in the hospital. It became harder to focus on studying when there were more severe things at hand. I ended up taking and passing the first exam. I was in constant communication with the company about what was going on and they understood. I had to take some extra time off from preparing for the next exam so I could be with my grandparents. My grandmother remained in the hospital for several weeks and I would spend most of the time in the waiting room studying on my computer for the next exam. As her health continued to rollercoaster between good and bad, every bit of studying I was doing was absolutely useless as far as memory retention goes. It was as if my eyes were just moving down the page, not actually reading or picking up any information (likely what you’re doing if you’re made it this far). \nThen it happened, she was here one moment and gone the next. I couldn’t process it. Death. \nWe went through the processes. The funeral, the family gathering, the mourning. It was very difficult to try to continue going through the process of life after her death. Unfortunately, I had to continue studying, even in mourning. \n\n20 days later, my grandfather, living alone ever since my grandmother’s death, fell and hit his head on the kitchen table and died later that day in the hospital. Here I was, 3 weeks later, going through the same process of death. There was a huge sense of deja vu in the funeral home that hosted both funerals. Still in mourning over the death of my grandmother, I was forced to restart the process. I loved my grandparents and was very close to them. They were some of the few people who actually were always there for me and now they’re gone. \nMy next test was the following week. \nI failed it. I spoke with the guy from the company, and he understood what was going on. He graciously offered me another chance to take the exam, something he specified that they don’t usually allow. He also made it very clear that this was a “last shot” opportunity. If I did not pass, I would have to seek employment elsewhere. Understandable. \n\nI went back to the grind of studying. Haunted by the constant turmoil that depression provides, the study prep weeks grew harder. Still trying to process and deal with losing my grandparents, as well as not having any friends, just added to the severity. Anyway, test day comes again and— you guessed it— failed again. I improved from my last attempt, but not enough to pass. Cognitively, I have been negatively impacted by the chemotherapy from battling cancer and have a slower processing speed on top of difficulties focusing. This brings me to where I am now. \n\nBack to square one. I don’t know what to do with my life. I feel like it’s harder to admit I’m depressed to my parents a second time, since they believed that the motions from the first round “cured”me. I have to fake my happiness, this time with no hopes, dreams, passions, or anything to look forward to in life. \n\nHope. That has been the sole driver in my life. As I write this from my bed, I’m not so sure it exists anymore. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398184, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "honest and vulnerable, don’t know what to do.", "url": "https://www.reddit.com/r/depression/comments/9qac8v/honest_and_vulnerable_dont_know_what_to_do/", "whitelist_status": "all_ads", "wls": 6}]}