{"data": [{"author": "HanaSora94", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2hs79twb", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542296600, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9xc9ug/i_finally_sought_for_help/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xc9ug", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9xc9ug/i_finally_sought_for_help/", "pinned": false, "pwls": 0, "retrieved_on": 1542296601, "score": 1, "selftext": "For three years, I have been beating myself. I thought oh Im just being overly dramatic, or overly emotional. Things start to be bad when i knew how to hurt myself. Every single failure I faced, i punish myself for being so useless, so stupid etc. \n\nI cheated on my boyfriend of 3 years, at the time (i know what i did was wrong but i decided to stay with him) and just until early this year he decided to trust me again. But in the period of 3 years(now 6 years in), me and him was living in a very toxic relationship. Every time i go out, i need to take a pic even when i was sick. Its at a point if i did kill myself in front of him, he wont even wince at me. He would ignore me for days (we were in a long distance relationship) treat me so badly that I felt like trash, actually worse than trash. I wanted to die so badly but Id be bothering so many people to bury me.\n\nBy some miracle, we somehow worked it out and changed for the better. He now treats me like a princess and now that i am working, i chose to work near him so i can see him on weekends. But I still get panic attacks whenever I go into crowds. I still punish myself every mistake i make. I still have suicidal thoughts every night and every morning has been hell to wake up.\n\nOne night i decided to swallow like a half dozen of paracetamol pills and if i survive, I'll go to therapy (stupid i know but i wasnt thinking anymore). And somehow I woke up the morning after and quickly went to the ER.\n\nFast forward today, i got diagnosed with Major Depressive Disorder with Anxiety. After so long, i finally feel like life is giving me a chance. Wish me luck with the side effects of the meds.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 406034, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I finally sought for help", "url": "https://www.reddit.com/r/depression/comments/9xc9ug/i_finally_sought_for_help/", "whitelist_status": "no_ads", "wls": 0}]}