{"data": [{"author": "Holographicknight", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2gtxpbpl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541038637, "domain": "self.JUSTNOFAMILY", "full_link": "https://www.reddit.com/r/JUSTNOFAMILY/comments/9t5hy1/the_time_my_dad_yelled_at_me_for_liking_videogames/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9t5hy1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/JUSTNOFAMILY/comments/9t5hy1/the_time_my_dad_yelled_at_me_for_liking_videogames/", "pinned": false, "pwls": 0, "retrieved_on": 1541038639, "score": 1, "selftext": "For a bit of context in my family dynamic, well we are all hispanic, my dad has always been emotionally abusive, my mother somewhat of an enabler and my older sisters (I'm the youngest one of the 3) have always been on the two sides, they have suffered my father's abuse but have been my abusers as well. That said onto the story. I was a 16 year old girl who absolutely loved videogames (still do) they were my escape and ever since I was a child I always had an interest in them, see my father didn't liked that, so I never grew up with any type of videogame console, and I never complained for that, I would watch lets plays online or play free online games. I would openly talk about how much fun they were to my sister's boyfriends and have discussions from time to time and I guess my dad listened in into one of our conversations. So one night during dinner time he decided to confront me, he started yelling at me to stop liking and playing \"that trash\" I shouldn't be able to hold these conversations with men and I should stop liking violence that was meant for men to play. I was not allowed to answer back, I was just allowed to say \"yes daddy you are right I have to stop\". While I wanted to leave the table my sisters and mom held me hostage telling me \"I must listen to what my dad has to say\" while he kept berating me for the whole meal, I lost my appettite but I was still forced to eat cause \"they had bought all these food don't be ungrateful\". after that I just zoned out, I don't even remember how I went back to my room but everyone acted as if nothing happened.I do remember throwing up and being yelled at that \"You can't use the excuse of being sick to skip school\" so yeah fun times", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "JUSTNOFAMILY", "subreddit_id": "t5_3a182", "subreddit_subscribers": 55340, "subreddit_type": "public", "thumbnail": "self", "title": "The time my dad yelled at me for liking videogames", "url": "https://www.reddit.com/r/JUSTNOFAMILY/comments/9t5hy1/the_time_my_dad_yelled_at_me_for_liking_videogames/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Holographicknight", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2gtxpbpl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540349443, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qvw1z/being_pressured_to_live_normally/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qvw1z", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qvw1z/being_pressured_to_live_normally/", "pinned": false, "pwls": 6, "retrieved_on": 1540349444, "score": 1, "selftext": "I come from a hispanic family, my father was/is emotionally abusive as well as my older sisters (to a lesser degree), I've always been the black sheep of them, I was always more interested in art and storytelling but this was always seen as a waste of time, my sisters would go out of their way to control certain aspects of my life like the way I eat my food or the way I would act, my dad would scream at me every chance he would see me, most of the time it was vitriol towards me disguised as \"life advice\" (yeah telling your teenage daugther she's a failure who has no virtues and only faults is great life-changing advice). My dad was and still is very controlling too, I was not allowed to like certain things cause he didn't approved of them. One time he screamed at me during dinner time to stop liking something like videogames that was meant for boys, I wanted to leave the table but I was forced to sit down and hear all of his yelling cause \"daddy knows best\", I puked that night. He would also demand for lunch and to always be served, if something was missing he would berate me for it despite me coming home from school to prepare his food.\n\nWhen I graduated I started to slowly stand up to my family, it was tough, sometimes my sisters would hit me for disobeying or my dad would yell I would regret treating him this way, but I slowly started to gain more confidence, but when I entered university it came all crashing down though, I was going to a rich kids one (with financial aid), I was a shy girl and they were all very loud and extroverted (a lot of them would behave like high school bullies), I was intimidated but I still wanted to get along with most of them at least, I got a long with some of the people but I was isolated most of the time, I still didn't wanted this to get to me so I strived to do well in school and I did for 4 years (university lasts for 5 years). until last year in October when I had a breakdown and mostly stopped going to classes all together, I spent my days laying down in bed sobbing, I stopped showering and had lost all motivation I had for life, At first I hid this from my family, (A stupid move I know) they were not the type of people who would worry about what was wrong with you but would instantly look to blame you and make you feel bad for it. Surprisingly when my sister found out she first yelled at me, then considered taking me to a psychiatrist to get diagnosed (she also said I would go to a psych ward and live there) My parents didn't approve of me going to a psychiatrist and even suggested I had to leave in a hidden vehicle. It turns out I was diagnosed with depression and anxiety, my dad told me I  should just go to mass and motivate myself, that I was not making an effort and I was being ridiculous, my mom didn't say much but my sisters in their own way tried to help me. \n\nTo be honest right now I'm not much better, my breakdown caused me to fall a year behind and I still can't bring myself to go to class, I get panic attacks just thinking of entering a classroom as an example. My family forces me to go to school though, they ask for updates and pictures and questions to make sure I am there, I can't talk to my sisters about the way I feel or I will instantly be accused and yelled at for not making an effort and \"the medicine should work\" my dad keeps bringing up how I'm ruinning him for getting behind a year and now I'm constantly forced to \"be happy\" and \"enjoy myself\"I've had to start pretending I am. Suicidal thoughts have been constantly plaguing my mind and just thinking about the release from all of this nonsense someday is what cheers me up a bit. \n\nI'm sorry for the lenght of this post but if you read this all I'm very thankful for taking your time of the day to read this.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398605, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Being pressured to live \"normally\"", "url": "https://www.reddit.com/r/depression/comments/9qvw1z/being_pressured_to_live_normally/", "whitelist_status": "all_ads", "wls": 6}]}