{"data": [{"author": "irrationallyannoyed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dxqm7gp", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540497866, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9rdrsb/what_to_do_when_you_are_nonfunctional_at_work/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9rdrsb", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9rdrsb/what_to_do_when_you_are_nonfunctional_at_work/", "pinned": false, "pwls": 6, "retrieved_on": 1540497867, "score": 1, "selftext": "For some background, I am diagnosed with Bipolar 1, and I have been struggling with a really nasty episode since July. It was diagnosed as severe depression but I've questioned whether it might be a mixed episode. I've had to take about a month of leave altogether since July, including filling out the FMLA paperwork and everything. Part of that leave was to attend a partial psych day hospital program. I am on meds, established with a psychiatrist, and was in regular therapy for 2+ years but recently had to find a new therapist, who I'm seeing for the first time tomorrow. \n\nI have a mentally demanding job at a law firm. Since the start of this episode, depression has rendered me totally ill-equipped to meet its demands. Things are falling through the cracks left and right, and the work I am able to get done is of poor quality. I used to be a star employee. If it were up to me, I think I'd quit. I am actively tanking cases right now.\n\nThe attorneys I work for know what's going on and they are supportive. Irrationally so. No one's ready to fire me, but I almost wish they would. \n\nMy husband has taken the position that I just have to keep doing my best, I don't really have a choice, because it's not like I can choose to not work. I am the majority breadwinner. He is supportive of me but completely resistant to the idea of me being unemployed, which I understand. We are not independently wealthy. \n\nI don't know how much longer I can go on like this. What do I do? Tell my employer \"hey I am incapable of performing the basic functions of my job, but I'm just gonna hang in there until you fire me\"?\n\nAdvice? I feel like I'm drowning. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 399101, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "What to do when you are nonfunctional at work?", "url": "https://www.reddit.com/r/depression/comments/9rdrsb/what_to_do_when_you_are_nonfunctional_at_work/", "whitelist_status": "all_ads", "wls": 6}, {"author": "irrationallyannoyed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dxqm7gp", "can_mod_post": false, "contest_mode": false, "created_utc": 1536708563, "domain": "self.PubTips", "full_link": "https://www.reddit.com/r/PubTips/comments/9f2hrc/pubq_query_critique_fleetfoot_adult_romantic/", "id": "9f2hrc", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "pubq", "link_flair_richtext": [], "link_flair_text": "PubQ", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 22, "num_crossposts": 0, "over_18": false, "permalink": "/r/PubTips/comments/9f2hrc/pubq_query_critique_fleetfoot_adult_romantic/", "pinned": false, "retrieved_on": 1536708564, "score": 1, "selftext": "Hi all!\n\nI just started querying and have received three rejections already. I know that's expected, but before I stumble forth to face plant into a dozen more, I thought I ought to get some feedback on the query letter, in case it does something glaringly wrong. \n\nAnd yes, the word count is...not ideal. A stumbling block, for sure. But I'm not so arrogant as to believe that's the only reason any agent would ever reject my perfect baby.\n\nThanks for your help!\n\n***\nDear Agent,\n\r\nMost would call the wizard’s Mark a blessing. To Kin Rowantree, it’s a curse.\n\r\nKin is a messenger at the Et Jebva research site—a good one. Yet it isn’t her speed or her sense of direction that distinguish her in the eyes of others. It’s the Mark. It brands her an anomaly at best and an outcast at worst. \n\r\nBecause Kin cannot use magic, and no one knows why. \n\r\nThen she meets a wizard who claims he can find the answer. It would be a tempting offer, if he weren’t rumored to be insane. \n\r\nAgainst her better judgment, Kin enters an apprenticeship with infamous madman Allard Hartley, the only wizard willing to consider her merits. Most wizards-in-training won’t find poisonings or drunken fistfights covered in their curriculums. Nor are they usually volunteered to run secret messages, or to investigate treason. Only very rarely are they held responsible for preventing the resurgence of a centuries-old military conflict. A conflict that could destroy the research site—for a start. \n\r\nBut Kin will do what Hartley asks, if it might solve her life’s central question: Is she a wizard or a mistake?\n\r\nTrouble is, she might not like the answer.\n\r\nFLEETFOOT is an adult romantic fantasy novel of 182,000 words. It is based in part on my experiences with Bipolar I disorder. \n\r\nThank you for your time and consideration.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "PubTips", "subreddit_id": "t5_3h5w8", "subreddit_subscribers": 6808, "subreddit_type": "public", "thumbnail": "self", "title": "[PubQ] Query Critique - Fleetfoot (Adult Romantic Fantasy)", "url": "https://www.reddit.com/r/PubTips/comments/9f2hrc/pubq_query_critique_fleetfoot_adult_romantic/"}, {"author": "irrationallyannoyed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533503077, "domain": "self.writing", "full_link": "https://www.reddit.com/r/writing/comments/94v75q/i_wrote_a_good_book/", "id": "94v75q", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/writing/comments/94v75q/i_wrote_a_good_book/", "pinned": false, "pwls": 6, "retrieved_on": 1533503077, "rte_mode": "markdown", "score": 1, "selftext": "This realization has dawned on me over the last month. The manuscript still needs one or two rounds of copy editing, but the story is there. And it's good. \n\nI don't know what to do with this information. It's like I'm sitting on some earth-shattering secret and I don't have anyone to tell. Everyone tells unpublished authors not to get their hopes up about a debut novel, but it's too late. My hopes are palling around with the ISS.\n\nI never meant for this to happen. I just wanted to entertain myself. Oops. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "writing", "subreddit_id": "t5_2qh2n", "subreddit_subscribers": 511061, "subreddit_type": "public", "thumbnail": "self", "title": "I wrote a good book", "url": "https://www.reddit.com/r/writing/comments/94v75q/i_wrote_a_good_book/", "whitelist_status": "all_ads", "wls": 6}, {"author": "irrationallyannoyed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_dxqm7gp", "can_mod_post": false, "contest_mode": false, "created_utc": 1531450257, "domain": "self.writing", "full_link": "https://www.reddit.com/r/writing/comments/8yg9o5/how_do_i_know_if_i_what_i_wrote_is_romantic/", "id": "8yg9o5", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/writing/comments/8yg9o5/how_do_i_know_if_i_what_i_wrote_is_romantic/", "pinned": false, "pwls": 6, "retrieved_on": 1531450258, "rte_mode": "markdown", "score": 1, "selftext": "Hi Reddit,\n\nI've been writing as a hobby for years, but for the first time, I'm trying to get a novel published. The book is written, it's too long, I've hired a professional copy editor (because my ego is so fragile I'd rather pay a stranger thousands of $$ to tell me I suck than have a friend do it for free), and I am at the stage of perfecting my query letter and synopsis.\n\nI'm admittedly weak in the area of identifying genre and markets. I still haven't figured out if I'm clear of YA territory, but that's a battle for another day. \n\nRight now, as I'm tightening up my synopsis, I'm disturbed by how hard it is to highlight the romantic elements of my story. All this time I thought I was writing SOLID romantic fantasy, like seriously 80% of this book is flirty banter and sex scenes. But when describing the plot succinctly, I'm inclined to spend the space on the fantasy elements of the plot, and I don't know how to incorporate the romance without shoehorning it in. Like, \"Also at this point, unrelated to what I was saying before, the characters bang now.\"\n\nThis concerns me. It makes me wonder if my book is not as firmly in the \"romance\" genre as I thought. I foresee future querying problems, and marketing ones, if I ever get that far.\n\nOther subgenre romance writers, is this an issue you've encountered? Is it a normal part of the query/synopsis nightmare or is it a sign my book is in trouble? How would you handle when querying agents, in terms of assigning a genre/subgenre?\n\nThanks for helping an aspiring author avoid the 14th query-related nervous breakdown this week. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "writing", "subreddit_id": "t5_2qh2n", "subreddit_subscribers": 488343, "subreddit_type": "public", "thumbnail": "self", "title": "How do I know if I what I wrote is \"romantic fantasy\" or \"fantasy with a really really ridiculously heavy romance subplot?\"", "url": "https://www.reddit.com/r/writing/comments/8yg9o5/how_do_i_know_if_i_what_i_wrote_is_romantic/", "whitelist_status": "all_ads", "wls": 6}, {"author": "irrationallyannoyed", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1505508241, "domain": "self.Advice", "full_link": "https://www.reddit.com/r/Advice/comments/70cmjm/my_best_friend_27f_with_anxiety_has_become_a/", "id": "70cmjm", "is_crosspostable": true, "is_self": true, "is_video": false, "locked": false, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Advice/comments/70cmjm/my_best_friend_27f_with_anxiety_has_become_a/", "retrieved_on": 1505604085, "score": 2, "selftext": "I am 50% sure i am in the wrong here, so please don't hesitate to tell me I'm being a dick. I just want to do the right thing. [Very long post ahead]\n\nUpfront, I should say my friend Donna [27F] has moderate-to-severe anxiety issues that have been diagnosed by a doctor. She takes medication on and off. Keep that in mind as I lay everything out. \n\nMy wonderful, funny, clever, kind best friend has a bit of an \"image\" problem...in the sense that a lot of people who know her think she is a raging bitch and miserable human being. I have known her for a very long time, over 20 years. She was always a bit of a complainer, but she was very funny and fun to be around and people generally really liked her. She also has always had the tendency to be a little blunt when she doesn't like someone, but hey, that's not necessarily a bad trait if you exercise some discretion about it.\n\nAs she gets older, though, she's becoming a warped version of her former self. She complains about literally everything that happens to her. She also tends to tell really rambling stories and to repeat them, so if you spend a lot of time around her you might here the same 15 minute story (that should have been a one minute story if a story at all) about the barista who she believes was sassy to her, 5-7 different times. She seems to have a victim complex and takes innocuous statements made by others as personal attacks against her. She also complains about \"non-problems\" as if they are real issues worthy of sympathy, like the time she told me how her day at work sucked because, among other things, she was hungry and had to pee all day but she had to cover the front desk for the lunch hour. When I told her those problems probably could have been avoided by telling her (very sweet) boss, \"Hey, I didn't get lunch and I have to pee, can someone cover the front desk for a minute?\" she did not appreciate my advice. She is generally a complainer about her aches and pains and overall poor health, but I think that's not such a big deal by itself - goodness knows we all have our annoying personality flaws. \n\nOne tough thing about the situation with her is that she has a small in-person community and a gigantic online following of people who are willing to smother her in sympathy and attention, no matter how small the complaint. Even her family enables her, like the time we were hanging out at her house and I tried to give her some practical advice about a non-problem and her sister [25F] tactfully said, \"You know, I read the other day that when someone is telling you their problems, you should ask them whether they want solutions, or whether they just want to vent.\" And I totally get it that sometimes people want to vent, but I'm sorry, if the problem you're venting about is that you had to pee all day because you didn't go to the bathroom, I think a reality check is appropriate in that situation!\n\nShe is also a very mean person. She apparently has a wheel in her head that she spins to randomly determine which people she likes and which she hates, because she seems to hate the nicest people for no reason (and is friends with some really awful ones, but all of them are willing to be an appropriately sympathetic audience to her). This has caused interpersonal problems in our friend groups multiple times. We had a close group of friends that kind of fell apart partly because of her open, constant animosity towards one of the other members. She would call him names and openly express that he was her least favorite part of get-togethers. She's a very funny, sarcastic person, so if she said it in different tone they might seem like joking insults, but she delivered them so flatly that she was obviously serious. She was so openly hostile that this guy eventually could no longer politely pretend not to realize she was bullying him to his face. Now he no longer hangs out with us. We've been inviting this other guy to do more and more stuff with us, and she's doing essentially the same thing to him, calling him an idiot constantly and making it clear she would rather not have him there. This guy is great - a little goofy sometimes, but a very cool, genuine person - and she treats him like garbage. I wouldn't blame him at all for cutting us off. I personally think she has somehow convinced herself that these people she hates are actually awful and she is therefore justified in harassing them - after all, most people would say there is a moral difference between saying hateful things to a horrible person vs. an innocent person who's never done anything to you.\n\nI always thought Donna must be able to turn it off at work because she's never been fired. However, she recently got a job working with our mutual friend Tim [29M] who I am very close with. He reports that she is just as bad at work, which has caused some negative feedback about the way she treats clients and her co-workers. The thing is, nobody at this workplace ever gets fired for personality reasons - they have continued to employee some really immature, unprofessional people because the boss is too sweet and wants to take care of everyone. This just seems to lead her to feel she can complain and be mean with no real life consequences, and that her actions are justified. Tim and I don't usually gossip behind our friends' backs but this issue with her has become so glaringly obvious that we are starting to feel worried.\n\nNow (finally) to the crux of the issue - I'm not sure if I should say anything to her, or even if I'm being fair to her. I have posted on Reddit before on an anxiety sub (on a different alt) about her meanness issue, because I sometimes think it's related to her anxiety and I wondered if there was something I could say to her to let her know it wasn't OK to talk to our friends like that without making her anxiety worse. Well I basically got torn apart by that subreddit for being ignorant and unsympathetic, not understanding anxiety issues, and making people in the sub more self-conscious that their friends secretly hate them...so yeah, I felt like a real dick. But recently more and more friends/acquaintances have come to me as her best friend and said she is out of control and someone needs to talk to her. Even my therapist said it is OK to set boundaries for behavior with her and enforce those.\n\nBut I can't help wondering if I AM being an unsympathetic, ignorant jerk...I know people can be very ignorant about mental health issues and what is a symptom of a mental illness vs. someone being \"lazy,\" \"whiny,\" etc. I don't want to be that person. And I don't know if I'm being too harsh in my assessment of her and her situation. I feel like she needs an intervention because she can't possibly be living her life to the fullest...but then, she does have a support group that apparently sees nothing wrong with her behavior or her outlook on life. I keep wondering if this is an irrational thing where I'm not being empathetic to her situation, and really it has nothing to do with me anyway, so I should just learn to support her.\n\nI want to do the right thing for her, our friend group, and my own mental health...what would you do?\n\ntl;dr: My best friend of 20+ years has become mean, whiny, and generally unpleasant, but she also has anxiety. I want to know whether she needs \"tough love\" to realize her behavior isn't OK, or if I'm being unfair to her and if the picture I'm presenting is of a struggling mentally ill person who I'm judging unfairly and ignorantly. ", "spoiler": false, "stickied": false, "subreddit": "Advice", "subreddit_id": "t5_2qjdm", "thumbnail": "self", "title": "My best friend [27F] with anxiety has become a miserable person and I don't know what/if I [29F] should do anything about it", "url": "https://www.reddit.com/r/Advice/comments/70cmjm/my_best_friend_27f_with_anxiety_has_become_a/", "whitelist_status": "all_ads"}]}