{"data": [{"author": "Justadeadgayshark", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_24myd4wl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541385514, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9u9qmf/i_just_need_a_little_help_and_to_be_finally_be/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9u9qmf", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9u9qmf/i_just_need_a_little_help_and_to_be_finally_be/", "pinned": false, "pwls": 0, "retrieved_on": 1541385515, "score": 1, "selftext": "im using a throw away idk why but I am, also I’m mobile so sorry if the format is fucked up,\nanyways, I just want to get this off my chest, I bottle everything up and I have been for about 4 years now, I don’t wanna go into detail w everything, it makes me feel so stupid for having the problems I have, I just want things to be brief and not go into more than I have to,\nsome background is that I’m 16, I’ve had my depression since I was around 12 and I got diagnosed when I was 13, my parents hate each other and completely disagree w each other, joint custody, have always been in the middle etc etc, but I wanna move in w my dad, which has been about a year in the making and has taken a huge toll on my depression\nanyways, both of them disagree completely regarding to my depression, my dad believes it’s just me being sad and it’s all temporary (both sides of my moms/dads family are diagnosed w depression or other shit) I’ve even told him I’ve been self harming for a couple of years, I couldn’t hold back anymore and he just brushed it off and blamed it all on my mom\nthe question whether to start pills or not is just fuckin shit show, mom has guilt tripped me into taking meds many times and I’ve tried it, not long enough for it to start taking affect (Zoloft and birth control for PMDD), anyways my dad doesn’t want me on meds and is stopping everything from me taking them\nso I’m in the middle, my depression has been getting worse every single day and PMDD isn’t helping at all, I’m so exhausted I hate being this depressed and sad and want it to be over, but idk meds have their pros and cons and I’m just so worried about everything, I don’t wanna chose sides, my mom isn’t willing to help me find other options, I’ve done therapy for years and it doesn’t help at all, and so she’s starting to blaming me and it’s my fault for not choosing meds, man I just wanna rest please I hate being sad so much it’s taking up every ounce of my energy, I don’t have anymore left, the only thing keeping me here is my gf and best friends, but it’s just so hard to even stick around \nI have a lot more problems and issues but I don’t like to talk about them \nplease I’m just so tired ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 402480, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "i just need a little help and to be finally be able to get this off my chest", "url": "https://www.reddit.com/r/depression/comments/9u9qmf/i_just_need_a_little_help_and_to_be_finally_be/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Justadeadgayshark", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_24myd4wl", "can_mod_post": false, "contest_mode": false, "created_utc": 1535985826, "domain": "self.sex", "full_link": "https://www.reddit.com/r/sex/comments/9cm0h4/i_want_to_actually_be_able_to_get_off_when_i/", "id": "9cm0h4", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/sex/comments/9cm0h4/i_want_to_actually_be_able_to_get_off_when_i/", "pinned": false, "pwls": 1, "retrieved_on": 1535985827, "score": 1, "selftext": "hi! uhh this is my first time here really/I’m using a throwaway, I hope this is the right place to post this! So just some background, I’ve always masturbated to porn and it’s hard for me to actually get off if I’m not using it, without it, it takes me about 30 mins to an hour which is way too long for me. \n\nI’m in my first LDR and I’m seeing her sometime in November, but that could change. She’s never masturbated or have had sex before, we’ve done some things over the phone and I was able to get her off. I top about 99.999% of the time, but I want her to try and go down on me too, but I want to actually “finish?” for her, I’ve never been able to actually cum during sex even if I’m the one touching myself? I have no problem getting horny or wet or anything, maybe it’s the fact that I’m so used to porn? Does anyone have any experience or advice? Thank you! Again sorry if this is the wrong place to post this/has been posted before, I just wanna be able to actually fix this problem before I see her! ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sex", "subreddit_id": "t5_2qh3p", "subreddit_subscribers": 994287, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I want to actually be able to get off when I finally see my LDR Gf", "url": "https://www.reddit.com/r/sex/comments/9cm0h4/i_want_to_actually_be_able_to_get_off_when_i/", "whitelist_status": "house_only", "wls": 1}]}