{"data": [{"author": "kuromitan", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2m936o3j", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542487073, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9xzroc/i_lost_my_childhood_to_mental_illness/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xzroc", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9xzroc/i_lost_my_childhood_to_mental_illness/", "pinned": false, "pwls": 0, "retrieved_on": 1542487123, "score": 2, "selftext": "I needed to vent so here goes nothing.\n\nA bit of backstory. At 13 I began self harming and had my first suicide attempt. I kept my self harm and suicidal thoughts hidden well over a year before a friend  noticed my cuts and reported it to our school guidance counselor. She scheduled me an appointment with a therapist and at 14 I was diagnosed with depression and anxiety. I got sent to a children's CSU because I was suicidal. Looking back, I can see the earlier signs of my depression manifesting itself but that year was it truly took away any happiness I had. I hated myself so much, I rarely looked in a mirror more than 5 seconds before I would cry. I was bullied, my mom and I were fighting constantly, my grades starting slipping. I felt like I was nothing more than a waste of space. How I was treated did not help me at all. I didn't click with my therapist and hated going to my appointments and continued cutting after being released from the children's CSU. A few months later I finally told my mom about my sexual abuse. I remember her saying \"No wonder you hated me, I wasn't there to protect you.\" That hit me like a fucking truck. The memories of it I had been repressing were too much. I oded on my mom's medicine and later that night she found out and immediately took me to the ER. That whole night was probably the worst I had ever felt about having a mental illness. A nurse said, \"How could you have depression?\" A man from the children's CSU came out and kept asking why I did it and I could not answer, I was dissociating and out of it really. He told me, \"I think you just need to be disciplined, that's your problem.\" From then on I pretty much felt like this was something I brought on myself and no longer cared about \"getting better.\" Nothing changed. I still lived under the same roof as my abuser.  I sunk deeper and deeper into a severe depression. I alienated myself from my friends and family. I stopped trying in school. I lost any passion I had for art and music, which I was really fucking good at but quit both. There's no photos of me in our family album books beyond the age of 14 because I could not stand seeing myself. I never went to any dances, joined clubs, or even went to prom. I had a few friends but I really couldn't get close to anyone and they all eventually left me. When everyone was talking about colleges and what they wanted to do with their life, I felt really at a loss because I never did anything worthwhile the entire time I was in high school. \n\nMy 20th birthday was a few days ago and it really hit me that all my teenager years are now gone. Wasted. I spent all that time fighting depression and I feel so fucking robbed of what could've been a happy, memorable youth. I could be in college now or doing something I loved. I had so much potential but I let myself just waste away. I've been living life as this emptied-out hollow shell of the little girl who used to be so bright. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 406648, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I lost my childhood to mental illness.", "url": "https://www.reddit.com/r/depression/comments/9xzroc/i_lost_my_childhood_to_mental_illness/", "whitelist_status": "no_ads", "wls": 0}]}