{"data": [{"author": "linguiiiini", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dicizxo", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542555162, "domain": "self.Advice", "full_link": "https://www.reddit.com/r/Advice/comments/9y6tw1/how_do_i_start_a_life/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9y6tw1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/Advice/comments/9y6tw1/how_do_i_start_a_life/", "pinned": false, "pwls": 0, "retrieved_on": 1542556153, "score": 1, "selftext": "I'm 22 and I've struggled with The Depression for 8 years now. I went to university for four years, I haven't graduated yet and I'm currently taking a break. Unfortunately, I'm feeling a lot like I'm falling further behind and I'd like to change that feeling. I worked for two summers as a camp counselor and that's the extent of my job experience. Years passed and I feel as competent as when I was 14.\n\nI think I have potential to do good with my life and help people. I wasn't amazing or anything, but I was alright. I used to be a straight A minus student with zero effort. I am quite lazy and unmotivated, and I'd like to blame it all on the depression, but that feels like I'm identifying too much as a victim. I'm college, my grades were inconsistent. There were semesters I'd get C's, and D's, and there were semesters I'd get straight's A's. Depended on whether or not I felt like my life mattered that semester. I'm currently taking a break because of depression, and I don't want to waste time away. I also don't know whether or not to go back because it's expensive and I worry I'll regret my life choices because I have no passion for my major.  \n\nIdeally, I'd like some amazing human to think of a thought-out, step-by-step plan to this problem I dug myself in: No experience, no degree, no money. How do I start a life? Any advice would be welcome though, of course.  How I should invest my time to be more employable? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Advice", "subreddit_id": "t5_2qjdm", "subreddit_subscribers": 172775, "subreddit_type": "public", "thumbnail": "self", "title": "How do I start a life?", "url": "https://www.reddit.com/r/Advice/comments/9y6tw1/how_do_i_start_a_life/", "whitelist_status": "no_ads", "wls": 0}, {"author": "linguiiiini", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dicizxo", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542389334, "domain": "self.AskReddit", "full_link": "https://www.reddit.com/r/AskReddit/comments/9xo82s/what_movies_have_made_you_fullon_cry/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xo82s", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 29, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskReddit/comments/9xo82s/what_movies_have_made_you_fullon_cry/", "pinned": false, "pwls": 6, "retrieved_on": 1542389335, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i", "subreddit_subscribers": 20637141, "subreddit_type": "public", "thumbnail": "self", "title": "What movies have made you full-on cry?", "url": "https://www.reddit.com/r/AskReddit/comments/9xo82s/what_movies_have_made_you_fullon_cry/", "whitelist_status": "all_ads", "wls": 6}, {"author": "linguiiiini", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dicizxo", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542309767, "domain": "self.AskReddit", "full_link": "https://www.reddit.com/r/AskReddit/comments/9xebtl/what_movies_have_made_you_ugly_cry/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xebtl", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskReddit/comments/9xebtl/what_movies_have_made_you_ugly_cry/", "pinned": false, "pwls": 6, "retrieved_on": 1542309768, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i", "subreddit_subscribers": 20629768, "subreddit_type": "public", "thumbnail": "self", "title": "What movies have made you Ugly Cry?", "url": "https://www.reddit.com/r/AskReddit/comments/9xebtl/what_movies_have_made_you_ugly_cry/", "whitelist_status": "all_ads", "wls": 6}, {"author": "linguiiiini", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_dicizxo", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542215383, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9x1yww/some_emotional_diarrhea_for_you/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9x1yww", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9x1yww/some_emotional_diarrhea_for_you/", "pinned": false, "pwls": 0, "retrieved_on": 1542215385, "score": 1, "selftext": "I am very lost, feel stuck, and would like some advice, please. I'm in my 20s, and  I think I need help, the emotional support kind. I don't know what to do, and even if I did, I don't think i'd be able to achieve it. I'm feeling hopeless. I'm feeling frustrated because I'm not sure how to express my feelings. What I'm writing doesn't feel good enough. I feel in pain, and sometimes I swear it's physical sadness. I'd like it to stop. But I don't want to kill myself, I don't have intentions, but I'm worried I'm on the path to it, because I haven't been able to stop obsessing about it in my head since I was 14 or so, and sometimes entertaining the idea is enjoyable. I know my mental health is not good, but I'm also worried I'm a narcissist and my life is normal to easy, and i'm not worthy of sadness.  If that is the case, my bad y'all. Sorry for taking your time. But caring about taking your time means I'm probably not a narcissist. Well, everything's a spectrum.\n\nI've seen around 10 mental health professionals, but I only worked with 3 with effort. The first was a psychologist one diagnosed me with severe depression and anxiety. The second one was a psychiatrist, she diagnosed me with severe depression, mild OCD, and no anxiety and told me to get tested for ADD. So I did; I went to the center she directed me to and paid so much money.  The guy who gave the test was still a student, I was his last patient before he became a \"real\" psychologist. He told me that I had moderate to severe depression and moderate to severe anxiety. I asked about what I paid hundreds of dollars for and he said the results were inconclusive. Frustrating. I asked what that meant, and he said that he is 95%-98% sure I'm depressed, but only 50%-60% that I have ADD because depression causes inattentiveness. It felt like I wasted 300$, which is a lot of money to me. (without the student discount it would have been 1800$. that's so expensive) I did get my IQ tested though, so that was a silver lining. I've always wondered and I'm glad to share, I'm officially probably not stupid \n\nWhy I'm reaching out now:\n\nI stopped taking prozac and seeing all the therapists in May of this year when I took a break from college. I'm currently in my break. I've been isolating myself since July. In bed 24/7, silenced my phone, blocked people who were checking up on me. I live with my mom, shes in her mid 50s. I've been sleeping during the day and being awake at night to avoid talking to her. I feel like I'm the one neglecting her, and that makes me feel guilty.  The reversed day/night cycle has been going on since September. This probably has a lot to do with why I feel the way I feel. But I've tried to stop and I can't seem to. Another thing to feel guilty. I am pushing people away because I feel like I'm an asshole to them, and I get angry, but I don't tell them, I feel like I can't control my feelings, I can't stop crying, and I cry quite often. I feel like shit and I'm literally wasting my time on earth. \n\nI probably have a marijuana addiction/dependency. I'm high most of my waking hours. I tried to stop, but I keep buying more, and I don't want to waste it. But, I'd like to stop. I'm glad its not a hard drug. I'm worried I'm headed that ways because I'm taking xanax sometimes. 2mg, I wake up and I don't remember falling asleep. That's another thing I should stop. That one is not an addiction though, that one is an unhealthy coping mechanism for when my mom stresses me out. I feel guilty for being angry at my mother. I love her a lot, and I always will, but I think I also feel feelings that qualify as resentment. It just sucks that parents are humans too and not perfect beings who know everything, including how to emotionally nurture. I feel like I got stuck in some developmental phase, and I'm still 14 mentally. \n\nI feel completely alone. I consciously pushed the people away, so I don't feel like I have the right to feel sad about being alone. I feel a lot of self pity. I feel selfish, because I'm thinking of my friends and I'm not sure I like them. I used to spent time with them because I didn't want to be alone. That's selfish. I think I've hurt people, but it's not personal. I have trouble connecting. \n\nI know I should see a therapist or reach out to friends and family. I don't want to go to therapy and I feel like a child. The therapists I work with are an hour away and I just dont wanna go.  Maybe I'm here for a disciplining, someone to tell me to get off my ass. I'm worried I'll react rebelliously to it. I don't trust my family or friends, and I don't want them to be hurt by words. I told someone I thought I trusted that I thought I might be depressed (this was before all the therapy) and that I was having trouble feeling connected to people and she got angry at me. She said I hurt her feelings with my words because she saw me as a best friend. I ended that friendship a few months later. I feel so defeated, I'm disgusted with myself, with how lazy I've gotten. I feel like a burdening leech for my mom. I have so much more to share, but I've already shared too much.  Sorry it's disorganized, and thanks for giving me a few minutes of your day. Side question: Am I blowing this out of proportion? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 405694, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Some emotional diarrhea for you.", "url": "https://www.reddit.com/r/depression/comments/9x1yww/some_emotional_diarrhea_for_you/", "whitelist_status": "no_ads", "wls": 0}]}