{"data": [{"author": "maraudress", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_cus2b", "can_mod_post": false, "contest_mode": false, "created_utc": 1538627633, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9l8qt6/should_we_not_come_close_to_other_humans/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9l8qt6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9l8qt6/should_we_not_come_close_to_other_humans/", "pinned": false, "pwls": 6, "retrieved_on": 1538627635, "score": 1, "selftext": "I have been diagnosed with Depression for the last ten years. I am fine some days. I can't even turn to the other side of the bed on some days. I took medicines for three months but quit some time ago because I was able to manage without them. The weird sleep was messing with my work as well.\n\nSo this is what happened. A couple of weeks ago, I drank too much to numb myself. It was dark at night. I don't live in a safe city. My friend was dropping me back home but I decided to walk. He convinced me to come with him in the car. I just got aggressive and fought with him but didn't sit in the car. He then started crying and I listened to him. This is the kind of friend that never cries. I later asked him why he was crying and he said because he was feeling helpless.\n\nI drank again last night. And pulled the same shit. Yes I know I have a drinking problem. Yes, I need to quit. Well in my inebriated state, when he was about to cry this time. I told him 'No, not this again'.\n\nI have severe regrets for what I said and I did. This friend will leave my Life and I have no way to stop him. I honestly don't want to because he is better off without me.\n\nMy question is do I just distance myself from everyone till I recover? I know I push people away. Most of them leave too. But my lack of emotions and careless disregard for this person's emotions is making me feel extreme guilt. I don't want this to happen again. I know that I want to quit drinking. I also think that my lack of emotions will still stay. I don't know what to do about this.\n\nIs not having relationships a direct consequence of this disease? What about you guys? Do you never feel the need to end all relationships to end causing suffering to others? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 392603, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Should we not come close to other humans?", "url": "https://www.reddit.com/r/depression/comments/9l8qt6/should_we_not_come_close_to_other_humans/", "whitelist_status": "all_ads", "wls": 6}]}