{"data": [{"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540094100, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9q0mwm/antipsychotic_and_antidepressant_medications/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9q0mwm", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9q0mwm/antipsychotic_and_antidepressant_medications/", "pinned": false, "pwls": 6, "retrieved_on": 1540094101, "score": 1, "selftext": "#  ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS. : depression\n\n**I am searching for individuals in Canada who have experienced the same debilitating side effects and withdrawal effects from being prescribed antipsychotic mediations and other psychotropic medications with the intentions of approaching CBC to propose an investigation into the complacent prescribing of these medications and the destructive aftermath of taking these medications.**\n\n**The text below is a \"condensed\" letter I wrote to the Canadian Association of Mental Health (and others) describing my disturbing, perpetual \"journey\" on psychotropic medications.**\n\n**The complaint process was difficult in that I had not completely discontinued all psychotropic medications and was \"scattered\" missing an opportunity to address additional concerns regarding the prescribing psychiatrist. As psychiatric patients, we are often psychologically and physically vulnerable to the medications we are prescribed and the assumption is that we will be taking psychotropic medications for a lifetime and will never be \"cured\".**\n\n**Respectfully, as a woman who works in health care, I know that there is a population of individuals that benefit from these medications and will have to take psychotropic medications for their lifetime. Please understand that I am not critical or judgemental of these healthcare scenarios.**\n\nThe purpose in sharing the exhausting, and often consuming, chemical psychotropic medication cycle that affected my reality  is to highlight the consequences of mechanically prescribing psychotropic medications, such as Risperidone, and the associated, and often disconcerting symptoms patients experience when these medications are changed or discontinued.  Ill advised, I found myself running from one medication to another with the development of each new and troubling symptom contributing to increased physical and emotional discord. My quest for answers was “frantic” as my body and mind failed me.  To my detriment, this “franticness” was witnessed by the prescribing psychiatrist and a host of other healthcare professionals leaving a permanent impression of madness that is not easily erased.\n\nListening to CBC radio and reviewing this conversation online provided links to numerous studies conducted and documented by reputable sources confirming my initial belief that many of the physical and psychological symptoms I endured over a 5 year period were primarily from psychotropic medication dosage changes, switching from one medication to another, discontinuing these medications completely and the painful emotions from having many of my concerns dismissed with condescension and evident irritability within a small healthcare community.   I would find myself being labeled as a difficult patient and diagnosed with numerous psychiatric syndromes I had never been associated with in the past.\n\nI have a history of an eating disorder decades ago and received treatment at the Toronto General Hospital for 14 weeks beginning in January 1988.   I experienced decreased, yet intermittent binging after receiving care at Toronto General Hospital. I found myself moving to a smaller city to be closer to my ”distant”  father in September 2003 and obtained an unreliable casual cashier position at a local hardware store. I arrived with a small supply of the antidepressant Prozac and considered discontinuing this medication when the supply was exhausted.  My attempt to discontinue Prozac was unsuccessful and I was referred to a psychiatrist in March 2004.\n\nThe prescribing psychiatrist has a private psychiatric practice with full privileges at the local hospital, staffs an outpatient rapid response clinic and is also a clinical assistant professor specializing in mood and anxiety disorders at a reputable university typicalling seeing approximately 700 patients per year since 1997.  These credentials suggest a mental health care professional with significant knowledge of the vast and diverse psychotropic medications he prescribes to hundreds of his patients on day to day basis.\n\nI was prescribed a different antidepressant in March 2004 that was later determined ineffective and replaced with the “familiar” Prozac  in August 2004. I was then prescribed Risperidone in September 2004 to augment the Prozac for depression. I was not aware that benefits of Prozac required time to be achieved.  I returned to this psychiatrist’s office requesting higher and higher doses of Risperidone on three separate occasions specifically for this medication’s sedating properties and I was never advised of the potential irreversible side effects of Risperidone and the difficulty discontinuing this medication when this medication was first initiated and with each subsequent requested dosage increase.  \n\nLiterature reports that many patients will not experience the full benefit of antidepressants therapy immediately and the benefits may take as long as 8 weeks.  Perhaps Risperidone would never have been prescribed had I waited the course till the full benefits of Prozac therapy were achieved; and, conceivably, I could still be taking Prozac today.  \n\nI addressed my concerns about taking Risperidone with the prescribing psychiatrist in April 2008 when I discovered this medication was utilized as a chemical restraint in the elderly population with dementia often presenting with difficult behaviours.  I did not want to take Risperidone after this discovery yet believed the prescribing psychiatrist--a paternal-like figure--”must know best”. I was both shy and timid when addressing my concerns about taking Risperidone only to end up being “in agreement” with current psychotropics or advised to trial another antipsychotic such as Invega.  I opted not to trial Invega. I felt the onus of seeking alternatives to Risperidone fall upon my shoulders and my role in health care was insignificant when compared to the role of psychiatrist. I felt very unsupported.\n\nA typical prescription would read Prozac 80-120mg and Risperdal 2-4mg or simply Prozac 120mg and Risperdal 4mg.  The prescribing psychiatrist documented that I often reduced both medications and, at one time, reduced the Prozac dosage as low a 20mg documenting “relapse” without ever investigating the purpose of my non-compliance.    In addition, my medical charts reveal that a pharmacy had contacted the prescribing psychiatrist asking if they should fill an expired prescription for Risperidone and Prozac as I had reported having accumulated a surplus of medication.  The prescription was filled and the prescriber made no inquiry into the surplus or stockpile of medication I had acquired or the notion of noncompliance. This lack of inquiry hindered the development of a therapeutic relationship that was never really initiated.  \n\nThe antipsychotic medications began to change in late 2012:  from Risperidone to Quetiapine, back to Risperidone *and* Quetiapine, to Trazodone, to Trazodone and Quetiapine and this chemical psychotropic medication cycle  would continue to negatively affect my physical and psychological wellness in such profound ways leading me to believe that other psychotropic medications were ineffective contributing to increased medication changes perpetuating physical harm and psychological chaos for several years to follow.   Unbeknownst to me, I would begin an era fraught with somatic symptoms including increased body pain query fibromyalgia, fatigue, skin rashes, gastrointestinal issues query irritable bowel syndrome, nausea, numbness and tingling, cognitive decline, increased anxiety (GAD), ADHD, fatigue and insomnia coupled with numerous psychiatric labels that I can not seem to escape.   The newly acquired psychiatric labels assigned to me based upon the symptoms I presented with were perhaps the most harmful and destructive eroding my self- esteem and self-confidence in tasks that I had become proficient in.\n\nInsomnia developed when Quetiapine replaced Risperidone and I began to struggle with the demands of shift work where I was required to work within a team environment in a role to care for others.   I would later return to the more “powerful” Risperidone. The prescribing psychiatrist documents in my medical charts that I “did not find the Seroquel as helpful as the Risperdal, and decided to go back on the Risperdal, in addition to continuing on the Seroquel.  She was aware of the increased risk of TD \\[Tardive Dyskinesia\\] by making the decision to go back on the Risperdal, in comparison to remaining solely on Seroquel”. The irony in this statement is that I would not have found myself in that uncomfortable predicament of having to choose between one antipsychotic over another antipsychotic--Risperidone or Seroquel--had the prescribing psychiatrist obtained valid informed consent when the medication was initiated in September 2004.   I propose this example of thorough documentation of informed consent is to avoid blame or responsibility for the prescribing psychiatrist’s failure to obtain informed consent when initially prescribing Risperidone and with subsequent dosage increases in the past.\n\nIn addition,   I had to have older breast implants removed at the hospital I was employed at in 2013 and anticipated discontinuing Risperidone close to the surgery date. I was quite content with my body image in my early 50’s and opted for a simple explantation without additional cosmetic surgery and I had  established very satisfying and financially rewarding employment allowing me to reduce my mortgage significantly.\n\nThe unexpected and coincidental removal of ruptured and encapsulated silicone breast implants in  2013 coupled with the current-day controversy surrounding silicone breast implants at that time contributed to an even greater sense of confusion within me as I began to experience the host of challenging physical and psychological symptoms .  There is a specific group of individuals consisting primarily or women who believe that silicone breast implants and silicone products are harmful and contribute to numerous physical and psychological health concerns including breast implant-associated anaplastic large cell lymphoma.  \n\nI knew enough to recognize the onset of the symptoms I experienced presented quickly but I could not determine if the symptoms were from psychotropic medication changes, psychotropic medication discontinuation or from 28 year old ruptured silicone breast implants.  I was confused and with increased anxiety I asked the prescribing psychiatrist if any of my pain could be contributed to various psychotropic medications and their corresponding changes. His response was “Not to my knowledge”. There is sufficient documentation regarding the onset of the physical and psychological symptoms experienced in my medical notes from my local walk-in medical clinic; a medical clinic  that would abruptly dismiss my concerns only to discover that genuine health concerns existed. I vividly recall a physician in this medical clinic, with great annoyance, attempt to convince me that I had a complex chronic disease by utilizing a “tick-in-the-box” symptom checker sheet.\n\nLoss of respect and faith in this medical clinic eventually replaced the painful feelings of being identified as a difficult and undesirable patient.  \n\nMy coping skills diminished quickly with the numerous psychotropic medication changes originating from a conscious and documented attempt to discontinue Risperidone in 2012 leading me to believe that the Prozac I had taken since the late 1998 was no longer effective.  I inquired about the efficacy of Prozac when taken for extended periods of time and the prescriber psychiatrist could not comment so I requested to switch to another antidepressant in April 2014. My ability to concentrate at work declined significantly as I began to soil myself with increasing frequency and I felt I had to  transfer from an acute care position consisting of shiftwork that I truly loved to a disappointing and unsupportive part time position is residential care due to the unpredictability of my bowels. I was overwhelmed when, to use medical terminology, I was incontinent of a large loose, liquid BM in Walmart. This fecal incontinence affected my ability to manage at work and in daily life and I sought more frequent psychiatric counsel.   The prescribing psychiatrist was unable to connect the increased loose fecal incontinence I experienced with the medication he prescribed in April 2014 until late August 2014. The prescribing psychiatrist suggested I consider the plant-based Vegan diet and implied that the “aging process” may be contributing to my physical symptoms. These symptoms exacerbated any mood disorder I may have had contributing to increased anxiety, depression and  isolation coupled with feelings complete helplessness.\n\nThe prescribing psychiatrist did not consider a differential diagnosis and review the various psychotropic medication changes prescribed, beginning with Risperidone, as potential sources to the numerous side effects presented.  I would learn years later that the medication causing fecal incontinence prescribed in April 2014 had been prescribed and deemed ineffective a decade earlier in 2004 and the prescribing psychiatrist neglected to refer to my medical charts when inadvertently re-prescribing this medication for a second time.  \n\nI was very afraid as my mind and body began to fail me.  The physical and psychological symptoms escalated and I called 811 in August 2014 and was advised to go to the emergency department in the hospital where I work.  Emergency physicians often refer to a medication databank listing the patient’s dispensed medications to develop an understanding into the patient’s medical history and to gain potential insight into the cause of patient’s primary complaint leading to an emergency visit.    My medication databank (Pharmanet) listed numerous and various psychotropic medications dispensed over several months and I was “hurt” to hear the emergency physician state that I was wasting his time during this isolated visit in August 2014. Thoughtless and disparaging  comments and attitudes towards individuals with mental illness are common in the healthcare profession; a profession that should display more tolerance towards individuals with mental illness. Individuals holding positions of authority in healthcare should choose to be positive role models for others and lead by example.  The emergency physician’s statement clearly implied I was a burden and this notion would be reinforced by health care professionals in my community for years to come serving to exacerbate any struggles I may have had with depression and anxiety.\n\nI have been privy to many conversations regarding challenging patients and I regretfully admit to participating in some of these conversations.   I distinctly recall caring for two women known throughout the healthcare facility as being demanding and unreasonable and it became difficult for me to care for them “burdened” with the notion that I too, could be one them.  To my surprise, one of these women was transferred to the local hospice facility for end-of-life care and I felt a sense of guilt as I watched her mobilize to the hospice dinner table.\n\nI terminated my relationship with the prescribing psychiatrist of 10 years, from March 2004 to September 2014, and received chastising comments for my actions  from my GP at the time. My GP’s disapproval instilled feelings of guilt and the need for me to make amends by sending a 2014 Christmas card to the prescribing psychiatrist.\n\nI would connect with a new psychiatrist December 2014 and she suggested the mainstay of treatment should be psychotherapeutic in nature describing the purpose of this treatment format and how I would benefit from such treatment.  I am saddened to read of the individual I had become as described in the “new” initial psychiatric assessment in December 2014. The negative experiences from psychotropic medication changes, discontinuing psychotropic medication and with healthcare professionals contributed to feeling “like she is constantly being judged...she is afraid of being humiliated by others...she struggles with feeling like a fraud and that they can see her dysfunction...and is worried that her co-workers can see it in her”.  In addition, this initial consult reports “chronic pain in her arms, shoulders, chest, through her legs for the last year and a half and has seen doctors who believe it might be fibromyalgia...there are chronic gastrointestinal symptoms with a possible diagnosis of Irritable Bowel Syndrome...her thought content was significant for decreased self-worth and she spoke about herself with quite disgust and shame”.\n\nI had finally discontinued all psychotropic medications with the exception of a small dose of Oxazepam for sleep for well over a year when I first listened to this particular CBC White Coat Black Art podcast in May 2018.  This podcast and corresponding website providing links to reputable academic sources strongly suggests that pertinent information regarding patient safety and the physical and psychological side effects related to psychotropic medication changes has been known, present and available for decades.    I find myself wondering why the prescribing psychiatrist, with all of his credentials, did not consider the various medication changes as the source for the exacerbation of physical and psychiatric symptoms and the onset of new symptoms I presented with. In hindsight, perhaps it is possible that the prescribing psychiatrist did suspect that some of my  symptoms were related to psychotropic medication changes when he prescribed Nabilone for pain; he just never articulated his suspicions to me or the healthcare providers at my local walk-in medical clinic.\n\nIn November 2016 I requested my medical notes from the psychiatrist who initiated the course of Risperidone more than twelve years ago  with the intent of complaining to the College of Physicians and Surgeons after caring for an elderly woman who was prescribed levodopa/carbidopa three times a day.   Many patients are prescribed levodopa/carbidopa yet there was no mention of this woman having Parkinson’s disease during shift report. It was discovered this woman presented with Parkinsonian symptoms as a result of taking Olanzapine for several decades.     I could be this woman 20 years from now. This woman was later diagnosed with Stickman’s Disease by the local neurologist.\n\nI continued to struggle with the physical and psychological symptoms that began  when I attempted to discontinue Risperidone in 2012. I had been diagnosed with ADHD the previous year and the physical and psychological  symptoms persisted affecting my ability to focus and concentrate contributing to feelings of increased confusion and self-doubt. Equally disabling is the the ADHD diagnosis/label itself.  I now understand that I have lived with the same brain my whole life but I became fearful of ADHD’s presence with increased incidents of forgetfulness when racing thoughts regarding my failing mind and body would interrupt the continuity of complicated processes of established learned skill-sets and well laid plans.  I began to identify strongly with the geriatric population and considered the possibility of dementia.\n\nIn addition, I recently discovered I had renal health concerns during this time period learning that my kidneys were “allergic’ to Hydrochlorothiazide.    I developed hypertension during this era of psychotropic medication changes and I was having an adverse reaction to this medication. I began to experience neurological twitching in my fingers, increased numbness and tingling coupled with flank pain and my GP abruptly dismissed me without listening to my concerns  stating I had somatoform disorder because I had a history of an eating disorder decades ago.\n\nPerhaps one of the most humiliating experiences was returning to the emergency room in the hospital where I was employed--for a second time--to describe these symptoms noted above and to state with transparency that these symptoms, as per my GP, were symptoms of somatoform disorder.  I was referred to a nephrologist who identified a legitimate health concern and who would soon adopt the same attitude as my GP. I became a renal patient that day.\n\nWith my medical notes obtained November 2016, I submitted a formal written  complaint to the College of Physicians and Surgeons in February 2017 regarding the psychiatric care received and this complaint went unheeded.   I received the psychiatrist’s response to my initial complaint after June 28, 2017, and the content of his response confirmed:\n\n* I was only provided with my transcribed medical charts and not given the handwritten medical charts when I requested my medical files in November 2016.\n* The prescribing psychiatrist did not refer to my medical charts  when inadvertently re-prescribing an ineffective medication for a second time in April 2014.\n\nReceipt of my handwritten medical charts in July 2017 reveal and support the notion that valid informed consent was never obtained or documented until April 2008 confirming my original query to the College of Physicians and Surgeons when I inquired “Why wouldn’t \\[the prescribing psychiatrist\\] discuss the side effects with me when I began taking Risperidone when he first prescribed the medication to me?”\n\nI was emotionally scattered after receiving the prescribing psychiatrist’s response and had recently been approved for long-term disability through my employer benefit package.   A series of negative interactions with healthcare professionals accelerated my determination to discontinue all psychotropic medications at this time. It was unsettling to observe a rheumatologist google the results of a pathology report of a recent skin biopsy after waiting months to see her and it was equally unsettling to have to request new bloodwork when a second nephrologist made reference to lab values from six months ago during a 6-month consult.   This same nephrologist would document that I had” discontinued all my medications with exception of oxazepam” underscoring my sense of “madness”. This nephrologist ordered new bloodwork, at my request, stating that a renal biopsy may be ordered if proteinuria and hematuria were present--and they were. I considered relocating to a larger city to receive healthcare realizing that all future health concerns would be met with familiar disdain within the small community I resided in.   \n\nI believed the continual proteinuria and hematuria was contributing to the physical symptoms I presented with and sought healthcare at the Mayo Clinic in Scottsdale, Arizona, November 2017.  My humble and pitiful admission of traveling to the Mayo Clinic indicates the continued presence of physical and psychological symptoms months after discontinuing psychotropic medications and my own vulnerable and determined quest for answers knowing that the symptoms I presented with began within a specific time frame. The distinct stigma  towards individuals with mental illness that I experienced in my hometown was all too prevalent at the Mayo Clinic in Scottsdale, Arizona. My body was changing and declining in so many ways and I felt helpless and isolated.\n\nI overlooked the advisement of the College of Physicians and Surgeons to provide any new facts “to be of particular significance to the issues at hand” regarding my complaint about the psychiatric care I received for over a decade after receipt of the prescribing psychiatrist’s response to my initial letter of complaint and inbetween obtaining the other half of my medical chart.  In addition, issues regarding abnormal lab values, disdainful healthcare professional attitudes, discontinuing medications and entertaining the idea of moving to a larger city also contributed to the oversight of the College’s advisement. I could see the inconsistencies in the psychiatric care I received but did not possess the means to articulate these inconsistencies with appropriate medical and legal language  nor could I present them in a timely manner. I am a team on one with limited time and resources.\n\nThe timing of listening to this academic conversation on CBC’s White Coat Black Art addressing and discussing the physical and psychological side effects individuals often experience from discontinuing an array of psychotropic medications on May 11, 2018 could not have presented at a more opportune time:   I was taking a lunch break from writing a “Statement of Points” to the Health Professions Review Board, at a local library in Vancouver, regarding the complaint I made to the College of Physicians and Surgeons of British Columbia concerning the care I received from the prescribing physician over the course of 10 years when I first listened to this podcast.  \n\nI believed the content of this CBC White Coat Black Art podcast so significant that I included the link to this podcast with subsequent links to  “When it comes to antidepressants, getting to zero proves difficult” by Dr. Goldman, “Many People taking Antidepressants Discover They Cannot Quit” by Benedict Carey and Robert Gebeloff of The New York Times,  and “Antidepressant Discontinuation Syndrome” by C. Warner and colleagues, in my Statement of Points to the Health Professions Review Board. I naively believed the Health Professions Review Board Panel would take the time to listen and consider the well researched and documented content of this CBC podcast that succinctly explains the source of the physical and psychological symptoms I endured for several years:  symptoms related to antipsychotic and psychotropic medications.\n\nThe Health Professions Review Board decision favoured the initial psychiatrist and reported that the documents I submitted “demonstrates that the Complainant is not a reliable historian and that she has demonstrated an unwillingness to accept a diagnosis or treatment that does not accord with her own view of her medical conditions as she understands them.”   \n\nMedical research and documentation relegated to medical textbooks in university and hospital libraries are now available online and it makes sense that I would search for corroborating medical knowledge to confirm that I endured numerous physical and psychological  side effects resulting from psychotropic medication changes. The evident holes in my medical charts reveal that informed consent was not obtained until I had become reliant on this medication’s sedating properties. Online research will continue as the well-known adverse effects from antipsychotic and antidepressant medications are now openly revealed and discussed on public platforms including radio and television in addition to internet sources.   To reiterate: I naively declared in my initial complaint to the College of Physicians and Surgeons that I began to experience many uncomfortable physical and emotional symptoms coinciding with a conscious attempt to discontinue Risperidone in 2012. These side effects were validated when listening to CBC and researching the numerous sources cited.\n\nMy original declaration was made without having obtained all my medical documentation and receipt of this documentation would confirm that I was not made aware of the irreversible side effects and difficulting discontinuing Risperidone when this medication was initially and subsequently prescribed until I addressed the issue of the inappropriate use of Risperidone as a chemical restraint in the elderly population in 2008.  The Panel Chair’s response to my review request minimizes the physical and psychological symptoms I experienced when attempting to discontinue Risperidone and the chemical psychotropic medication cycle perpetuated from this event for several years to follow. In addition, this response explicitly implies that the symptoms I experienced are a result of my own negligence placing the fault upon the psychiatric patient.\n\nThe personal nature of psychiatric treatment suggests that psychiatric patients are often emotionally and/or intellectually unstable and unreliable historians creating  invisible barriers hindering the vulnerable psychiatric patient’s ability to complain effectively about psychiatric care they have received. The invisible barriers intimidate, discourage and prevent the psychiatric patient from submitting  formal complaints against the psychiatric healthcare provider to appropriate governing bodies who dismiss their concerns favouring the psychiatric practitioner.\n\nI did not possess all the essential medical and legal language when formalizing my complaints to these governing bodies and their responses simply reiterate my mental illness history based upon the psychiatrist’s documentation stating I am an inaccurate historian rather than acknowledge that:  \n\n* I was not provided with half of my medical chart essential to ensure greater accuracy in describing the historical events in my initial complaint regarding care received over a 10-year period;\n* the withheld medical charts  indicates informed consent was not obtained during the first 4 years of care;\n* the prescriber neglected to refer to my medical chart prior to re-prescribing an ineffective psychotropic medication strongly suggesting that he, too, is an  inaccurate historian;\n* The combination of numerous psychotropic medication changes, beginning with initial prescription of Risperidone in 2004,  followed by numerous attempts to discontinue this medication in 2012 contributed to the numerous physical and psychological symptoms I would experience from years to come; and\n* the prescribing psychiatrist did not acknowledge the onset of exacerbated and unexplained symptoms as a result of psychotropic medication changes.\n\nAddressing my concerns to the College of Physicians and Surgeons of British Columbia and extending my complaint further to the Health Professions Review Board were ineffective.   On August 3, 2017, I registered a “Petition to the Court” in the Supreme Court of British Columbia to set aside decisions made my the Health Professions Review Board and The College of Physicians and Surgeons  with the intent of remitting the matter back to the College of Physicians and Surgeons. I have enclosed a copy of the “Petition to the Court” for your perusal.\n\nThe barriers I experienced in registering this Petition were many and it’s contents may appear simple, naive, and lacking in both legal and medical expertise.\n\nI have cited and listed the same documentation I had provided electronic links to for the Health Professions Review Board to examine in an affidavit to “Petition to the Court”  from the CBC White Coat Black Art podcast that aired May 11, 2018. Some of the documents cited as evidence affirm that knowledge of the physical and psychological symptoms attributed to discontinuing antipsychotic and antidepressant medications has been known for decades and should have been acknowledged by the initial prescriber of Risperidone.   I would have also cited Dr. Richard Friedman’s article “A Call for Caution in the Use of Antipsychotic Drugs” had I been permitted to submit additional documentation.\n\nI exercise respect when stating that I am not physician, a psychiatrist or a lawyer.  I am an individual, a middle-aged woman, a caregiver, and a patient with a history of mental illness who encountered numerous obstacles and barriers necessitating tenacity in attempting to access the legal system independently when others would simply submit and accept to living with the same “conditions” believing themselves powerless, feeling voiceless and invisible.  \n\nThe dismissive, and often humiliating, incidents I experienced from healthcare professionals occuring while under the care of the initial prescribing psychiatrist continued even after ending this patient/psychiatrist relationship.  These incidents are not the primary issue in my legal suit requesting the Supreme Court of British Columbia to quash the Health Professions Review Board and College of Physicians and Surgeons’ decisions in favour of the initial psychiatrist; rather, these incidents were a manifestation of preconceived notions and stigmatic beliefs towards individuals with mental illness attempting to reclaim their mental wellness and serve to underscore the necessity for transparency between psychiatrist and patient.  There is a defined series of events that transpired when I attempted to discontinue Risperidone in late 2012: a\n\nmedication I continued to request higher doses of without being informed of the potential irreversible side effects and the difficulting in discontinuing this medication.  These events continued to undermine any legitimate health concerns I presented with in the small city I resided in and have affected the care and a diagnosis I received from a healthcare practitioner in the metropolis I currently reside in.  It is fortunate that I acquire a GP here who is both an academic and a scientist. Dare I say, these events may not have occurred had I been given sufficient information to make an informed choice about the nature of Risperidone in 2004 when this medication was quickly prescribed in the final minutes of a 30 minute consult.  \n\nI suspect that the initial prescribing psychiatrist recognized that the harm of his actions, or lack of actions, would require significant explanation and psychiatric care reflecting poorly upon him and his position in authority  within a small healthcare community. In addition, it was less problematic for him, and perhaps somewhat of a relief, when I sought alternative mental healthcare after losing faith in his abilities.\n\nThe difficulty I experienced discontinuing Risperidone and subsequent psychotropic medications mirrors similar difficulties other patients have experienced exemplifying the “Elephant in the Room” idiom:  The difficulty discontinuing psychotropic medications, including the “powerful” Risperidone, is an undesirable fact that remained unaddressed and ignored until reputable sources such as CBC and The New York Times presented this serious problem identifying the physical and emotional symptoms patients have experienced and their vain attempts to discontinue these medications only to experience failure and to have these symptoms attributed to their declining  mental illness. I believe I have a legitimate complaint regarding the psychiatric care I received from 2004-2014 in that the prescribing psychiatrist and university professor had an understanding that I was physically and psychologically struggling to discontinue Risperidone and various psychotropic medications trialled when he prescribed Nabilone for pain. Prescribing a medication without obtaining informed consent and re-prescribing an ineffective medication in error only compounds the harm done by not identifying the disturbing symptoms I began to experience in 2012 when I attempted to discontinue Risperidone.     \n\nRelocating to a larger city for healthcare has revealed that I have “thin basement membrane disease”, a renal aneurysm and a grade 2 rectocele in a relatively kind, emotionally “safe” and “patient” medical environment.  Food has not been an issue for several years and this fact, in isolation, is emancipating. I take less analgesic and continue to live with intermittent pain, headaches, GI concerns and hypertension coupled with numbness and tingling that began during my “journey”.   I struggle at times with a misaligned circadian rhythm and my sleep quality, for the most part, is moderate and I have been advised not to work nights shifts again. I long to be able to take that satisfying and re-energizing 20 minute midday nap that has been unattainable since discontinuing psychotropic medication well over a year ago.  My cognition has evolved and matured since my initial complaint to the College in February 2017 regarding the psychiatric care I received for more than a decade and I can define my concerns with greater clarity.\n\nI recognize and even expect that my description of events may be, yet again, dismissed as a result of mental illness contributing to medical, scientific or unkind comments regarding my emotional demeanor.  After all, I am a psychiatric patient and psychiatric patients are poor historians.\n\nThe issues of mechanically prescribing powerful psychotropic medications, such as Risperidone, without providing adequate medication information in a manner easily understood by patients,  medical complacency in continuous prescribing of large doses of psychotropic medications without inquiring into the patient’s logic and reasoning for their non-compliance, re-prescribing ineffective psychotropic medication without referring to a patient’s medication history and not identifying and associating the onset of increased or new symptoms with psychotropic medication changes need to be addressed in a medical culture that often corrects emotional maladies with a pill.    \n\n My mental health history clearly indicates the desire to discontinue the psychotropic medication Risperidone and I was prescribed this medication without appropriate medication information. These facts coupled with experiencing the onset and continuation of very uncomfortable  physical and psychological symptoms when attempting to discontinue Risperidone with insufficient support was both socially and medically undermining marking the beginning of sad and stressful chapter in my life that I look forward to closing. Resiliency should not be this difficult.\n\nIn conclusion, this journey has been one of isolation coupled with fears of being ostracized for burdening others with my concerns and linked hand-in-hand with suggestions and explicit statements that I was a burden, a waste of time, while attempting to have some of the physical and psychological symptoms I experienced from psychotropic medication changes addressed.  I simply state that my journey has consisted of a series of experiences that have negatively impacted my physical and psychological well-being. I am apprehensive, yet clearly in need of returning to meaningful employment. My thoughts are more clear and I recognize I have been provided with the gift of time and the opportunity to share my concerns with you and to register  these concerns with the Supreme Court of British Columbia. As mentioned previously, the tone of this letter is written calmly and is meant to be read and interpreted in this manner and I hope to maintain this demeanour when I present to the Supreme Court.\n\nI have encountered many individuals who feel this endeavour will fail; however, the attempt has been made, the concerns addressed and the event recorded for others to follow as the inconvenient truths about psychotropic medications are revealed.\n\nI am presently unsure of how to reestablish a life with purpose and self-worth and trust I will continue to recognize and acknowledge unexpected events as opportunities to reclaim my mental wellness in a new journey towards self-discovery.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398238, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS", "url": "https://www.reddit.com/r/depression/comments/9q0mwm/antipsychotic_and_antidepressant_medications/", "whitelist_status": "all_ads", "wls": 6}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540093330, "domain": "self.Drugs", "full_link": "https://www.reddit.com/r/Drugs/comments/9q0jys/antipsychotics_and_antidepressants/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9q0jys", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 34, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/Drugs/comments/9q0jys/antipsychotics_and_antidepressants/", "pinned": false, "pwls": 0, "retrieved_on": 1540093331, "score": 1, "selftext": "**I am searching for individuals in Canada who have experienced the same debilitating side effects and withdrawal effects from being prescribed antipsychotic mediations and other psychotropic medications with the intentions of approaching CBC to propose an investigation into the complacent prescribing of these medications and the destructive aftermath of taking these medications.**\n\n**The text below is a \"condensed\" letter I wrote to the Canadian Association of Mental Health (and others) describing my disturbing, perpetual \"journey\" on psychotropic medications.**\n\n**The complaint process was difficult in that I had not completely discontinued all psychotropic medications and was \"scattered\" missing an opportunity to address additional concerns regarding the prescribing psychiatrist. As psychiatric patients, we are often psychologically and physically vulnerable to the medications we are prescribed and the assumption is that we will be taking psychotropic medications for a lifetime and will never be \"cured\".**\n\n**Respectfully, as a woman who works in health care, I know that there is a population of individuals that benefit from these medications and will have to take psychotropic medications for their lifetime. Please understand that I am not critical or judgemental of these healthcare scenarios.**\n\nThe purpose in sharing the exhausting, and often consuming, chemical psychotropic medication cycle that affected my reality  is to highlight the consequences of mechanically prescribing psychotropic medications, such as Risperidone, and the associated, and often disconcerting symptoms patients experience when these medications are changed or discontinued.  Ill advised, I found myself running from one medication to another with the development of each new and troubling symptom contributing to increased physical and emotional discord. My quest for answers was “frantic” as my body and mind failed me.  To my detriment, this “franticness” was witnessed by the prescribing psychiatrist and a host of other healthcare professionals leaving a permanent impression of madness that is not easily erased.\n\nListening to CBC radio and reviewing this conversation online provided links to numerous studies conducted and documented by reputable sources confirming my initial belief that many of the physical and psychological symptoms I endured over a 5 year period were primarily from psychotropic medication dosage changes, switching from one medication to another, discontinuing these medications completely and the painful emotions from having many of my concerns dismissed with condescension and evident irritability within a small healthcare community.   I would find myself being labeled as a difficult patient and diagnosed with numerous psychiatric syndromes I had never been associated with in the past.\n\nI have a history of an eating disorder decades ago and received treatment at the Toronto General Hospital for 14 weeks beginning in January 1988.   I experienced decreased, yet intermittent binging after receiving care at Toronto General Hospital. I found myself moving to a smaller city to be closer to my ”distant”  father in September 2003 and obtained an unreliable casual cashier position at a local hardware store. I arrived with a small supply of the antidepressant Prozac and considered discontinuing this medication when the supply was exhausted.  My attempt to discontinue Prozac was unsuccessful and I was referred to a psychiatrist in March 2004.\n\nThe prescribing psychiatrist has a private psychiatric practice with full privileges at the local hospital, staffs an outpatient rapid response clinic and is also a clinical assistant professor specializing in mood and anxiety disorders at a reputable university typicalling seeing approximately 700 patients per year since 1997.  These credentials suggest a mental health care professional with significant knowledge of the vast and diverse psychotropic medications he prescribes to hundreds of his patients on day to day basis.\n\nI was prescribed a different antidepressant in March 2004 that was later determined ineffective and replaced with the “familiar” Prozac  in August 2004. I was then prescribed Risperidone in September 2004 to augment the Prozac for depression. I was not aware that benefits of Prozac required time to be achieved.  I returned to this psychiatrist’s office requesting higher and higher doses of Risperidone on three separate occasions specifically for this medication’s sedating properties and I was never advised of the potential irreversible side effects of Risperidone and the difficulty discontinuing this medication when this medication was first initiated and with each subsequent requested dosage increase.  \n\nLiterature reports that many patients will not experience the full benefit of antidepressants therapy immediately and the benefits may take as long as 8 weeks.  Perhaps Risperidone would never have been prescribed had I waited the course till the full benefits of Prozac therapy were achieved; and, conceivably, I could still be taking Prozac today.  \n\nI addressed my concerns about taking Risperidone with the prescribing psychiatrist in April 2008 when I discovered this medication was utilized as a chemical restraint in the elderly population with dementia often presenting with difficult behaviours.  I did not want to take Risperidone after this discovery yet believed the prescribing psychiatrist--a paternal-like figure--”must know best”. I was both shy and timid when addressing my concerns about taking Risperidone only to end up being “in agreement” with current psychotropics or advised to trial another antipsychotic such as Invega.  I opted not to trial Invega. I felt the onus of seeking alternatives to Risperidone fall upon my shoulders and my role in health care was insignificant when compared to the role of psychiatrist. I felt very unsupported.\n\nA typical prescription would read Prozac 80-120mg and Risperdal 2-4mg or simply Prozac 120mg and Risperdal 4mg.  The prescribing psychiatrist documented that I often reduced both medications and, at one time, reduced the Prozac dosage as low a 20mg documenting “relapse” without ever investigating the purpose of my non-compliance.    In addition, my medical charts reveal that a pharmacy had contacted the prescribing psychiatrist asking if they should fill an expired prescription for Risperidone and Prozac as I had reported having accumulated a surplus of medication.  The prescription was filled and the prescriber made no inquiry into the surplus or stockpile of medication I had acquired or the notion of noncompliance. This lack of inquiry hindered the development of a therapeutic relationship that was never really initiated.  \n\nThe antipsychotic medications began to change in late 2012:  from Risperidone to Quetiapine, back to Risperidone *and* Quetiapine, to Trazodone, to Trazodone and Quetiapine and this chemical psychotropic medication cycle  would continue to negatively affect my physical and psychological wellness in such profound ways leading me to believe that other psychotropic medications were ineffective contributing to increased medication changes perpetuating physical harm and psychological chaos for several years to follow.   Unbeknownst to me, I would begin an era fraught with somatic symptoms including increased body pain query fibromyalgia, fatigue, skin rashes, gastrointestinal issues query irritable bowel syndrome, nausea, numbness and tingling, cognitive decline, increased anxiety (GAD), ADHD, fatigue and insomnia coupled with numerous psychiatric labels that I can not seem to escape.   The newly acquired psychiatric labels assigned to me based upon the symptoms I presented with were perhaps the most harmful and destructive eroding my self- esteem and self-confidence in tasks that I had become proficient in.\n\nInsomnia developed when Quetiapine replaced Risperidone and I began to struggle with the demands of shift work where I was required to work within a team environment in a role to care for others.   I would later return to the more “powerful” Risperidone. The prescribing psychiatrist documents in my medical charts that I “did not find the Seroquel as helpful as the Risperdal, and decided to go back on the Risperdal, in addition to continuing on the Seroquel.  She was aware of the increased risk of TD \\[Tardive Dyskinesia\\] by making the decision to go back on the Risperdal, in comparison to remaining solely on Seroquel”. The irony in this statement is that I would not have found myself in that uncomfortable predicament of having to choose between one antipsychotic over another antipsychotic--Risperidone or Seroquel--had the prescribing psychiatrist obtained valid informed consent when the medication was initiated in September 2004.   I propose this example of thorough documentation of informed consent is to avoid blame or responsibility for the prescribing psychiatrist’s failure to obtain informed consent when initially prescribing Risperidone and with subsequent dosage increases in the past.\n\nIn addition,   I had to have older breast implants removed at the hospital I was employed at in 2013 and anticipated discontinuing Risperidone close to the surgery date. I was quite content with my body image in my early 50’s and opted for a simple explantation without additional cosmetic surgery and I had  established very satisfying and financially rewarding employment allowing me to reduce my mortgage significantly.\n\nThe unexpected and coincidental removal of ruptured and encapsulated silicone breast implants in  2013 coupled with the current-day controversy surrounding silicone breast implants at that time contributed to an even greater sense of confusion within me as I began to experience the host of challenging physical and psychological symptoms .  There is a specific group of individuals consisting primarily or women who believe that silicone breast implants and silicone products are harmful and contribute to numerous physical and psychological health concerns including breast implant-associated anaplastic large cell lymphoma.  \n\nI knew enough to recognize the onset of the symptoms I experienced presented quickly but I could not determine if the symptoms were from psychotropic medication changes, psychotropic medication discontinuation or from 28 year old ruptured silicone breast implants.  I was confused and with increased anxiety I asked the prescribing psychiatrist if any of my pain could be contributed to various psychotropic medications and their corresponding changes. His response was “Not to my knowledge”. There is sufficient documentation regarding the onset of the physical and psychological symptoms experienced in my medical notes from my local walk-in medical clinic; a medical clinic  that would abruptly dismiss my concerns only to discover that genuine health concerns existed. I vividly recall a physician in this medical clinic, with great annoyance, attempt to convince me that I had a complex chronic disease by utilizing a “tick-in-the-box” symptom checker sheet.\n\nLoss of respect and faith in this medical clinic eventually replaced the painful feelings of being identified as a difficult and undesirable patient.  \n\nMy coping skills diminished quickly with the numerous psychotropic medication changes originating from a conscious and documented attempt to discontinue Risperidone in 2012 leading me to believe that the Prozac I had taken since the late 1998 was no longer effective.  I inquired about the efficacy of Prozac when taken for extended periods of time and the prescriber psychiatrist could not comment so I requested to switch to another antidepressant in April 2014. My ability to concentrate at work declined significantly as I began to soil myself with increasing frequency and I felt I had to  transfer from an acute care position consisting of shiftwork that I truly loved to a disappointing and unsupportive part time position is residential care due to the unpredictability of my bowels. I was overwhelmed when, to use medical terminology, I was incontinent of a large loose, liquid BM in Walmart. This fecal incontinence affected my ability to manage at work and in daily life and I sought more frequent psychiatric counsel.   The prescribing psychiatrist was unable to connect the increased loose fecal incontinence I experienced with the medication he prescribed in April 2014 until late August 2014. The prescribing psychiatrist suggested I consider the plant-based Vegan diet and implied that the “aging process” may be contributing to my physical symptoms. These symptoms exacerbated any mood disorder I may have had contributing to increased anxiety, depression and  isolation coupled with feelings complete helplessness.\n\nThe prescribing psychiatrist did not consider a differential diagnosis and review the various psychotropic medication changes prescribed, beginning with Risperidone, as potential sources to the numerous side effects presented.  I would learn years later that the medication causing fecal incontinence prescribed in April 2014 had been prescribed and deemed ineffective a decade earlier in 2004 and the prescribing psychiatrist neglected to refer to my medical charts when inadvertently re-prescribing this medication for a second time.  \n\nI was very afraid as my mind and body began to fail me.  The physical and psychological symptoms escalated and I called 811 in August 2014 and was advised to go to the emergency department in the hospital where I work.  Emergency physicians often refer to a medication databank listing the patient’s dispensed medications to develop an understanding into the patient’s medical history and to gain potential insight into the cause of patient’s primary complaint leading to an emergency visit.    My medication databank (Pharmanet) listed numerous and various psychotropic medications dispensed over several months and I was “hurt” to hear the emergency physician state that I was wasting his time during this isolated visit in August 2014. Thoughtless and disparaging  comments and attitudes towards individuals with mental illness are common in the healthcare profession; a profession that should display more tolerance towards individuals with mental illness. Individuals holding positions of authority in healthcare should choose to be positive role models for others and lead by example.  The emergency physician’s statement clearly implied I was a burden and this notion would be reinforced by health care professionals in my community for years to come serving to exacerbate any struggles I may have had with depression and anxiety.\n\nI have been privy to many conversations regarding challenging patients and I regretfully admit to participating in some of these conversations.   I distinctly recall caring for two women known throughout the healthcare facility as being demanding and unreasonable and it became difficult for me to care for them “burdened” with the notion that I too, could be one them.  To my surprise, one of these women was transferred to the local hospice facility for end-of-life care and I felt a sense of guilt as I watched her mobilize to the hospice dinner table.\n\nI terminated my relationship with the prescribing psychiatrist of 10 years, from March 2004 to September 2014, and received chastising comments for my actions  from my GP at the time. My GP’s disapproval instilled feelings of guilt and the need for me to make amends by sending a 2014 Christmas card to the prescribing psychiatrist.\n\nI would connect with a new psychiatrist December 2014 and she suggested the mainstay of treatment should be psychotherapeutic in nature describing the purpose of this treatment format and how I would benefit from such treatment.  I am saddened to read of the individual I had become as described in the “new” initial psychiatric assessment in December 2014. The negative experiences from psychotropic medication changes, discontinuing psychotropic medication and with healthcare professionals contributed to feeling “like she is constantly being judged...she is afraid of being humiliated by others...she struggles with feeling like a fraud and that they can see her dysfunction...and is worried that her co-workers can see it in her”.  In addition, this initial consult reports “chronic pain in her arms, shoulders, chest, through her legs for the last year and a half and has seen doctors who believe it might be fibromyalgia...there are chronic gastrointestinal symptoms with a possible diagnosis of Irritable Bowel Syndrome...her thought content was significant for decreased self-worth and she spoke about herself with quite disgust and shame”.\n\nI had finally discontinued all psychotropic medications with the exception of a small dose of Oxazepam for sleep for well over a year when I first listened to this particular CBC White Coat Black Art podcast in May 2018.  This podcast and corresponding website providing links to reputable academic sources strongly suggests that pertinent information regarding patient safety and the physical and psychological side effects related to psychotropic medication changes has been known, present and available for decades.    I find myself wondering why the prescribing psychiatrist, with all of his credentials, did not consider the various medication changes as the source for the exacerbation of physical and psychiatric symptoms and the onset of new symptoms I presented with. In hindsight, perhaps it is possible that the prescribing psychiatrist did suspect that some of my  symptoms were related to psychotropic medication changes when he prescribed Nabilone for pain; he just never articulated his suspicions to me or the healthcare providers at my local walk-in medical clinic.\n\nIn November 2016 I requested my medical notes from the psychiatrist who initiated the course of Risperidone more than twelve years ago  with the intent of complaining to the College of Physicians and Surgeons after caring for an elderly woman who was prescribed levodopa/carbidopa three times a day.   Many patients are prescribed levodopa/carbidopa yet there was no mention of this woman having Parkinson’s disease during shift report. It was discovered this woman presented with Parkinsonian symptoms as a result of taking Olanzapine for several decades.     I could be this woman 20 years from now. This woman was later diagnosed with Stickman’s Disease by the local neurologist.\n\nI continued to struggle with the physical and psychological symptoms that began  when I attempted to discontinue Risperidone in 2012. I had been diagnosed with ADHD the previous year and the physical and psychological  symptoms persisted affecting my ability to focus and concentrate contributing to feelings of increased confusion and self-doubt. Equally disabling is the the ADHD diagnosis/label itself.  I now understand that I have lived with the same brain my whole life but I became fearful of ADHD’s presence with increased incidents of forgetfulness when racing thoughts regarding my failing mind and body would interrupt the continuity of complicated processes of established learned skill-sets and well laid plans.  I began to identify strongly with the geriatric population and considered the possibility of dementia.\n\nIn addition, I recently discovered I had renal health concerns during this time period learning that my kidneys were “allergic’ to Hydrochlorothiazide.    I developed hypertension during this era of psychotropic medication changes and I was having an adverse reaction to this medication. I began to experience neurological twitching in my fingers, increased numbness and tingling coupled with flank pain and my GP abruptly dismissed me without listening to my concerns  stating I had somatoform disorder because I had a history of an eating disorder decades ago.\n\nPerhaps one of the most humiliating experiences was returning to the emergency room in the hospital where I was employed--for a second time--to describe these symptoms noted above and to state with transparency that these symptoms, as per my GP, were symptoms of somatoform disorder.  I was referred to a nephrologist who identified a legitimate health concern and who would soon adopt the same attitude as my GP. I became a renal patient that day.\n\nWith my medical notes obtained November 2016, I submitted a formal written  complaint to the College of Physicians and Surgeons in February 2017 regarding the psychiatric care received and this complaint went unheeded.   I received the psychiatrist’s response to my initial complaint after June 28, 2017, and the content of his response confirmed:\n\n* I was only provided with my transcribed medical charts and not given the handwritten medical charts when I requested my medical files in November 2016.\n* The prescribing psychiatrist did not refer to my medical charts  when inadvertently re-prescribing an ineffective medication for a second time in April 2014.\n\nReceipt of my handwritten medical charts in July 2017 reveal and support the notion that valid informed consent was never obtained or documented until April 2008 confirming my original query to the College of Physicians and Surgeons when I inquired “Why wouldn’t \\[the prescribing psychiatrist\\] discuss the side effects with me when I began taking Risperidone when he first prescribed the medication to me?”\n\nI was emotionally scattered after receiving the prescribing psychiatrist’s response and had recently been approved for long-term disability through my employer benefit package.   A series of negative interactions with healthcare professionals accelerated my determination to discontinue all psychotropic medications at this time. It was unsettling to observe a rheumatologist google the results of a pathology report of a recent skin biopsy after waiting months to see her and it was equally unsettling to have to request new bloodwork when a second nephrologist made reference to lab values from six months ago during a 6-month consult.   This same nephrologist would document that I had” discontinued all my medications with exception of oxazepam” underscoring my sense of “madness”. This nephrologist ordered new bloodwork, at my request, stating that a renal biopsy may be ordered if proteinuria and hematuria were present--and they were. I considered relocating to a larger city to receive healthcare realizing that all future health concerns would be met with familiar disdain within the small community I resided in.   \n\nI believed the continual proteinuria and hematuria was contributing to the physical symptoms I presented with and sought healthcare at the Mayo Clinic in Scottsdale, Arizona, November 2017.  My humble and pitiful admission of traveling to the Mayo Clinic indicates the continued presence of physical and psychological symptoms months after discontinuing psychotropic medications and my own vulnerable and determined quest for answers knowing that the symptoms I presented with began within a specific time frame. The distinct stigma  towards individuals with mental illness that I experienced in my hometown was all too prevalent at the Mayo Clinic in Scottsdale, Arizona. My body was changing and declining in so many ways and I felt helpless and isolated.\n\nI overlooked the advisement of the College of Physicians and Surgeons to provide any new facts “to be of particular significance to the issues at hand” regarding my complaint about the psychiatric care I received for over a decade after receipt of the prescribing psychiatrist’s response to my initial letter of complaint and inbetween obtaining the other half of my medical chart.  In addition, issues regarding abnormal lab values, disdainful healthcare professional attitudes, discontinuing medications and entertaining the idea of moving to a larger city also contributed to the oversight of the College’s advisement. I could see the inconsistencies in the psychiatric care I received but did not possess the means to articulate these inconsistencies with appropriate medical and legal language  nor could I present them in a timely manner. I am a team on one with limited time and resources.\n\nThe timing of listening to this academic conversation on CBC’s White Coat Black Art addressing and discussing the physical and psychological side effects individuals often experience from discontinuing an array of psychotropic medications on May 11, 2018 could not have presented at a more opportune time:   I was taking a lunch break from writing a “Statement of Points” to the Health Professions Review Board, at a local library in Vancouver, regarding the complaint I made to the College of Physicians and Surgeons of British Columbia concerning the care I received from the prescribing physician over the course of 10 years when I first listened to this podcast.  \n\nI believed the content of this CBC White Coat Black Art podcast so significant that I included the link to this podcast with subsequent links to  “When it comes to antidepressants, getting to zero proves difficult” by Dr. Goldman, “Many People taking Antidepressants Discover They Cannot Quit” by Benedict Carey and Robert Gebeloff of The New York Times,  and “Antidepressant Discontinuation Syndrome” by C. Warner and colleagues, in my Statement of Points to the Health Professions Review Board. I naively believed the Health Professions Review Board Panel would take the time to listen and consider the well researched and documented content of this CBC podcast that succinctly explains the source of the physical and psychological symptoms I endured for several years:  symptoms related to antipsychotic and psychotropic medications.\n\nThe Health Professions Review Board decision favoured the initial psychiatrist and reported that the documents I submitted “demonstrates that the Complainant is not a reliable historian and that she has demonstrated an unwillingness to accept a diagnosis or treatment that does not accord with her own view of her medical conditions as she understands them.”   \n\nMedical research and documentation relegated to medical textbooks in university and hospital libraries are now available online and it makes sense that I would search for corroborating medical knowledge to confirm that I endured numerous physical and psychological  side effects resulting from psychotropic medication changes. The evident holes in my medical charts reveal that informed consent was not obtained until I had become reliant on this medication’s sedating properties. Online research will continue as the well-known adverse effects from antipsychotic and antidepressant medications are now openly revealed and discussed on public platforms including radio and television in addition to internet sources.   To reiterate: I naively declared in my initial complaint to the College of Physicians and Surgeons that I began to experience many uncomfortable physical and emotional symptoms coinciding with a conscious attempt to discontinue Risperidone in 2012. These side effects were validated when listening to CBC and researching the numerous sources cited.\n\nMy original declaration was made without having obtained all my medical documentation and receipt of this documentation would confirm that I was not made aware of the irreversible side effects and difficulting discontinuing Risperidone when this medication was initially and subsequently prescribed until I addressed the issue of the inappropriate use of Risperidone as a chemical restraint in the elderly population in 2008.  The Panel Chair’s response to my review request minimizes the physical and psychological symptoms I experienced when attempting to discontinue Risperidone and the chemical psychotropic medication cycle perpetuated from this event for several years to follow. In addition, this response explicitly implies that the symptoms I experienced are a result of my own negligence placing the fault upon the psychiatric patient.\n\nThe personal nature of psychiatric treatment suggests that psychiatric patients are often emotionally and/or intellectually unstable and unreliable historians creating  invisible barriers hindering the vulnerable psychiatric patient’s ability to complain effectively about psychiatric care they have received. The invisible barriers intimidate, discourage and prevent the psychiatric patient from submitting  formal complaints against the psychiatric healthcare provider to appropriate governing bodies who dismiss their concerns favouring the psychiatric practitioner.\n\nI did not possess all the essential medical and legal language when formalizing my complaints to these governing bodies and their responses simply reiterate my mental illness history based upon the psychiatrist’s documentation stating I am an inaccurate historian rather than acknowledge that:  \n\n* I was not provided with half of my medical chart essential to ensure greater accuracy in describing the historical events in my initial complaint regarding care received over a 10-year period;\n* the withheld medical charts  indicates informed consent was not obtained during the first 4 years of care;\n* the prescriber neglected to refer to my medical chart prior to re-prescribing an ineffective psychotropic medication strongly suggesting that he, too, is an  inaccurate historian;\n* The combination of numerous psychotropic medication changes, beginning with initial prescription of Risperidone in 2004,  followed by numerous attempts to discontinue this medication in 2012 contributed to the numerous physical and psychological symptoms I would experience from years to come; and\n* the prescribing psychiatrist did not acknowledge the onset of exacerbated and unexplained symptoms as a result of psychotropic medication changes.\n\nAddressing my concerns to the College of Physicians and Surgeons of British Columbia and extending my complaint further to the Health Professions Review Board were ineffective.   On August 3, 2017, I registered a “Petition to the Court” in the Supreme Court of British Columbia to set aside decisions made my the Health Professions Review Board and The College of Physicians and Surgeons  with the intent of remitting the matter back to the College of Physicians and Surgeons. I have enclosed a copy of the “Petition to the Court” for your perusal.\n\nThe barriers I experienced in registering this Petition were many and it’s contents may appear simple, naive, and lacking in both legal and medical expertise.\n\nI have cited and listed the same documentation I had provided electronic links to for the Health Professions Review Board to examine in an affidavit to “Petition to the Court”  from the CBC White Coat Black Art podcast that aired May 11, 2018. Some of the documents cited as evidence affirm that knowledge of the physical and psychological symptoms attributed to discontinuing antipsychotic and antidepressant medications has been known for decades and should have been acknowledged by the initial prescriber of Risperidone.   I would have also cited Dr. Richard Friedman’s article “A Call for Caution in the Use of Antipsychotic Drugs” had I been permitted to submit additional documentation.\n\nI exercise respect when stating that I am not physician, a psychiatrist or a lawyer.  I am an individual, a middle-aged woman, a caregiver, and a patient with a history of mental illness who encountered numerous obstacles and barriers necessitating tenacity in attempting to access the legal system independently when others would simply submit and accept to living with the same “conditions” believing themselves powerless, feeling voiceless and invisible.  \n\nThe dismissive, and often humiliating, incidents I experienced from healthcare professionals occuring while under the care of the initial prescribing psychiatrist continued even after ending this patient/psychiatrist relationship.  These incidents are not the primary issue in my legal suit requesting the Supreme Court of British Columbia to quash the Health Professions Review Board and College of Physicians and Surgeons’ decisions in favour of the initial psychiatrist; rather, these incidents were a manifestation of preconceived notions and stigmatic beliefs towards individuals with mental illness attempting to reclaim their mental wellness and serve to underscore the necessity for transparency between psychiatrist and patient.  There is a defined series of events that transpired when I attempted to discontinue Risperidone in late 2012: a\n\nmedication I continued to request higher doses of without being informed of the potential irreversible side effects and the difficulting in discontinuing this medication.  These events continued to undermine any legitimate health concerns I presented with in the small city I resided in and have affected the care and a diagnosis I received from a healthcare practitioner in the metropolis I currently reside in.  It is fortunate that I acquire a GP here who is both an academic and a scientist. Dare I say, these events may not have occurred had I been given sufficient information to make an informed choice about the nature of Risperidone in 2004 when this medication was quickly prescribed in the final minutes of a 30 minute consult.  \n\nI suspect that the initial prescribing psychiatrist recognized that the harm of his actions, or lack of actions, would require significant explanation and psychiatric care reflecting poorly upon him and his position in authority  within a small healthcare community. In addition, it was less problematic for him, and perhaps somewhat of a relief, when I sought alternative mental healthcare after losing faith in his abilities.\n\nThe difficulty I experienced discontinuing Risperidone and subsequent psychotropic medications mirrors similar difficulties other patients have experienced exemplifying the “Elephant in the Room” idiom:  The difficulty discontinuing psychotropic medications, including the “powerful” Risperidone, is an undesirable fact that remained unaddressed and ignored until reputable sources such as CBC and The New York Times presented this serious problem identifying the physical and emotional symptoms patients have experienced and their vain attempts to discontinue these medications only to experience failure and to have these symptoms attributed to their declining  mental illness. I believe I have a legitimate complaint regarding the psychiatric care I received from 2004-2014 in that the prescribing psychiatrist and university professor had an understanding that I was physically and psychologically struggling to discontinue Risperidone and various psychotropic medications trialled when he prescribed Nabilone for pain. Prescribing a medication without obtaining informed consent and re-prescribing an ineffective medication in error only compounds the harm done by not identifying the disturbing symptoms I began to experience in 2012 when I attempted to discontinue Risperidone.     \n\nRelocating to a larger city for healthcare has revealed that I have “thin basement membrane disease”, a renal aneurysm and a grade 2 rectocele in a relatively kind, emotionally “safe” and “patient” medical environment.  Food has not been an issue for several years and this fact, in isolation, is emancipating. I take less analgesic and continue to live with intermittent pain, headaches, GI concerns and hypertension coupled with numbness and tingling that began during my “journey”.   I struggle at times with a misaligned circadian rhythm and my sleep quality, for the most part, is moderate and I have been advised not to work nights shifts again. I long to be able to take that satisfying and re-energizing 20 minute midday nap that has been unattainable since discontinuing psychotropic medication well over a year ago.  My cognition has evolved and matured since my initial complaint to the College in February 2017 regarding the psychiatric care I received for more than a decade and I can define my concerns with greater clarity.\n\nI recognize and even expect that my description of events may be, yet again, dismissed as a result of mental illness contributing to medical, scientific or unkind comments regarding my emotional demeanor.  After all, I am a psychiatric patient and psychiatric patients are poor historians.\n\nThe issues of mechanically prescribing powerful psychotropic medications, such as Risperidone, without providing adequate medication information in a manner easily understood by patients,  medical complacency in continuous prescribing of large doses of psychotropic medications without inquiring into the patient’s logic and reasoning for their non-compliance, re-prescribing ineffective psychotropic medication without referring to a patient’s medication history and not identifying and associating the onset of increased or new symptoms with psychotropic medication changes need to be addressed in a medical culture that often corrects emotional maladies with a pill.    \n\n My mental health history clearly indicates the desire to discontinue the psychotropic medication Risperidone and I was prescribed this medication without appropriate medication information. These facts coupled with experiencing the onset and continuation of very uncomfortable  physical and psychological symptoms when attempting to discontinue Risperidone with insufficient support was both socially and medically undermining marking the beginning of sad and stressful chapter in my life that I look forward to closing. Resiliency should not be this difficult.\n\nIn conclusion, this journey has been one of isolation coupled with fears of being ostracized for burdening others with my concerns and linked hand-in-hand with suggestions and explicit statements that I was a burden, a waste of time, while attempting to have some of the physical and psychological symptoms I experienced from psychotropic medication changes addressed.  I simply state that my journey has consisted of a series of experiences that have negatively impacted my physical and psychological well-being. I am apprehensive, yet clearly in need of returning to meaningful employment. My thoughts are more clear and I recognize I have been provided with the gift of time and the opportunity to share my concerns with you and to register  these concerns with the Supreme Court of British Columbia. As mentioned previously, the tone of this letter is written calmly and is meant to be read and interpreted in this manner and I hope to maintain this demeanour when I present to the Supreme Court.\n\nI have encountered many individuals who feel this endeavour will fail; however, the attempt has been made, the concerns addressed and the event recorded for others to follow as the inconvenient truths about psychotropic medications are revealed.\n\nI am presently unsure of how to reestablish a life with purpose and self-worth and trust I will continue to recognize and acknowledge unexpected events as opportunities to reclaim my mental wellness in a new journey towards self-discovery.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Drugs", "subreddit_id": "t5_2qh7l", "subreddit_subscribers": 460178, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "ANTIPSYCHOTICS AND ANTIDEPRESSANTS", "url": "https://www.reddit.com/r/Drugs/comments/9q0jys/antipsychotics_and_antidepressants/", "whitelist_status": "no_ads", "wls": 0}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540092496, "domain": "self.Antipsychiatry", "full_link": "https://www.reddit.com/r/Antipsychiatry/comments/9q0gs4/the_inconvenient_truth_about_antipsychotic_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9q0gs4", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "permalink": "/r/Antipsychiatry/comments/9q0gs4/the_inconvenient_truth_about_antipsychotic_and/", "pinned": false, "retrieved_on": 1540092497, "score": 1, "selftext": "# \n\n**I am searching for individuals in Canada who have experienced the same debilitating side effects and withdrawal effects from being prescribed antipsychotic mediations and other psychotropic medications with the intentions of approaching CBC to propose an investigation into the complacent prescribing of these medications and the destructive aftermath of taking these medications.**\n\n**The text below is a \"condensed\" letter I wrote to the Canadian Association of Mental Health (and others) describing my disturbing, perpetual \"journey\" on psychotropic medications.**\n\n**The complaint process was difficult in that I had not completely discontinued all psychotropic medications and was \"scattered\" missing an opportunity to address additional concerns regarding the prescribing psychiatrist. As psychiatric patients, we are often psychologically and physically vulnerable to the medications we are prescribed and the assumption is that we will be taking psychotropic medications for a lifetime and will never be \"cured\".**\n\n**Respectfully, as a woman who works in health care, I know that there is a population of individuals that benefit from these medications and will have to take psychotropic medications for their lifetime. Please understand that I am not critical or judgemental of these healthcare scenarios.**\n\nThe purpose in sharing the exhausting, and often consuming, chemical psychotropic medication cycle that affected my reality  is to highlight the consequences of mechanically prescribing psychotropic medications, such as Risperidone, and the associated, and often disconcerting symptoms patients experience when these medications are changed or discontinued.  Ill advised, I found myself running from one medication to another with the development of each new and troubling symptom contributing to increased physical and emotional discord. My quest for answers was “frantic” as my body and mind failed me.  To my detriment, this “franticness” was witnessed by the prescribing psychiatrist and a host of other healthcare professionals leaving a permanent impression of madness that is not easily erased.\n\nListening to CBC radio and reviewing this conversation online provided links to numerous studies conducted and documented by reputable sources confirming my initial belief that many of the physical and psychological symptoms I endured over a 5 year period were primarily from psychotropic medication dosage changes, switching from one medication to another, discontinuing these medications completely and the painful emotions from having many of my concerns dismissed with condescension and evident irritability within a small healthcare community.   I would find myself being labeled as a difficult patient and diagnosed with numerous psychiatric syndromes I had never been associated with in the past.\n\nI have a history of an eating disorder decades ago and received treatment at the Toronto General Hospital for 14 weeks beginning in January 1988.   I experienced decreased, yet intermittent binging after receiving care at Toronto General Hospital. I found myself moving to a smaller city to be closer to my ”distant”  father in September 2003 and obtained an unreliable casual cashier position at a local hardware store. I arrived with a small supply of the antidepressant Prozac and considered discontinuing this medication when the supply was exhausted.  My attempt to discontinue Prozac was unsuccessful and I was referred to a psychiatrist in March 2004.\n\nThe prescribing psychiatrist has a private psychiatric practice with full privileges at the local hospital, staffs an outpatient rapid response clinic and is also a clinical assistant professor specializing in mood and anxiety disorders at a reputable university typicalling seeing approximately 700 patients per year since 1997.  These credentials suggest a mental health care professional with significant knowledge of the vast and diverse psychotropic medications he prescribes to hundreds of his patients on day to day basis.\n\nI was prescribed a different antidepressant in March 2004 that was later determined ineffective and replaced with the “familiar” Prozac  in August 2004. I was then prescribed Risperidone in September 2004 to augment the Prozac for depression. I was not aware that benefits of Prozac required time to be achieved.  I returned to this psychiatrist’s office requesting higher and higher doses of Risperidone on three separate occasions specifically for this medication’s sedating properties and I was never advised of the potential irreversible side effects of Risperidone and the difficulty discontinuing this medication when this medication was first initiated and with each subsequent requested dosage increase.  \n\nLiterature reports that many patients will not experience the full benefit of antidepressants therapy immediately and the benefits may take as long as 8 weeks.  Perhaps Risperidone would never have been prescribed had I waited the course till the full benefits of Prozac therapy were achieved; and, conceivably, I could still be taking Prozac today.  \n\nI addressed my concerns about taking Risperidone with the prescribing psychiatrist in April 2008 when I discovered this medication was utilized as a chemical restraint in the elderly population with dementia often presenting with difficult behaviours.  I did not want to take Risperidone after this discovery yet believed the prescribing psychiatrist--a paternal-like figure--”must know best”. I was both shy and timid when addressing my concerns about taking Risperidone only to end up being “in agreement” with current psychotropics or advised to trial another antipsychotic such as Invega.  I opted not to trial Invega. I felt the onus of seeking alternatives to Risperidone fall upon my shoulders and my role in health care was insignificant when compared to the role of psychiatrist. I felt very unsupported.\n\nA typical prescription would read Prozac 80-120mg and Risperdal 2-4mg or simply Prozac 120mg and Risperdal 4mg.  The prescribing psychiatrist documented that I often reduced both medications and, at one time, reduced the Prozac dosage as low a 20mg documenting “relapse” without ever investigating the purpose of my non-compliance.    In addition, my medical charts reveal that a pharmacy had contacted the prescribing psychiatrist asking if they should fill an expired prescription for Risperidone and Prozac as I had reported having accumulated a surplus of medication.  The prescription was filled and the prescriber made no inquiry into the surplus or stockpile of medication I had acquired or the notion of noncompliance. This lack of inquiry hindered the development of a therapeutic relationship that was never really initiated.  \n\nThe antipsychotic medications began to change in late 2012:  from Risperidone to Quetiapine, back to Risperidone *and* Quetiapine, to Trazodone, to Trazodone and Quetiapine and this chemical psychotropic medication cycle  would continue to negatively affect my physical and psychological wellness in such profound ways leading me to believe that other psychotropic medications were ineffective contributing to increased medication changes perpetuating physical harm and psychological chaos for several years to follow.   Unbeknownst to me, I would begin an era fraught with somatic symptoms including increased body pain query fibromyalgia, fatigue, skin rashes, gastrointestinal issues query irritable bowel syndrome, nausea, numbness and tingling, cognitive decline, increased anxiety (GAD), ADHD, fatigue and insomnia coupled with numerous psychiatric labels that I can not seem to escape.   The newly acquired psychiatric labels assigned to me based upon the symptoms I presented with were perhaps the most harmful and destructive eroding my self- esteem and self-confidence in tasks that I had become proficient in.\n\nInsomnia developed when Quetiapine replaced Risperidone and I began to struggle with the demands of shift work where I was required to work within a team environment in a role to care for others.   I would later return to the more “powerful” Risperidone. The prescribing psychiatrist documents in my medical charts that I “did not find the Seroquel as helpful as the Risperdal, and decided to go back on the Risperdal, in addition to continuing on the Seroquel.  She was aware of the increased risk of TD \\[Tardive Dyskinesia\\] by making the decision to go back on the Risperdal, in comparison to remaining solely on Seroquel”. The irony in this statement is that I would not have found myself in that uncomfortable predicament of having to choose between one antipsychotic over another antipsychotic--Risperidone or Seroquel--had the prescribing psychiatrist obtained valid informed consent when the medication was initiated in September 2004.   I propose this example of thorough documentation of informed consent is to avoid blame or responsibility for the prescribing psychiatrist’s failure to obtain informed consent when initially prescribing Risperidone and with subsequent dosage increases in the past.\n\nIn addition,   I had to have older breast implants removed at the hospital I was employed at in 2013 and anticipated discontinuing Risperidone close to the surgery date. I was quite content with my body image in my early 50’s and opted for a simple explantation without additional cosmetic surgery and I had  established very satisfying and financially rewarding employment allowing me to reduce my mortgage significantly.\n\nThe unexpected and coincidental removal of ruptured and encapsulated silicone breast implants in  2013 coupled with the current-day controversy surrounding silicone breast implants at that time contributed to an even greater sense of confusion within me as I began to experience the host of challenging physical and psychological symptoms .  There is a specific group of individuals consisting primarily or women who believe that silicone breast implants and silicone products are harmful and contribute to numerous physical and psychological health concerns including breast implant-associated anaplastic large cell lymphoma.  \n\nI knew enough to recognize the onset of the symptoms I experienced presented quickly but I could not determine if the symptoms were from psychotropic medication changes, psychotropic medication discontinuation or from 28 year old ruptured silicone breast implants.  I was confused and with increased anxiety I asked the prescribing psychiatrist if any of my pain could be contributed to various psychotropic medications and their corresponding changes. His response was “Not to my knowledge”. There is sufficient documentation regarding the onset of the physical and psychological symptoms experienced in my medical notes from my local walk-in medical clinic; a medical clinic  that would abruptly dismiss my concerns only to discover that genuine health concerns existed. I vividly recall a physician in this medical clinic, with great annoyance, attempt to convince me that I had a complex chronic disease by utilizing a “tick-in-the-box” symptom checker sheet.\n\nLoss of respect and faith in this medical clinic eventually replaced the painful feelings of being identified as a difficult and undesirable patient.  \n\nMy coping skills diminished quickly with the numerous psychotropic medication changes originating from a conscious and documented attempt to discontinue Risperidone in 2012 leading me to believe that the Prozac I had taken since the late 1998 was no longer effective.  I inquired about the efficacy of Prozac when taken for extended periods of time and the prescriber psychiatrist could not comment so I requested to switch to another antidepressant in April 2014. My ability to concentrate at work declined significantly as I began to soil myself with increasing frequency and I felt I had to  transfer from an acute care position consisting of shiftwork that I truly loved to a disappointing and unsupportive part time position is residential care due to the unpredictability of my bowels. I was overwhelmed when, to use medical terminology, I was incontinent of a large loose, liquid BM in Walmart. This fecal incontinence affected my ability to manage at work and in daily life and I sought more frequent psychiatric counsel.   The prescribing psychiatrist was unable to connect the increased loose fecal incontinence I experienced with the medication he prescribed in April 2014 until late August 2014. The prescribing psychiatrist suggested I consider the plant-based Vegan diet and implied that the “aging process” may be contributing to my physical symptoms. These symptoms exacerbated any mood disorder I may have had contributing to increased anxiety, depression and  isolation coupled with feelings complete helplessness.\n\nThe prescribing psychiatrist did not consider a differential diagnosis and review the various psychotropic medication changes prescribed, beginning with Risperidone, as potential sources to the numerous side effects presented.  I would learn years later that the medication causing fecal incontinence prescribed in April 2014 had been prescribed and deemed ineffective a decade earlier in 2004 and the prescribing psychiatrist neglected to refer to my medical charts when inadvertently re-prescribing this medication for a second time.  \n\nI was very afraid as my mind and body began to fail me.  The physical and psychological symptoms escalated and I called 811 in August 2014 and was advised to go to the emergency department in the hospital where I work.  Emergency physicians often refer to a medication databank listing the patient’s dispensed medications to develop an understanding into the patient’s medical history and to gain potential insight into the cause of patient’s primary complaint leading to an emergency visit.    My medication databank (Pharmanet) listed numerous and various psychotropic medications dispensed over several months and I was “hurt” to hear the emergency physician state that I was wasting his time during this isolated visit in August 2014. Thoughtless and disparaging  comments and attitudes towards individuals with mental illness are common in the healthcare profession; a profession that should display more tolerance towards individuals with mental illness. Individuals holding positions of authority in healthcare should choose to be positive role models for others and lead by example.  The emergency physician’s statement clearly implied I was a burden and this notion would be reinforced by health care professionals in my community for years to come serving to exacerbate any struggles I may have had with depression and anxiety.\n\nI have been privy to many conversations regarding challenging patients and I regretfully admit to participating in some of these conversations.   I distinctly recall caring for two women known throughout the healthcare facility as being demanding and unreasonable and it became difficult for me to care for them “burdened” with the notion that I too, could be one them.  To my surprise, one of these women was transferred to the local hospice facility for end-of-life care and I felt a sense of guilt as I watched her mobilize to the hospice dinner table.\n\nI terminated my relationship with the prescribing psychiatrist of 10 years, from March 2004 to September 2014, and received chastising comments for my actions  from my GP at the time. My GP’s disapproval instilled feelings of guilt and the need for me to make amends by sending a 2014 Christmas card to the prescribing psychiatrist.\n\nI would connect with a new psychiatrist December 2014 and she suggested the mainstay of treatment should be psychotherapeutic in nature describing the purpose of this treatment format and how I would benefit from such treatment.  I am saddened to read of the individual I had become as described in the “new” initial psychiatric assessment in December 2014. The negative experiences from psychotropic medication changes, discontinuing psychotropic medication and with healthcare professionals contributed to feeling “like she is constantly being judged...she is afraid of being humiliated by others...she struggles with feeling like a fraud and that they can see her dysfunction...and is worried that her co-workers can see it in her”.  In addition, this initial consult reports “chronic pain in her arms, shoulders, chest, through her legs for the last year and a half and has seen doctors who believe it might be fibromyalgia...there are chronic gastrointestinal symptoms with a possible diagnosis of Irritable Bowel Syndrome...her thought content was significant for decreased self-worth and she spoke about herself with quite disgust and shame”.\n\nI had finally discontinued all psychotropic medications with the exception of a small dose of Oxazepam for sleep for well over a year when I first listened to this particular CBC White Coat Black Art podcast in May 2018.  This podcast and corresponding website providing links to reputable academic sources strongly suggests that pertinent information regarding patient safety and the physical and psychological side effects related to psychotropic medication changes has been known, present and available for decades.    I find myself wondering why the prescribing psychiatrist, with all of his credentials, did not consider the various medication changes as the source for the exacerbation of physical and psychiatric symptoms and the onset of new symptoms I presented with. In hindsight, perhaps it is possible that the prescribing psychiatrist did suspect that some of my  symptoms were related to psychotropic medication changes when he prescribed Nabilone for pain; he just never articulated his suspicions to me or the healthcare providers at my local walk-in medical clinic.\n\nIn November 2016 I requested my medical notes from the psychiatrist who initiated the course of Risperidone more than twelve years ago  with the intent of complaining to the College of Physicians and Surgeons after caring for an elderly woman who was prescribed levodopa/carbidopa three times a day.   Many patients are prescribed levodopa/carbidopa yet there was no mention of this woman having Parkinson’s disease during shift report. It was discovered this woman presented with Parkinsonian symptoms as a result of taking Olanzapine for several decades.     I could be this woman 20 years from now. This woman was later diagnosed with Stickman’s Disease by the local neurologist.\n\nI continued to struggle with the physical and psychological symptoms that began  when I attempted to discontinue Risperidone in 2012. I had been diagnosed with ADHD the previous year and the physical and psychological  symptoms persisted affecting my ability to focus and concentrate contributing to feelings of increased confusion and self-doubt. Equally disabling is the the ADHD diagnosis/label itself.  I now understand that I have lived with the same brain my whole life but I became fearful of ADHD’s presence with increased incidents of forgetfulness when racing thoughts regarding my failing mind and body would interrupt the continuity of complicated processes of established learned skill-sets and well laid plans.  I began to identify strongly with the geriatric population and considered the possibility of dementia.\n\nIn addition, I recently discovered I had renal health concerns during this time period learning that my kidneys were “allergic’ to Hydrochlorothiazide.    I developed hypertension during this era of psychotropic medication changes and I was having an adverse reaction to this medication. I began to experience neurological twitching in my fingers, increased numbness and tingling coupled with flank pain and my GP abruptly dismissed me without listening to my concerns  stating I had somatoform disorder because I had a history of an eating disorder decades ago.\n\nPerhaps one of the most humiliating experiences was returning to the emergency room in the hospital where I was employed--for a second time--to describe these symptoms noted above and to state with transparency that these symptoms, as per my GP, were symptoms of somatoform disorder.  I was referred to a nephrologist who identified a legitimate health concern and who would soon adopt the same attitude as my GP. I became a renal patient that day.\n\nWith my medical notes obtained November 2016, I submitted a formal written  complaint to the College of Physicians and Surgeons in February 2017 regarding the psychiatric care received and this complaint went unheeded.   I received the psychiatrist’s response to my initial complaint after June 28, 2017, and the content of his response confirmed:\n\n* I was only provided with my transcribed medical charts and not given the handwritten medical charts when I requested my medical files in November 2016.\n* The prescribing psychiatrist did not refer to my medical charts  when inadvertently re-prescribing an ineffective medication for a second time in April 2014.\n\nReceipt of my handwritten medical charts in July 2017 reveal and support the notion that valid informed consent was never obtained or documented until April 2008 confirming my original query to the College of Physicians and Surgeons when I inquired “Why wouldn’t \\[the prescribing psychiatrist\\] discuss the side effects with me when I began taking Risperidone when he first prescribed the medication to me?”\n\nI was emotionally scattered after receiving the prescribing psychiatrist’s response and had recently been approved for long-term disability through my employer benefit package.   A series of negative interactions with healthcare professionals accelerated my determination to discontinue all psychotropic medications at this time. It was unsettling to observe a rheumatologist google the results of a pathology report of a recent skin biopsy after waiting months to see her and it was equally unsettling to have to request new bloodwork when a second nephrologist made reference to lab values from six months ago during a 6-month consult.   This same nephrologist would document that I had” discontinued all my medications with exception of oxazepam” underscoring my sense of “madness”. This nephrologist ordered new bloodwork, at my request, stating that a renal biopsy may be ordered if proteinuria and hematuria were present--and they were. I considered relocating to a larger city to receive healthcare realizing that all future health concerns would be met with familiar disdain within the small community I resided in.   \n\nI believed the continual proteinuria and hematuria was contributing to the physical symptoms I presented with and sought healthcare at the Mayo Clinic in Scottsdale, Arizona, November 2017.  My humble and pitiful admission of traveling to the Mayo Clinic indicates the continued presence of physical and psychological symptoms months after discontinuing psychotropic medications and my own vulnerable and determined quest for answers knowing that the symptoms I presented with began within a specific time frame. The distinct stigma  towards individuals with mental illness that I experienced in my hometown was all too prevalent at the Mayo Clinic in Scottsdale, Arizona. My body was changing and declining in so many ways and I felt helpless and isolated.\n\nI overlooked the advisement of the College of Physicians and Surgeons to provide any new facts “to be of particular significance to the issues at hand” regarding my complaint about the psychiatric care I received for over a decade after receipt of the prescribing psychiatrist’s response to my initial letter of complaint and inbetween obtaining the other half of my medical chart.  In addition, issues regarding abnormal lab values, disdainful healthcare professional attitudes, discontinuing medications and entertaining the idea of moving to a larger city also contributed to the oversight of the College’s advisement. I could see the inconsistencies in the psychiatric care I received but did not possess the means to articulate these inconsistencies with appropriate medical and legal language  nor could I present them in a timely manner. I am a team on one with limited time and resources.\n\nThe timing of listening to this academic conversation on CBC’s White Coat Black Art addressing and discussing the physical and psychological side effects individuals often experience from discontinuing an array of psychotropic medications on May 11, 2018 could not have presented at a more opportune time:   I was taking a lunch break from writing a “Statement of Points” to the Health Professions Review Board, at a local library in Vancouver, regarding the complaint I made to the College of Physicians and Surgeons of British Columbia concerning the care I received from the prescribing physician over the course of 10 years when I first listened to this podcast.  \n\nI believed the content of this CBC White Coat Black Art podcast so significant that I included the link to this podcast with subsequent links to  “When it comes to antidepressants, getting to zero proves difficult” by Dr. Goldman, “Many People taking Antidepressants Discover They Cannot Quit” by Benedict Carey and Robert Gebeloff of The New York Times,  and “Antidepressant Discontinuation Syndrome” by C. Warner and colleagues, in my Statement of Points to the Health Professions Review Board. I naively believed the Health Professions Review Board Panel would take the time to listen and consider the well researched and documented content of this CBC podcast that succinctly explains the source of the physical and psychological symptoms I endured for several years:  symptoms related to antipsychotic and psychotropic medications.\n\nThe Health Professions Review Board decision favoured the initial psychiatrist and reported that the documents I submitted “demonstrates that the Complainant is not a reliable historian and that she has demonstrated an unwillingness to accept a diagnosis or treatment that does not accord with her own view of her medical conditions as she understands them.”   \n\nMedical research and documentation relegated to medical textbooks in university and hospital libraries are now available online and it makes sense that I would search for corroborating medical knowledge to confirm that I endured numerous physical and psychological  side effects resulting from psychotropic medication changes. The evident holes in my medical charts reveal that informed consent was not obtained until I had become reliant on this medication’s sedating properties. Online research will continue as the well-known adverse effects from antipsychotic and antidepressant medications are now openly revealed and discussed on public platforms including radio and television in addition to internet sources.   To reiterate: I naively declared in my initial complaint to the College of Physicians and Surgeons that I began to experience many uncomfortable physical and emotional symptoms coinciding with a conscious attempt to discontinue Risperidone in 2012. These side effects were validated when listening to CBC and researching the numerous sources cited.\n\nMy original declaration was made without having obtained all my medical documentation and receipt of this documentation would confirm that I was not made aware of the irreversible side effects and difficulting discontinuing Risperidone when this medication was initially and subsequently prescribed until I addressed the issue of the inappropriate use of Risperidone as a chemical restraint in the elderly population in 2008.  The Panel Chair’s response to my review request minimizes the physical and psychological symptoms I experienced when attempting to discontinue Risperidone and the chemical psychotropic medication cycle perpetuated from this event for several years to follow. In addition, this response explicitly implies that the symptoms I experienced are a result of my own negligence placing the fault upon the psychiatric patient.\n\nThe personal nature of psychiatric treatment suggests that psychiatric patients are often emotionally and/or intellectually unstable and unreliable historians creating  invisible barriers hindering the vulnerable psychiatric patient’s ability to complain effectively about psychiatric care they have received. The invisible barriers intimidate, discourage and prevent the psychiatric patient from submitting  formal complaints against the psychiatric healthcare provider to appropriate governing bodies who dismiss their concerns favouring the psychiatric practitioner.\n\nI did not possess all the essential medical and legal language when formalizing my complaints to these governing bodies and their responses simply reiterate my mental illness history based upon the psychiatrist’s documentation stating I am an inaccurate historian rather than acknowledge that:  \n\n* I was not provided with half of my medical chart essential to ensure greater accuracy in describing the historical events in my initial complaint regarding care received over a 10-year period;\n* the withheld medical charts  indicates informed consent was not obtained during the first 4 years of care;\n* the prescriber neglected to refer to my medical chart prior to re-prescribing an ineffective psychotropic medication strongly suggesting that he, too, is an  inaccurate historian;\n* The combination of numerous psychotropic medication changes, beginning with initial prescription of Risperidone in 2004,  followed by numerous attempts to discontinue this medication in 2012 contributed to the numerous physical and psychological symptoms I would experience from years to come; and\n* the prescribing psychiatrist did not acknowledge the onset of exacerbated and unexplained symptoms as a result of psychotropic medication changes.\n\nAddressing my concerns to the College of Physicians and Surgeons of British Columbia and extending my complaint further to the Health Professions Review Board were ineffective.   On August 3, 2017, I registered a “Petition to the Court” in the Supreme Court of British Columbia to set aside decisions made my the Health Professions Review Board and The College of Physicians and Surgeons  with the intent of remitting the matter back to the College of Physicians and Surgeons. I have enclosed a copy of the “Petition to the Court” for your perusal.\n\nThe barriers I experienced in registering this Petition were many and it’s contents may appear simple, naive, and lacking in both legal and medical expertise.\n\nI have cited and listed the same documentation I had provided electronic links to for the Health Professions Review Board to examine in an affidavit to “Petition to the Court”  from the CBC White Coat Black Art podcast that aired May 11, 2018. Some of the documents cited as evidence affirm that knowledge of the physical and psychological symptoms attributed to discontinuing antipsychotic and antidepressant medications has been known for decades and should have been acknowledged by the initial prescriber of Risperidone.   I would have also cited Dr. Richard Friedman’s article “A Call for Caution in the Use of Antipsychotic Drugs” had I been permitted to submit additional documentation.\n\nI exercise respect when stating that I am not physician, a psychiatrist or a lawyer.  I am an individual, a middle-aged woman, a caregiver, and a patient with a history of mental illness who encountered numerous obstacles and barriers necessitating tenacity in attempting to access the legal system independently when others would simply submit and accept to living with the same “conditions” believing themselves powerless, feeling voiceless and invisible.  \n\nThe dismissive, and often humiliating, incidents I experienced from healthcare professionals occuring while under the care of the initial prescribing psychiatrist continued even after ending this patient/psychiatrist relationship.  These incidents are not the primary issue in my legal suit requesting the Supreme Court of British Columbia to quash the Health Professions Review Board and College of Physicians and Surgeons’ decisions in favour of the initial psychiatrist; rather, these incidents were a manifestation of preconceived notions and stigmatic beliefs towards individuals with mental illness attempting to reclaim their mental wellness and serve to underscore the necessity for transparency between psychiatrist and patient.  There is a defined series of events that transpired when I attempted to discontinue Risperidone in late 2012: a\n\nmedication I continued to request higher doses of without being informed of the potential irreversible side effects and the difficulting in discontinuing this medication.  These events continued to undermine any legitimate health concerns I presented with in the small city I resided in and have affected the care and a diagnosis I received from a healthcare practitioner in the metropolis I currently reside in.  It is fortunate that I acquire a GP here who is both an academic and a scientist. Dare I say, these events may not have occurred had I been given sufficient information to make an informed choice about the nature of Risperidone in 2004 when this medication was quickly prescribed in the final minutes of a 30 minute consult.  \n\nI suspect that the initial prescribing psychiatrist recognized that the harm of his actions, or lack of actions, would require significant explanation and psychiatric care reflecting poorly upon him and his position in authority  within a small healthcare community. In addition, it was less problematic for him, and perhaps somewhat of a relief, when I sought alternative mental healthcare after losing faith in his abilities.\n\nThe difficulty I experienced discontinuing Risperidone and subsequent psychotropic medications mirrors similar difficulties other patients have experienced exemplifying the “Elephant in the Room” idiom:  The difficulty discontinuing psychotropic medications, including the “powerful” Risperidone, is an undesirable fact that remained unaddressed and ignored until reputable sources such as CBC and The New York Times presented this serious problem identifying the physical and emotional symptoms patients have experienced and their vain attempts to discontinue these medications only to experience failure and to have these symptoms attributed to their declining  mental illness. I believe I have a legitimate complaint regarding the psychiatric care I received from 2004-2014 in that the prescribing psychiatrist and university professor had an understanding that I was physically and psychologically struggling to discontinue Risperidone and various psychotropic medications trialled when he prescribed Nabilone for pain. Prescribing a medication without obtaining informed consent and re-prescribing an ineffective medication in error only compounds the harm done by not identifying the disturbing symptoms I began to experience in 2012 when I attempted to discontinue Risperidone.     \n\nRelocating to a larger city for healthcare has revealed that I have “thin basement membrane disease”, a renal aneurysm and a grade 2 rectocele in a relatively kind, emotionally “safe” and “patient” medical environment.  Food has not been an issue for several years and this fact, in isolation, is emancipating. I take less analgesic and continue to live with intermittent pain, headaches, GI concerns and hypertension coupled with numbness and tingling that began during my “journey”.   I struggle at times with a misaligned circadian rhythm and my sleep quality, for the most part, is moderate and I have been advised not to work nights shifts again. I long to be able to take that satisfying and re-energizing 20 minute midday nap that has been unattainable since discontinuing psychotropic medication well over a year ago.  My cognition has evolved and matured since my initial complaint to the College in February 2017 regarding the psychiatric care I received for more than a decade and I can define my concerns with greater clarity.\n\nI recognize and even expect that my description of events may be, yet again, dismissed as a result of mental illness contributing to medical, scientific or unkind comments regarding my emotional demeanor.  After all, I am a psychiatric patient and psychiatric patients are poor historians.\n\nThe issues of mechanically prescribing powerful psychotropic medications, such as Risperidone, without providing adequate medication information in a manner easily understood by patients,  medical complacency in continuous prescribing of large doses of psychotropic medications without inquiring into the patient’s logic and reasoning for their non-compliance, re-prescribing ineffective psychotropic medication without referring to a patient’s medication history and not identifying and associating the onset of increased or new symptoms with psychotropic medication changes need to be addressed in a medical culture that often corrects emotional maladies with a pill.    \n\n My mental health history clearly indicates the desire to discontinue the psychotropic medication Risperidone and I was prescribed this medication without appropriate medication information. These facts coupled with experiencing the onset and continuation of very uncomfortable  physical and psychological symptoms when attempting to discontinue Risperidone with insufficient support was both socially and medically undermining marking the beginning of sad and stressful chapter in my life that I look forward to closing. Resiliency should not be this difficult.\n\nIn conclusion, this journey has been one of isolation coupled with fears of being ostracized for burdening others with my concerns and linked hand-in-hand with suggestions and explicit statements that I was a burden, a waste of time, while attempting to have some of the physical and psychological symptoms I experienced from psychotropic medication changes addressed.  I simply state that my journey has consisted of a series of experiences that have negatively impacted my physical and psychological well-being. I am apprehensive, yet clearly in need of returning to meaningful employment. My thoughts are more clear and I recognize I have been provided with the gift of time and the opportunity to share my concerns with you and to register  these concerns with the Supreme Court of British Columbia. As mentioned previously, the tone of this letter is written calmly and is meant to be read and interpreted in this manner and I hope to maintain this demeanour when I present to the Supreme Court.\n\nI have encountered many individuals who feel this endeavour will fail; however, the attempt has been made, the concerns addressed and the event recorded for others to follow as the inconvenient truths about psychotropic medications are revealed.\n\nI am presently unsure of how to reestablish a life with purpose and self-worth and trust I will continue to recognize and acknowledge unexpected events as opportunities to reclaim my mental wellness in a new journey towards self-discovery.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Antipsychiatry", "subreddit_id": "t5_2to28", "subreddit_subscribers": 1884, "subreddit_type": "public", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH ABOUT ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS. :", "url": "https://www.reddit.com/r/Antipsychiatry/comments/9q0gs4/the_inconvenient_truth_about_antipsychotic_and/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540091880, "domain": "self.Antipsychiatry", "full_link": "https://www.reddit.com/r/Antipsychiatry/comments/9q0edf/the_inconvenient_truth_about_antipsychotics_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9q0edf", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/Antipsychiatry/comments/9q0edf/the_inconvenient_truth_about_antipsychotics_and/", "pinned": false, "retrieved_on": 1540091881, "score": 1, "selftext": "r/[https://www.reddit.com/user/MissOverDiagnosed/draft/33d63f68-d4d5-11e8-8c90-0e21e555e59c](https://www.reddit.com/user/MissOverDiagnosed/draft/33d63f68-d4d5-11e8-8c90-0e21e555e59c)\n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Antipsychiatry", "subreddit_id": "t5_2to28", "subreddit_subscribers": 1884, "subreddit_type": "public", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH ABOUT ANTIPSYCHOTICS AND ANTIDEPRESSANTS.", "url": "https://www.reddit.com/r/Antipsychiatry/comments/9q0edf/the_inconvenient_truth_about_antipsychotics_and/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540090109, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9q07c8/the_inconvenient_truth_about_antipsychotic_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9q07c8", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9q07c8/the_inconvenient_truth_about_antipsychotic_and/", "pinned": false, "pwls": 6, "retrieved_on": 1540090110, "score": 1, "selftext": "&amp;#x200B;\n\nPlease note, this is not a criticism of individuals who take these medications.\n\nLike al medications,  the risks and benefits should be weighed and side effects should be discussed in detail with each patient. \n\n[https://www.reddit.com/user/MissOverDiagnosed/draft/195bcc88-d4d6-11e8-af8a-0e13e4698a96](https://www.reddit.com/user/MissOverDiagnosed/draft/195bcc88-d4d6-11e8-af8a-0e13e4698a96)", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398223, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH ABOUT ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS.", "url": "https://www.reddit.com/r/depression/comments/9q07c8/the_inconvenient_truth_about_antipsychotic_and/", "whitelist_status": "all_ads", "wls": 6}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540087916, "domain": "self.Antipsychiatry", "full_link": "https://www.reddit.com/r/Antipsychiatry/comments/9pzyn4/the_inconvenient_truth_about_antipsychotic_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pzyn4", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/Antipsychiatry/comments/9pzyn4/the_inconvenient_truth_about_antipsychotic_and/", "pinned": false, "retrieved_on": 1540087917, "score": 1, "selftext": "[https://www.reddit.com/user/MissOverDiagnosed/draft/33d63f68-d4d5-11e8-8c90-0e21e555e59c](https://www.reddit.com/user/MissOverDiagnosed/draft/33d63f68-d4d5-11e8-8c90-0e21e555e59c)", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Antipsychiatry", "subreddit_id": "t5_2to28", "subreddit_subscribers": 1884, "subreddit_type": "public", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH ABOUT ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS", "url": "https://www.reddit.com/r/Antipsychiatry/comments/9pzyn4/the_inconvenient_truth_about_antipsychotic_and/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540087289, "domain": "self.rant", "full_link": "https://www.reddit.com/r/rant/comments/9pzw54/the_inconvenient_truth_about_antipsychotic_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pzw54", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/rant/comments/9pzw54/the_inconvenient_truth_about_antipsychotic_and/", "pinned": false, "pwls": 6, "retrieved_on": 1540087290, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "rant", "subreddit_id": "t5_2qn2b", "subreddit_subscribers": 53469, "subreddit_type": "public", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH ABOUT ANTIPSYCHOTIC AND ANTIDEPRESSANT MEDICATIONS.", "url": "https://www.reddit.com/r/rant/comments/9pzw54/the_inconvenient_truth_about_antipsychotic_and/", "whitelist_status": "all_ads", "wls": 6}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540062641, "domain": "self.mentalhealth", "full_link": "https://www.reddit.com/r/mentalhealth/comments/9pwuol/has_anyone_experienced_longterm_side_effects_from/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pwuol", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "permalink": "/r/mentalhealth/comments/9pwuol/has_anyone_experienced_longterm_side_effects_from/", "pinned": false, "retrieved_on": 1540062641, "score": 1, "selftext": "Your thoughts? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "mentalhealth", "subreddit_id": "t5_2qirg", "subreddit_subscribers": 66571, "subreddit_type": "public", "thumbnail": "self", "title": "Has anyone experienced longterm side effects from taking or discontinuing antipsychotics or antidepressants?", "url": "https://www.reddit.com/r/mentalhealth/comments/9pwuol/has_anyone_experienced_longterm_side_effects_from/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540061764, "domain": "self.mentalhealth", "full_link": "https://www.reddit.com/r/mentalhealth/comments/9pwq6g/cbc_white_coat_black_art_the_extreme_difficulty/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pwq6g", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "permalink": "/r/mentalhealth/comments/9pwq6g/cbc_white_coat_black_art_the_extreme_difficulty/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "kzhum71PhVuil6nVTgfbsoU0MAsFqbLIJwLSRj1mOVk", "resolutions": [{"height": 60, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=797c13aeb582a560ae131b72821453d1fcebbe74", "width": 108}, {"height": 121, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=4e11be0be2e8cd54d54633adde800fd18fcb76d7", "width": 216}, {"height": 180, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=b29b6dbdaebb034d8196111b7b7e00e7641c924b", "width": 320}, {"height": 360, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=f3958cd3e06bde43cf5ed1bf86246142819266b7", "width": 640}], "source": {"height": 518, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?auto=webp&amp;s=543a10887eb33899be84e506dd33c13cefea0d4f", "width": 920}, "variants": {}}]}, "retrieved_on": 1540061765, "score": 1, "selftext": "[http://www.cbc.ca/listen/shows/white-coat-black-art/episode/15543691](http://www.cbc.ca/listen/shows/white-coat-black-art/episode/15543691)\n\n&amp;#x200B;\n\nIndividuals, Patients, need to speak up and identify the negative side effects they experience taking, changing or discontinuing psychotropic medications:  any medication meant for the mind. ", "send_replies": true, "spoiler": false, "stickied": true, "subreddit": "mentalhealth", "subreddit_id": "t5_2qirg", "subreddit_subscribers": 66571, "subreddit_type": "public", "thumbnail": "self", "title": "CBC White Coat Black Art: The Extreme Difficulty Patients Experience Attempting to Discontinue Psychotropic Medications.", "url": "https://www.reddit.com/r/mentalhealth/comments/9pwq6g/cbc_white_coat_black_art_the_extreme_difficulty/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540061588, "domain": "cbc.ca", "full_link": "https://www.reddit.com/r/u_MissOverDiagnosed/comments/9pwpa5/cbc_white_coat_black_art_extreme_difficulty/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pwpa5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/u_MissOverDiagnosed/comments/9pwpa5/cbc_white_coat_black_art_extreme_difficulty/", "pinned": false, "post_hint": "link", "preview": {"enabled": false, "images": [{"id": "kzhum71PhVuil6nVTgfbsoU0MAsFqbLIJwLSRj1mOVk", "resolutions": [{"height": 60, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=797c13aeb582a560ae131b72821453d1fcebbe74", "width": 108}, {"height": 121, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=216&amp;crop=smart&amp;auto=webp&amp;s=4e11be0be2e8cd54d54633adde800fd18fcb76d7", "width": 216}, {"height": 180, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=320&amp;crop=smart&amp;auto=webp&amp;s=b29b6dbdaebb034d8196111b7b7e00e7641c924b", "width": 320}, {"height": 360, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?width=640&amp;crop=smart&amp;auto=webp&amp;s=f3958cd3e06bde43cf5ed1bf86246142819266b7", "width": 640}], "source": {"height": 518, "url": "https://external-preview.redd.it/SsSoqLBihStv404QqPWogqtshwZt8tDC3yPsFvPfYFY.jpg?auto=webp&amp;s=543a10887eb33899be84e506dd33c13cefea0d4f", "width": 920}, "variants": {}}]}, "retrieved_on": 1540061589, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "u_MissOverDiagnosed", "subreddit_id": "t5_q4lup", "subreddit_subscribers": 0, "subreddit_type": "user", "suggested_sort": "qa", "thumbnail": "https://a.thumbs.redditmedia.com/UQ9Lyqazz5Yen3t0ptUZbe1yTWHwzvDb_p2cb6jBvW8.jpg", "thumbnail_height": 78, "thumbnail_width": 140, "title": "CBC White Coat Black Art | Extreme Difficulty Patients Experiencing Discontinuing Psychotropic Medications", "url": "http://www.cbc.ca/listen/shows/white-coat-black-art/episode/15543691"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540047406, "domain": "self.MissOverDiagnosed", "full_link": "https://www.reddit.com/r/u_MissOverDiagnosed/comments/9purnb/the_inconvenient_truth_about_antipsychotic_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9purnb", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/u_MissOverDiagnosed/comments/9purnb/the_inconvenient_truth_about_antipsychotic_and/", "pinned": false, "retrieved_on": 1540047407, "score": 1, "selftext": "**I am searching for individuals in Canada who have experienced the same debilitating side effects and withdrawal effects from being prescribed antipsychotic mediations and other psychotropic medications with the intentions of approaching CBC to propose an investigation into the complacent prescribing of these medications and the destructive aftermath of taking these medications.**\n\n**The text below is a \"condensed\" letter I wrote to the Canadian Association of Mental Health (and others) describing my disturbing, perpetual \"journey\" on psychotropic medications.**\n\n**The complaint process was difficult in that I had not completely discontinued all psychotropic medications and was \"scattered\" missing an opportunity to address additional concerns regarding the prescribing psychiatrist. As psychiatric patients, we are often psychologically and physically vulnerable to the medications we are prescribed and the assumption is that we will be taking psychotropic medications for a lifetime and will never be \"cured\".**\n\n**Respectfully, as a woman who works in health care, I know that there is a population of individuals that benefit from these medications and will have to take psychotropic medications for their lifetime. Please understand that I am not critical or judgemental of these healthcare scenarios.**\n\nThe purpose in sharing the exhausting, and often consuming, chemical psychotropic medication cycle that affected my reality  is to highlight the consequences of mechanically prescribing psychotropic medications, such as Risperidone, and the associated, and often disconcerting symptoms patients experience when these medications are changed or discontinued.  Ill advised, I found myself running from one medication to another with the development of each new and troubling symptom contributing to increased physical and emotional discord. My quest for answers was “frantic” as my body and mind failed me.  To my detriment, this “franticness” was witnessed by the prescribing psychiatrist and a host of other healthcare professionals leaving a permanent impression of madness that is not easily erased.\n\nListening to CBC radio and reviewing this conversation online provided links to numerous studies conducted and documented by reputable sources confirming my initial belief that many of the physical and psychological symptoms I endured over a 5 year period were primarily from psychotropic medication dosage changes, switching from one medication to another, discontinuing these medications completely and the painful emotions from having many of my concerns dismissed with condescension and evident irritability within a small healthcare community.   I would find myself being labeled as a difficult patient and diagnosed with numerous psychiatric syndromes I had never been associated with in the past.\n\nI have a history of an eating disorder decades ago and received treatment at the Toronto General Hospital for 14 weeks beginning in January 1988.   I experienced decreased, yet intermittent binging after receiving care at Toronto General Hospital. I found myself moving to a smaller city to be closer to my ”distant”  father in September 2003 and obtained an unreliable casual cashier position at a local hardware store. I arrived with a small supply of the antidepressant Prozac and considered discontinuing this medication when the supply was exhausted.  My attempt to discontinue Prozac was unsuccessful and I was referred to a psychiatrist in March 2004.\n\nThe prescribing psychiatrist has a private psychiatric practice with full privileges at the local hospital, staffs an outpatient rapid response clinic and is also a clinical assistant professor specializing in mood and anxiety disorders at a reputable university typicalling seeing approximately 700 patients per year since 1997.  These credentials suggest a mental health care professional with significant knowledge of the vast and diverse psychotropic medications he prescribes to hundreds of his patients on day to day basis.\n\nI was prescribed a different antidepressant in March 2004 that was later determined ineffective and replaced with the “familiar” Prozac  in August 2004. I was then prescribed Risperidone in September 2004 to augment the Prozac for depression. I was not aware that benefits of Prozac required time to be achieved.  I returned to this psychiatrist’s office requesting higher and higher doses of Risperidone on three separate occasions specifically for this medication’s sedating properties and I was never advised of the potential irreversible side effects of Risperidone and the difficulty discontinuing this medication when this medication was first initiated and with each subsequent requested dosage increase.  \n\nLiterature reports that many patients will not experience the full benefit of antidepressants therapy immediately and the benefits may take as long as 8 weeks.  Perhaps Risperidone would never have been prescribed had I waited the course till the full benefits of Prozac therapy were achieved; and, conceivably, I could still be taking Prozac today.  \n\nI addressed my concerns about taking Risperidone with the prescribing psychiatrist in April 2008 when I discovered this medication was utilized as a chemical restraint in the elderly population with dementia often presenting with difficult behaviours.  I did not want to take Risperidone after this discovery yet believed the prescribing psychiatrist--a paternal-like figure--”must know best”. I was both shy and timid when addressing my concerns about taking Risperidone only to end up being “in agreement” with current psychotropics or advised to trial another antipsychotic such as Invega.  I opted not to trial Invega. I felt the onus of seeking alternatives to Risperidone fall upon my shoulders and my role in health care was insignificant when compared to the role of psychiatrist. I felt very unsupported.\n\nA typical prescription would read Prozac 80-120mg and Risperdal 2-4mg or simply Prozac 120mg and Risperdal 4mg.  The prescribing psychiatrist documented that I often reduced both medications and, at one time, reduced the Prozac dosage as low a 20mg documenting “relapse” without ever investigating the purpose of my non-compliance.    In addition, my medical charts reveal that a pharmacy had contacted the prescribing psychiatrist asking if they should fill an expired prescription for Risperidone and Prozac as I had reported having accumulated a surplus of medication.  The prescription was filled and the prescriber made no inquiry into the surplus or stockpile of medication I had acquired or the notion of noncompliance. This lack of inquiry hindered the development of a therapeutic relationship that was never really initiated.  \n\nThe antipsychotic medications began to change in late 2012:  from Risperidone to Quetiapine, back to Risperidone *and* Quetiapine, to Trazodone, to Trazodone and Quetiapine and this chemical psychotropic medication cycle  would continue to negatively affect my physical and psychological wellness in such profound ways leading me to believe that other psychotropic medications were ineffective contributing to increased medication changes perpetuating physical harm and psychological chaos for several years to follow.   Unbeknownst to me, I would begin an era fraught with somatic symptoms including increased body pain query fibromyalgia, fatigue, skin rashes, gastrointestinal issues query irritable bowel syndrome, nausea, numbness and tingling, cognitive decline, increased anxiety (GAD), ADHD, fatigue and insomnia coupled with numerous psychiatric labels that I can not seem to escape.   The newly acquired psychiatric labels assigned to me based upon the symptoms I presented with were perhaps the most harmful and destructive eroding my self- esteem and self-confidence in tasks that I had become proficient in.\n\nInsomnia developed when Quetiapine replaced Risperidone and I began to struggle with the demands of shift work where I was required to work within a team environment in a role to care for others.   I would later return to the more “powerful” Risperidone. The prescribing psychiatrist documents in my medical charts that I “did not find the Seroquel as helpful as the Risperdal, and decided to go back on the Risperdal, in addition to continuing on the Seroquel.  She was aware of the increased risk of TD \\[Tardive Dyskinesia\\] by making the decision to go back on the Risperdal, in comparison to remaining solely on Seroquel”. The irony in this statement is that I would not have found myself in that uncomfortable predicament of having to choose between one antipsychotic over another antipsychotic--Risperidone or Seroquel--had the prescribing psychiatrist obtained valid informed consent when the medication was initiated in September 2004.   I propose this example of thorough documentation of informed consent is to avoid blame or responsibility for the prescribing psychiatrist’s failure to obtain informed consent when initially prescribing Risperidone and with subsequent dosage increases in the past.\n\nIn addition,   I had to have older breast implants removed at the hospital I was employed at in 2013 and anticipated discontinuing Risperidone close to the surgery date. I was quite content with my body image in my early 50’s and opted for a simple explantation without additional cosmetic surgery and I had  established very satisfying and financially rewarding employment allowing me to reduce my mortgage significantly.\n\nThe unexpected and coincidental removal of ruptured and encapsulated silicone breast implants in  2013 coupled with the current-day controversy surrounding silicone breast implants at that time contributed to an even greater sense of confusion within me as I began to experience the host of challenging physical and psychological symptoms .  There is a specific group of individuals consisting primarily or women who believe that silicone breast implants and silicone products are harmful and contribute to numerous physical and psychological health concerns including breast implant-associated anaplastic large cell lymphoma.  \n\nI knew enough to recognize the onset of the symptoms I experienced presented quickly but I could not determine if the symptoms were from psychotropic medication changes, psychotropic medication discontinuation or from 28 year old ruptured silicone breast implants.  I was confused and with increased anxiety I asked the prescribing psychiatrist if any of my pain could be contributed to various psychotropic medications and their corresponding changes. His response was “Not to my knowledge”. There is sufficient documentation regarding the onset of the physical and psychological symptoms experienced in my medical notes from my local walk-in medical clinic; a medical clinic  that would abruptly dismiss my concerns only to discover that genuine health concerns existed. I vividly recall a physician in this medical clinic, with great annoyance, attempt to convince me that I had a complex chronic disease by utilizing a “tick-in-the-box” symptom checker sheet.\n\nLoss of respect and faith in this medical clinic eventually replaced the painful feelings of being identified as a difficult and undesirable patient.  \n\nMy coping skills diminished quickly with the numerous psychotropic medication changes originating from a conscious and documented attempt to discontinue Risperidone in 2012 leading me to believe that the Prozac I had taken since the late 1998 was no longer effective.  I inquired about the efficacy of Prozac when taken for extended periods of time and the prescriber psychiatrist could not comment so I requested to switch to another antidepressant in April 2014. My ability to concentrate at work declined significantly as I began to soil myself with increasing frequency and I felt I had to  transfer from an acute care position consisting of shiftwork that I truly loved to a disappointing and unsupportive part time position is residential care due to the unpredictability of my bowels. I was overwhelmed when, to use medical terminology, I was incontinent of a large loose, liquid BM in Walmart. This fecal incontinence affected my ability to manage at work and in daily life and I sought more frequent psychiatric counsel.   The prescribing psychiatrist was unable to connect the increased loose fecal incontinence I experienced with the medication he prescribed in April 2014 until late August 2014. The prescribing psychiatrist suggested I consider the plant-based Vegan diet and implied that the “aging process” may be contributing to my physical symptoms. These symptoms exacerbated any mood disorder I may have had contributing to increased anxiety, depression and  isolation coupled with feelings complete helplessness.\n\nThe prescribing psychiatrist did not consider a differential diagnosis and review the various psychotropic medication changes prescribed, beginning with Risperidone, as potential sources to the numerous side effects presented.  I would learn years later that the medication causing fecal incontinence prescribed in April 2014 had been prescribed and deemed ineffective a decade earlier in 2004 and the prescribing psychiatrist neglected to refer to my medical charts when inadvertently re-prescribing this medication for a second time.  \n\nI was very afraid as my mind and body began to fail me.  The physical and psychological symptoms escalated and I called 811 in August 2014 and was advised to go to the emergency department in the hospital where I work.  Emergency physicians often refer to a medication databank listing the patient’s dispensed medications to develop an understanding into the patient’s medical history and to gain potential insight into the cause of patient’s primary complaint leading to an emergency visit.    My medication databank (Pharmanet) listed numerous and various psychotropic medications dispensed over several months and I was “hurt” to hear the emergency physician state that I was wasting his time during this isolated visit in August 2014. Thoughtless and disparaging  comments and attitudes towards individuals with mental illness are common in the healthcare profession; a profession that should display more tolerance towards individuals with mental illness. Individuals holding positions of authority in healthcare should choose to be positive role models for others and lead by example.  The emergency physician’s statement clearly implied I was a burden and this notion would be reinforced by health care professionals in my community for years to come serving to exacerbate any struggles I may have had with depression and anxiety.\n\nI have been privy to many conversations regarding challenging patients and I regretfully admit to participating in some of these conversations.   I distinctly recall caring for two women known throughout the healthcare facility as being demanding and unreasonable and it became difficult for me to care for them “burdened” with the notion that I too, could be one them.  To my surprise, one of these women was transferred to the local hospice facility for end-of-life care and I felt a sense of guilt as I watched her mobilize to the hospice dinner table.\n\nI terminated my relationship with the prescribing psychiatrist of 10 years, from March 2004 to September 2014, and received chastising comments for my actions  from my GP at the time. My GP’s disapproval instilled feelings of guilt and the need for me to make amends by sending a 2014 Christmas card to the prescribing psychiatrist.\n\nI would connect with a new psychiatrist December 2014 and she suggested the mainstay of treatment should be psychotherapeutic in nature describing the purpose of this treatment format and how I would benefit from such treatment.  I am saddened to read of the individual I had become as described in the “new” initial psychiatric assessment in December 2014. The negative experiences from psychotropic medication changes, discontinuing psychotropic medication and with healthcare professionals contributed to feeling “like she is constantly being judged...she is afraid of being humiliated by others...she struggles with feeling like a fraud and that they can see her dysfunction...and is worried that her co-workers can see it in her”.  In addition, this initial consult reports “chronic pain in her arms, shoulders, chest, through her legs for the last year and a half and has seen doctors who believe it might be fibromyalgia...there are chronic gastrointestinal symptoms with a possible diagnosis of Irritable Bowel Syndrome...her thought content was significant for decreased self-worth and she spoke about herself with quite disgust and shame”.\n\nI had finally discontinued all psychotropic medications with the exception of a small dose of Oxazepam for sleep for well over a year when I first listened to this particular CBC White Coat Black Art podcast in May 2018.  This podcast and corresponding website providing links to reputable academic sources strongly suggests that pertinent information regarding patient safety and the physical and psychological side effects related to psychotropic medication changes has been known, present and available for decades.    I find myself wondering why the prescribing psychiatrist, with all of his credentials, did not consider the various medication changes as the source for the exacerbation of physical and psychiatric symptoms and the onset of new symptoms I presented with. In hindsight, perhaps it is possible that the prescribing psychiatrist did suspect that some of my  symptoms were related to psychotropic medication changes when he prescribed Nabilone for pain; he just never articulated his suspicions to me or the healthcare providers at my local walk-in medical clinic.\n\nIn November 2016 I requested my medical notes from the psychiatrist who initiated the course of Risperidone more than twelve years ago  with the intent of complaining to the College of Physicians and Surgeons after caring for an elderly woman who was prescribed levodopa/carbidopa three times a day.   Many patients are prescribed levodopa/carbidopa yet there was no mention of this woman having Parkinson’s disease during shift report. It was discovered this woman presented with Parkinsonian symptoms as a result of taking Olanzapine for several decades.     I could be this woman 20 years from now. This woman was later diagnosed with Stickman’s Disease by the local neurologist.\n\nI continued to struggle with the physical and psychological symptoms that began  when I attempted to discontinue Risperidone in 2012. I had been diagnosed with ADHD the previous year and the physical and psychological  symptoms persisted affecting my ability to focus and concentrate contributing to feelings of increased confusion and self-doubt. Equally disabling is the the ADHD diagnosis/label itself.  I now understand that I have lived with the same brain my whole life but I became fearful of ADHD’s presence with increased incidents of forgetfulness when racing thoughts regarding my failing mind and body would interrupt the continuity of complicated processes of established learned skill-sets and well laid plans.  I began to identify strongly with the geriatric population and considered the possibility of dementia.\n\nIn addition, I recently discovered I had renal health concerns during this time period learning that my kidneys were “allergic’ to Hydrochlorothiazide.    I developed hypertension during this era of psychotropic medication changes and I was having an adverse reaction to this medication. I began to experience neurological twitching in my fingers, increased numbness and tingling coupled with flank pain and my GP abruptly dismissed me without listening to my concerns  stating I had somatoform disorder because I had a history of an eating disorder decades ago.\n\nPerhaps one of the most humiliating experiences was returning to the emergency room in the hospital where I was employed--for a second time--to describe these symptoms noted above and to state with transparency that these symptoms, as per my GP, were symptoms of somatoform disorder.  I was referred to a nephrologist who identified a legitimate health concern and who would soon adopt the same attitude as my GP. I became a renal patient that day.\n\nWith my medical notes obtained November 2016, I submitted a formal written  complaint to the College of Physicians and Surgeons in February 2017 regarding the psychiatric care received and this complaint went unheeded.   I received the psychiatrist’s response to my initial complaint after June 28, 2017, and the content of his response confirmed:\n\n* I was only provided with my transcribed medical charts and not given the handwritten medical charts when I requested my medical files in November 2016.\n* The prescribing psychiatrist did not refer to my medical charts  when inadvertently re-prescribing an ineffective medication for a second time in April 2014.\n\nReceipt of my handwritten medical charts in July 2017 reveal and support the notion that valid informed consent was never obtained or documented until April 2008 confirming my original query to the College of Physicians and Surgeons when I inquired “Why wouldn’t \\[the prescribing psychiatrist\\] discuss the side effects with me when I began taking Risperidone when he first prescribed the medication to me?”\n\nI was emotionally scattered after receiving the prescribing psychiatrist’s response and had recently been approved for long-term disability through my employer benefit package.   A series of negative interactions with healthcare professionals accelerated my determination to discontinue all psychotropic medications at this time. It was unsettling to observe a rheumatologist google the results of a pathology report of a recent skin biopsy after waiting months to see her and it was equally unsettling to have to request new bloodwork when a second nephrologist made reference to lab values from six months ago during a 6-month consult.   This same nephrologist would document that I had” discontinued all my medications with exception of oxazepam” underscoring my sense of “madness”. This nephrologist ordered new bloodwork, at my request, stating that a renal biopsy may be ordered if proteinuria and hematuria were present--and they were. I considered relocating to a larger city to receive healthcare realizing that all future health concerns would be met with familiar disdain within the small community I resided in.   \n\nI believed the continual proteinuria and hematuria was contributing to the physical symptoms I presented with and sought healthcare at the Mayo Clinic in Scottsdale, Arizona, November 2017.  My humble and pitiful admission of traveling to the Mayo Clinic indicates the continued presence of physical and psychological symptoms months after discontinuing psychotropic medications and my own vulnerable and determined quest for answers knowing that the symptoms I presented with began within a specific time frame. The distinct stigma  towards individuals with mental illness that I experienced in my hometown was all too prevalent at the Mayo Clinic in Scottsdale, Arizona. My body was changing and declining in so many ways and I felt helpless and isolated.\n\nI overlooked the advisement of the College of Physicians and Surgeons to provide any new facts “to be of particular significance to the issues at hand” regarding my complaint about the psychiatric care I received for over a decade after receipt of the prescribing psychiatrist’s response to my initial letter of complaint and inbetween obtaining the other half of my medical chart.  In addition, issues regarding abnormal lab values, disdainful healthcare professional attitudes, discontinuing medications and entertaining the idea of moving to a larger city also contributed to the oversight of the College’s advisement. I could see the inconsistencies in the psychiatric care I received but did not possess the means to articulate these inconsistencies with appropriate medical and legal language  nor could I present them in a timely manner. I am a team on one with limited time and resources.\n\nThe timing of listening to this academic conversation on CBC’s White Coat Black Art addressing and discussing the physical and psychological side effects individuals often experience from discontinuing an array of psychotropic medications on May 11, 2018 could not have presented at a more opportune time:   I was taking a lunch break from writing a “Statement of Points” to the Health Professions Review Board, at a local library in Vancouver, regarding the complaint I made to the College of Physicians and Surgeons of British Columbia concerning the care I received from the prescribing physician over the course of 10 years when I first listened to this podcast.  \n\nI believed the content of this CBC White Coat Black Art podcast so significant that I included the link to this podcast with subsequent links to  “When it comes to antidepressants, getting to zero proves difficult” by Dr. Goldman, “Many People taking Antidepressants Discover They Cannot Quit” by Benedict Carey and Robert Gebeloff of The New York Times,  and “Antidepressant Discontinuation Syndrome” by C. Warner and colleagues, in my Statement of Points to the Health Professions Review Board. I naively believed the Health Professions Review Board Panel would take the time to listen and consider the well researched and documented content of this CBC podcast that succinctly explains the source of the physical and psychological symptoms I endured for several years:  symptoms related to antipsychotic and psychotropic medications.\n\nThe Health Professions Review Board decision favoured the initial psychiatrist and reported that the documents I submitted “demonstrates that the Complainant is not a reliable historian and that she has demonstrated an unwillingness to accept a diagnosis or treatment that does not accord with her own view of her medical conditions as she understands them.”   \n\nMedical research and documentation relegated to medical textbooks in university and hospital libraries are now available online and it makes sense that I would search for corroborating medical knowledge to confirm that I endured numerous physical and psychological  side effects resulting from psychotropic medication changes. The evident holes in my medical charts reveal that informed consent was not obtained until I had become reliant on this medication’s sedating properties. Online research will continue as the well-known adverse effects from antipsychotic and antidepressant medications are now openly revealed and discussed on public platforms including radio and television in addition to internet sources.   To reiterate: I naively declared in my initial complaint to the College of Physicians and Surgeons that I began to experience many uncomfortable physical and emotional symptoms coinciding with a conscious attempt to discontinue Risperidone in 2012. These side effects were validated when listening to CBC and researching the numerous sources cited.\n\nMy original declaration was made without having obtained all my medical documentation and receipt of this documentation would confirm that I was not made aware of the irreversible side effects and difficulting discontinuing Risperidone when this medication was initially and subsequently prescribed until I addressed the issue of the inappropriate use of Risperidone as a chemical restraint in the elderly population in 2008.  The Panel Chair’s response to my review request minimizes the physical and psychological symptoms I experienced when attempting to discontinue Risperidone and the chemical psychotropic medication cycle perpetuated from this event for several years to follow. In addition, this response explicitly implies that the symptoms I experienced are a result of my own negligence placing the fault upon the psychiatric patient.\n\nThe personal nature of psychiatric treatment suggests that psychiatric patients are often emotionally and/or intellectually unstable and unreliable historians creating  invisible barriers hindering the vulnerable psychiatric patient’s ability to complain effectively about psychiatric care they have received. The invisible barriers intimidate, discourage and prevent the psychiatric patient from submitting  formal complaints against the psychiatric healthcare provider to appropriate governing bodies who dismiss their concerns favouring the psychiatric practitioner.\n\nI did not possess all the essential medical and legal language when formalizing my complaints to these governing bodies and their responses simply reiterate my mental illness history based upon the psychiatrist’s documentation stating I am an inaccurate historian rather than acknowledge that:  \n\n* I was not provided with half of my medical chart essential to ensure greater accuracy in describing the historical events in my initial complaint regarding care received over a 10-year period;\n* the withheld medical charts  indicates informed consent was not obtained during the first 4 years of care;\n* the prescriber neglected to refer to my medical chart prior to re-prescribing an ineffective psychotropic medication strongly suggesting that he, too, is an  inaccurate historian;\n* The combination of numerous psychotropic medication changes, beginning with initial prescription of Risperidone in 2004,  followed by numerous attempts to discontinue this medication in 2012 contributed to the numerous physical and psychological symptoms I would experience from years to come; and\n* the prescribing psychiatrist did not acknowledge the onset of exacerbated and unexplained symptoms as a result of psychotropic medication changes.\n\nAddressing my concerns to the College of Physicians and Surgeons of British Columbia and extending my complaint further to the Health Professions Review Board were ineffective.   On August 3, 2017, I registered a “Petition to the Court” in the Supreme Court of British Columbia to set aside decisions made my the Health Professions Review Board and The College of Physicians and Surgeons  with the intent of remitting the matter back to the College of Physicians and Surgeons. I have enclosed a copy of the “Petition to the Court” for your perusal.\n\nThe barriers I experienced in registering this Petition were many and it’s contents may appear simple, naive, and lacking in both legal and medical expertise.\n\nI have cited and listed the same documentation I had provided electronic links to for the Health Professions Review Board to examine in an affidavit to “Petition to the Court”  from the CBC White Coat Black Art podcast that aired May 11, 2018. Some of the documents cited as evidence affirm that knowledge of the physical and psychological symptoms attributed to discontinuing antipsychotic and antidepressant medications has been known for decades and should have been acknowledged by the initial prescriber of Risperidone.   I would have also cited Dr. Richard Friedman’s article “A Call for Caution in the Use of Antipsychotic Drugs” had I been permitted to submit additional documentation.\n\nI exercise respect when stating that I am not physician, a psychiatrist or a lawyer.  I am an individual, a middle-aged woman, a caregiver, and a patient with a history of mental illness who encountered numerous obstacles and barriers necessitating tenacity in attempting to access the legal system independently when others would simply submit and accept to living with the same “conditions” believing themselves powerless, feeling voiceless and invisible.  \n\nThe dismissive, and often humiliating, incidents I experienced from healthcare professionals occuring while under the care of the initial prescribing psychiatrist continued even after ending this patient/psychiatrist relationship.  These incidents are not the primary issue in my legal suit requesting the Supreme Court of British Columbia to quash the Health Professions Review Board and College of Physicians and Surgeons’ decisions in favour of the initial psychiatrist; rather, these incidents were a manifestation of preconceived notions and stigmatic beliefs towards individuals with mental illness attempting to reclaim their mental wellness and serve to underscore the necessity for transparency between psychiatrist and patient.  There is a defined series of events that transpired when I attempted to discontinue Risperidone in late 2012: a\n\nmedication I continued to request higher doses of without being informed of the potential irreversible side effects and the difficulting in discontinuing this medication.  These events continued to undermine any legitimate health concerns I presented with in the small city I resided in and have affected the care and a diagnosis I received from a healthcare practitioner in the metropolis I currently reside in.  It is fortunate that I acquire a GP here who is both an academic and a scientist. Dare I say, these events may not have occurred had I been given sufficient information to make an informed choice about the nature of Risperidone in 2004 when this medication was quickly prescribed in the final minutes of a 30 minute consult.  \n\nI suspect that the initial prescribing psychiatrist recognized that the harm of his actions, or lack of actions, would require significant explanation and psychiatric care reflecting poorly upon him and his position in authority  within a small healthcare community. In addition, it was less problematic for him, and perhaps somewhat of a relief, when I sought alternative mental healthcare after losing faith in his abilities.\n\nThe difficulty I experienced discontinuing Risperidone and subsequent psychotropic medications mirrors similar difficulties other patients have experienced exemplifying the “Elephant in the Room” idiom:  The difficulty discontinuing psychotropic medications, including the “powerful” Risperidone, is an undesirable fact that remained unaddressed and ignored until reputable sources such as CBC and The New York Times presented this serious problem identifying the physical and emotional symptoms patients have experienced and their vain attempts to discontinue these medications only to experience failure and to have these symptoms attributed to their declining  mental illness. I believe I have a legitimate complaint regarding the psychiatric care I received from 2004-2014 in that the prescribing psychiatrist and university professor had an understanding that I was physically and psychologically struggling to discontinue Risperidone and various psychotropic medications trialled when he prescribed Nabilone for pain. Prescribing a medication without obtaining informed consent and re-prescribing an ineffective medication in error only compounds the harm done by not identifying the disturbing symptoms I began to experience in 2012 when I attempted to discontinue Risperidone.     \n\nRelocating to a larger city for healthcare has revealed that I have “thin basement membrane disease”, a renal aneurysm and a grade 2 rectocele in a relatively kind, emotionally “safe” and “patient” medical environment.  Food has not been an issue for several years and this fact, in isolation, is emancipating. I take less analgesic and continue to live with intermittent pain, headaches, GI concerns and hypertension coupled with numbness and tingling that began during my “journey”.   I struggle at times with a misaligned circadian rhythm and my sleep quality, for the most part, is moderate and I have been advised not to work nights shifts again. I long to be able to take that satisfying and re-energizing 20 minute midday nap that has been unattainable since discontinuing psychotropic medication well over a year ago.  My cognition has evolved and matured since my initial complaint to the College in February 2017 regarding the psychiatric care I received for more than a decade and I can define my concerns with greater clarity.\n\nI recognize and even expect that my description of events may be, yet again, dismissed as a result of mental illness contributing to medical, scientific or unkind comments regarding my emotional demeanor.  After all, I am a psychiatric patient and psychiatric patients are poor historians.\n\nThe issues of mechanically prescribing powerful psychotropic medications, such as Risperidone, without providing adequate medication information in a manner easily understood by patients,  medical complacency in continuous prescribing of large doses of psychotropic medications without inquiring into the patient’s logic and reasoning for their non-compliance, re-prescribing ineffective psychotropic medication without referring to a patient’s medication history and not identifying and associating the onset of increased or new symptoms with psychotropic medication changes need to be addressed in a medical culture that often corrects emotional maladies with a pill.    \n\n My mental health history clearly indicates the desire to discontinue the psychotropic medication Risperidone and I was prescribed this medication without appropriate medication information. These facts coupled with experiencing the onset and continuation of very uncomfortable  physical and psychological symptoms when attempting to discontinue Risperidone with insufficient support was both socially and medically undermining marking the beginning of sad and stressful chapter in my life that I look forward to closing. Resiliency should not be this difficult.\n\nIn conclusion, this journey has been one of isolation coupled with fears of being ostracized for burdening others with my concerns and linked hand-in-hand with suggestions and explicit statements that I was a burden, a waste of time, while attempting to have some of the physical and psychological symptoms I experienced from psychotropic medication changes addressed.  I simply state that my journey has consisted of a series of experiences that have negatively impacted my physical and psychological well-being. I am apprehensive, yet clearly in need of returning to meaningful employment. My thoughts are more clear and I recognize I have been provided with the gift of time and the opportunity to share my concerns with you and to register  these concerns with the Supreme Court of British Columbia. As mentioned previously, the tone of this letter is written calmly and is meant to be read and interpreted in this manner and I hope to maintain this demeanour when I present to the Supreme Court.\n\nI have encountered many individuals who feel this endeavour will fail; however, the attempt has been made, the concerns addressed and the event recorded for others to follow as the inconvenient truths about psychotropic medications are revealed.\n\nI am presently unsure of how to reestablish a life with purpose and self-worth and trust I will continue to recognize and acknowledge unexpected events as opportunities to reclaim my mental wellness in a new journey towards self-discovery.\n\nSigning off with appropriate affect, thought processes and cognition grossly intact.\n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "u_MissOverDiagnosed", "subreddit_id": "t5_q4lup", "subreddit_subscribers": 0, "subreddit_type": "user", "suggested_sort": "qa", "thumbnail": "self", "title": "The Inconvenient Truth about Antipsychotic and Psychotropic Medications", "url": "https://www.reddit.com/r/u_MissOverDiagnosed/comments/9purnb/the_inconvenient_truth_about_antipsychotic_and/"}, {"author": "MissOverDiagnosed", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2g2km36o", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540046946, "domain": "self.mentalhealth", "full_link": "https://www.reddit.com/r/mentalhealth/comments/9puplw/the_inconvenient_truth_of_antipsychotics_and/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9puplw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/mentalhealth/comments/9puplw/the_inconvenient_truth_of_antipsychotics_and/", "pinned": false, "retrieved_on": 1540046947, "score": 1, "selftext": "&amp;#x200B;\n\n**I am searching for individuals in Canada who have experienced the same debilitating side effects and withdrawal effects from being prescribed antipsychotic mediations and other psychotropic medications with the intentions of approaching CBC to propose an investigation into the complacent prescribing of these medications and the destructive aftermath of taking these medications.** \n\n**The text below is a \"condensed\" letter I wrote to the Canadian Association of Mental Health (and others) describing my disturbing, perpetual \"journey\" on psychotropic medications.**  \n\n**The complaint process was difficult in that I had not completely discontinued all psychotropic medications and was \"scattered\" missing an opportunity to address additional concerns regarding the prescribing psychiatrist.  As psychiatric patients, we are often psychologically  and physically vulnerable to the medications we are prescribed and the assumption is that we will be taking psychotropic medications for a lifetime and will never be \"cured\".** \n\n**Respectfully, as a woman who works in health care, I know that there is a population of individuals that benefit from these medications and will have to take psychotropic medications for their lifetime.  Please understand that I am not critical or judgemental of these healthcare scenarios.**\n\n&amp;#x200B;\n\nThe purpose in sharing the exhausting, and often consuming, chemical psychotropic medication cycle that affected my reality  is to highlight the consequences of mechanically prescribing   psychotropic medications, such as Risperidone, and  the associated, and often disconcerting symptoms patients experience when these medications are changed or discontinued.  Ill advised, I found myself running from one medication to another  with the development of each new and troubling symptom contributing to increased physical and emotional discord.   My quest for answers was “frantic” as my body and mind failed me.  To my detriment,  this “franticness” was witnessed by the prescribing psychiatrist and a host of other healthcare professionals leaving a permanent impression of madness that is not easily erased.   \n\nListening to CBC radio and reviewing this conversation online provided links to numerous studies conducted and documented by reputable sources confirming my initial belief that many of the physical and psychological symptoms I endured over a 5 year period were primarily from psychotropic medication dosage changes, switching from one medication to another, discontinuing these medications completely and the painful emotions from having many of my concerns dismissed with condescension and evident irritability within a small healthcare community.   I would find myself being labeled as a difficult patient and diagnosed with numerous psychiatric syndromes I had never been associated with in the past.   \n\nI have a history of an eating disorder decades ago and received treatment at the Toronto General Hospital for 14 weeks beginning in January 1988.   I experienced decreased, yet intermittent binging after receiving care at Toronto General Hospital.    I found myself moving to a smaller city to be closer to my ”distant”  father in September 2003 and obtained an unreliable casual cashier position at a local hardware store.    I arrived with a small supply of the antidepressant Prozac and considered discontinuing this medication when the supply was exhausted.  My attempt to discontinue Prozac was unsuccessful and I was referred to a psychiatrist in March 2004.  \n\nThe prescribing psychiatrist has a private psychiatric practice with full privileges at the local hospital, staffs an outpatient rapid response clinic and is also a clinical assistant professor specializing in mood and anxiety disorders at a reputable university typicalling seeing approximately 700 patients per year since 1997.  These credentials suggest a mental health care professional with significant knowledge of the vast and diverse psychotropic medications he prescribes to hundreds of his patients on day to day basis.\n\nI was prescribed a different antidepressant in March 2004 that was later determined ineffective and replaced with the “familiar” Prozac  in August 2004. I was then prescribed Risperidone in September 2004 to augment the Prozac for depression.  I was not aware that benefits of Prozac required time to be achieved.  I returned to this psychiatrist’s office requesting higher and higher doses of Risperidone on three separate occasions specifically for this medication’s sedating properties and I was never advised of the potential irreversible side effects of Risperidone and the difficulty discontinuing this medication when this medication was first initiated and with each subsequent requested dosage increase.  \n\nLiterature reports that many patients will not experience the full benefit of antidepressants therapy immediately and the benefits may take as long as 8 weeks.  Perhaps Risperidone would never have been prescribed had I waited the course till the full benefits of Prozac therapy were achieved; and, conceivably, I could still be taking Prozac today.  \n\nI addressed my concerns about taking Risperidone with the prescribing psychiatrist in April 2008 when I discovered this medication was utilized as a chemical restraint in the elderly population with dementia often presenting with difficult behaviours.  I did not want to take Risperidone after this discovery yet believed the prescribing psychiatrist--a paternal-like figure--”must know best”.    I was both shy and timid when addressing my concerns about taking Risperidone only to end up being “in agreement” with current psychotropics or advised to trial another antipsychotic such as Invega.  I opted not to trial Invega.   I felt the onus of seeking alternatives to Risperidone fall upon my shoulders and my role in health care was insignificant when compared to the role of psychiatrist.  I felt very unsupported. \n\nA typical prescription would read Prozac 80-120mg and Risperdal 2-4mg or simply Prozac 120mg and Risperdal 4mg.  The prescribing psychiatrist documented that I often reduced both medications and, at one time,  reduced the Prozac dosage as low a 20mg documenting “relapse” without ever investigating the purpose of my non-compliance.    In addition, my medical charts reveal that a pharmacy had contacted the prescribing psychiatrist asking if they should fill an expired prescription for Risperidone and Prozac as I had reported having accumulated a surplus of medication.  The prescription was filled and the prescriber made no inquiry into the surplus or stockpile of medication I had acquired or the notion of noncompliance.  This lack of inquiry hindered the development of a therapeutic relationship that was never really initiated.  \n\nThe antipsychotic medications began to change in late 2012:  from  Risperidone to Quetiapine, back to Risperidone *and* Quetiapine, to Trazodone, to Trazodone and Quetiapine and this chemical psychotropic medication cycle  would continue to negatively affect my physical and psychological wellness in such profound ways leading me to believe that other psychotropic medications were ineffective contributing to increased medication changes perpetuating physical harm and psychological chaos for several years to follow.   Unbeknownst to me, I would begin an era fraught with somatic symptoms including increased body pain query fibromyalgia, fatigue, skin rashes, gastrointestinal issues query irritable bowel syndrome, nausea, numbness and tingling, cognitive decline, increased anxiety (GAD), ADHD, fatigue and insomnia coupled with numerous psychiatric labels that I can not seem to escape.   The newly acquired psychiatric labels assigned to me based upon  the symptoms I presented with were perhaps the most harmful and destructive eroding my self- esteem and self-confidence in tasks that I had become proficient in.  \n\nInsomnia developed when Quetiapine replaced Risperidone and I began to struggle with the demands of shift work where I was required to work within a team environment in a role to care for others.   I would later  return to the more “powerful” Risperidone.   The prescribing psychiatrist documents in my medical charts that I “did not find the Seroquel as helpful as the Risperdal, and decided to go back on the Risperdal, in addition to continuing on the Seroquel.  She was aware of the increased risk of TD \\[Tardive Dyskinesia\\]  by making the decision to go back on the Risperdal, in comparison to remaining solely on Seroquel”.  The irony in this statement is that I would not have found  myself in that uncomfortable predicament of having to choose between one antipsychotic over another antipsychotic--Risperidone or Seroquel--had the prescribing psychiatrist obtained valid informed consent when the medication was initiated in September 2004.   I propose this example of thorough documentation of informed consent is to avoid blame or responsibility for the prescribing psychiatrist’s failure to obtain informed consent when initially prescribing Risperidone and with subsequent dosage increases in the past. \n\nIn addition,   I had to have older breast implants removed at the hospital I was employed at in 2013 and anticipated discontinuing Risperidone close to the surgery date. I was quite content with my body image in my early 50’s and opted for a simple explantation without additional cosmetic surgery and I had  established very satisfying and financially rewarding employment allowing me to reduce my mortgage significantly. \n\nThe unexpected and coincidental removal of ruptured and encapsulated silicone breast implants in  2013  coupled with the current-day controversy surrounding silicone breast implants at that time contributed to an even greater sense of confusion within me as I began to experience the host of challenging physical and psychological symptoms .  There is a specific group of individuals consisting primarily or women who believe that silicone breast implants and silicone products are harmful and contribute to numerous physical and psychological health concerns including breast implant-associated anaplastic large cell lymphoma.  \n\nI knew enough to recognize the onset of the symptoms I experienced presented quickly but I could not determine if the symptoms were from psychotropic medication changes, psychotropic medication discontinuation or from 28 year old ruptured silicone breast implants.  I was confused and with increased anxiety I asked the prescribing psychiatrist if any of my pain could be contributed to various psychotropic medications and their corresponding changes. His response was “Not to my knowledge”.  There is sufficient documentation regarding the onset of the physical and psychological symptoms experienced in my medical notes from my local walk-in medical clinic; a medical clinic  that would abruptly dismiss my concerns only to discover that genuine health concerns existed.    I vividly recall a  physician in this medical clinic, with great annoyance, attempt  to convince me that I had a complex chronic disease by utilizing a “tick-in-the-box” symptom checker sheet.\n\nLoss of respect and faith in this medical clinic eventually replaced the painful feelings of being identified as a difficult and undesirable patient.  \n\nMy coping skills diminished quickly with the numerous psychotropic medication changes originating from a conscious and documented attempt to discontinue Risperidone in 2012 leading me to believe that the Prozac I had taken since the late 1998 was no longer effective.  I inquired about the efficacy of Prozac when taken for extended periods of time and the prescriber psychiatrist could not comment so I requested to switch to another antidepressant  in April 2014.  My ability to concentrate at work declined significantly as I began to soil myself with increasing frequency and I felt I had to  transfer from an acute care position consisting of shiftwork that I truly loved to a disappointing and unsupportive part time position is residential care  due to the unpredictability of my bowels.   I was overwhelmed when, to use medical terminology, I was incontinent of a large loose, liquid BM in Walmart. This fecal incontinence affected my ability to manage at work and in daily life and I sought more frequent psychiatric counsel.   The prescribing psychiatrist was unable to connect the increased loose fecal incontinence I experienced with the medication he prescribed in April 2014 until late August 2014.    The prescribing psychiatrist suggested I consider the plant-based Vegan diet and implied that the “aging process” may be contributing to my physical symptoms.   These symptoms exacerbated any mood disorder I may have had contributing to increased anxiety, depression and  isolation coupled with feelings complete helplessness.\n\nThe prescribing psychiatrist did not consider a differential diagnosis and review the various psychotropic medication changes prescribed, beginning with Risperidone, as potential sources to the numerous side effects presented.  I would learn years later that the medication causing fecal incontinence prescribed in April 2014 had been prescribed and deemed ineffective a decade earlier in 2004 and the prescribing psychiatrist  neglected to refer to my medical charts when inadvertently re-prescribing this medication for a second time.  \n\nI was very afraid as my mind and body began to fail me.  The physical and psychological symptoms escalated and I called 811 in August 2014 and was advised to go to the emergency department in the hospital where I work.  Emergency physicians often refer to a medication databank listing the patient’s dispensed medications to develop an understanding into the patient’s medical history and to gain potential insight into the cause of patient’s primary complaint leading to an emergency visit.    My medication databank (Pharmanet)  listed numerous and various psychotropic medications dispensed over several months and I was “hurt” to hear the emergency physician state that I was wasting his time during this isolated visit in August 2014.    Thoughtless and disparaging  comments and attitudes towards individuals with mental illness are common in the healthcare profession; a profession that should display more tolerance towards individuals with mental illness.  Individuals holding positions of authority in healthcare should choose to be positive role models for others and lead by example.  The emergency physician’s statement clearly implied I was a burden and this notion would be reinforced by health care professionals in my community for years to come serving to exacerbate any struggles I may have had with depression and anxiety. \n\nI have been privy to many conversations regarding challenging patients and I regretfully admit to participating in some of these conversations.   I distinctly recall caring for two women known throughout the healthcare facility as being demanding and unreasonable and it became difficult for me to care for them “burdened” with the notion that I too, could be one them.  To my surprise, one of these women was transferred to the local hospice facility for end-of-life care and I felt a sense of guilt as I watched her mobilize to the hospice dinner table.  \n\nI terminated my relationship with the prescribing psychiatrist of 10 years, from March 2004 to September 2014, and received chastising comments for my actions  from my GP at the time.  My GP’s disapproval  instilled feelings of guilt and the need for me to  make amends by sending a 2014 Christmas card to the prescribing psychiatrist.\n\nI would connect with a new psychiatrist December 2014 and she suggested the mainstay of treatment should be psychotherapeutic in nature describing the purpose of this treatment format and how I would benefit from such treatment.  I am saddened to read of the individual I had become as described in the “new” initial psychiatric assessment in December 2014.  The negative experiences from psychotropic medication changes,  discontinuing psychotropic medication and with healthcare professionals contributed to feeling “like she is constantly being judged...she is afraid of being humiliated by others...she struggles with feeling like a fraud and that they can see her dysfunction...and is worried that her co-workers can see it in her”.  In addition, this initial consult reports  “chronic pain in her arms, shoulders, chest, through her legs for the last year and a half and has seen doctors who believe it might be fibromyalgia...there are chronic gastrointestinal symptoms with a possible diagnosis of Irritable Bowel Syndrome...her thought content was significant for decreased self-worth and she spoke about herself with quite disgust and shame”.   \n\nI had finally discontinued all psychotropic medications with the exception of a small dose of Oxazepam for sleep for well over a year when I first listened to this particular CBC White Coat Black Art podcast in May 2018.  This podcast and corresponding website providing links to reputable academic sources strongly suggests that pertinent information regarding patient safety and the physical and psychological side effects related to  psychotropic medication changes has been known, present and available for decades.    I find myself wondering why the prescribing psychiatrist, with all of his credentials,  did not consider the various medication changes as the source for the exacerbation of physical and psychiatric symptoms and the onset of new symptoms I presented with.  In hindsight, perhaps it is possible that the prescribing psychiatrist did suspect that some of my  symptoms were related to psychotropic medication changes when he prescribed Nabilone for pain; he just never articulated his suspicions to me or the healthcare providers at my local walk-in medical clinic. \n\nIn November 2016 I requested my medical notes from the psychiatrist who initiated the course of Risperidone more than twelve years ago  with the intent of complaining to the College of Physicians and Surgeons after caring for an elderly woman who was prescribed levodopa/carbidopa three times a day.   Many patients are prescribed levodopa/carbidopa yet there was no mention of this woman having Parkinson’s disease during shift report.  It was discovered this woman presented with Parkinsonian symptoms as a result of taking Olanzapine for several decades.     I could be this woman 20 years from now.  This  woman was later diagnosed with Stickman’s Disease by the local neurologist.  \n\nI continued to struggle with the physical and psychological symptoms that began  when I attempted to discontinue Risperidone in 2012.   I had been diagnosed with ADHD the previous year and the physical and psychological  symptoms persisted affecting my ability to focus and concentrate contributing to feelings of increased confusion and self-doubt.   Equally disabling is the the ADHD diagnosis/label itself.  I now understand that I have lived with the same brain my whole life but I became fearful of ADHD’s presence with increased incidents of forgetfulness when racing thoughts regarding my failing mind and body would interrupt the continuity of complicated processes of established learned skill-sets and well laid plans.  I began to identify strongly with the geriatric population and considered the possibility of dementia. \n\nIn addition, I recently discovered I had renal health concerns during this time period learning that my kidneys were “allergic’ to Hydrochlorothiazide.    I developed hypertension during this era of psychotropic medication changes and I was having an adverse reaction to this medication.    I began to experience neurological twitching in my fingers, increased numbness and tingling coupled with flank pain and my GP abruptly dismissed me without listening to my concerns  stating  I had somatoform disorder because I had a history of an eating disorder decades ago.  \n\nPerhaps one of the most humiliating experiences was returning to the emergency room in the hospital where I was employed--for a second time--to describe these symptoms noted above and to state with transparency that these symptoms, as per my GP, were symptoms of somatoform disorder.  I was referred to a nephrologist who identified a legitimate health concern and who would soon adopt the same attitude as my GP.  I became a renal patient that day. \n\nWith my medical notes obtained November 2016, I submitted a formal written  complaint to the College of Physicians and Surgeons in February 2017 regarding the psychiatric care received and this complaint went unheeded.   I received the psychiatrist’s response to my initial complaint after June 28, 2017, and the content of his response confirmed:\n\n* I was only provided with my transcribed medical charts and not given the handwritten medical charts when I requested my medical files in November 2016.\n* The prescribing psychiatrist did not refer to my medical charts  when inadvertently re-prescribing an ineffective medication for a second time in April 2014.\n\nReceipt of my handwritten medical charts in July 2017 reveal and support the notion that valid informed consent was never obtained or documented until April 2008 confirming my original query to the College of Physicians and Surgeons when I inquired “Why wouldn’t \\[the prescribing psychiatrist\\] discuss the side effects with me when I began taking Risperidone when he first prescribed the medication to me?” \n\nI was emotionally scattered after receiving the prescribing psychiatrist’s response and had recently been approved for long-term disability through my employer benefit package.   A series of negative interactions with healthcare professionals accelerated my determination to discontinue all psychotropic medications at this time.   It was unsettling to observe a rheumatologist google the results of a pathology report of a recent skin biopsy after waiting months to see her and it was equally unsettling to have to request new bloodwork when a second nephrologist made reference to lab values from six months ago during a 6-month consult.   This same nephrologist would document that I had” discontinued all my medications with exception of oxazepam” underscoring my sense of “madness”.  This nephrologist  ordered new bloodwork, at my request, stating that a renal biopsy may be ordered if proteinuria and hematuria were present--and they were.   I considered relocating  to a larger city to receive healthcare realizing that all future health concerns would be met with familiar disdain within the small community I resided in.   \n\nI believed the continual proteinuria and hematuria was contributing to the physical symptoms I presented with and sought healthcare at the Mayo Clinic in Scottsdale, Arizona, November 2017.  My humble and pitiful admission of traveling to the Mayo Clinic indicates the continued presence of physical and psychological symptoms months after discontinuing psychotropic medications and my own vulnerable and determined quest for answers knowing that the symptoms I presented with began within a specific time frame. The distinct stigma  towards individuals with mental illness that I experienced  in my hometown was all too prevalent at the Mayo Clinic in Scottsdale, Arizona.    My body was changing and declining in so many ways and I felt helpless and isolated.  \n\nI overlooked the advisement of the College of Physicians and Surgeons to provide any new facts “to be of particular significance to the issues at hand” regarding my complaint about the psychiatric care I received for over a decade after receipt of the prescribing psychiatrist’s response to my initial letter of complaint and inbetween obtaining the other half of my medical chart.  In addition, issues regarding abnormal lab values, disdainful healthcare professional attitudes, discontinuing medications and entertaining the idea of moving to a larger city also contributed to the oversight of the College’s advisement.     I could see the inconsistencies in the psychiatric care I received but did not possess the means to articulate these inconsistencies with appropriate medical and legal language  nor could I present them in a timely manner.   I am a team on one with limited time and resources. \n\nThe timing of listening to this academic conversation on CBC’s White Coat Black Art addressing and discussing the physical and psychological side effects individuals often experience from discontinuing an array of psychotropic medications on May 11, 2018 could not have presented at a more opportune time:   I was taking a lunch break from   writing a “Statement of Points” to the Health Professions Review Board,  at a local library in Vancouver, regarding the complaint I made to the College of Physicians and Surgeons of British Columbia concerning the care I received from the prescribing physician over the course of 10 years when I first listened to this podcast.  \n\nI believed the content of this CBC White Coat Black Art podcast so significant that I included the link to this podcast with subsequent links to  “When it comes to antidepressants, getting to zero proves difficult” by Dr. Goldman,   “Many People taking Antidepressants Discover They Cannot Quit” by Benedict Carey and Robert Gebeloff of The New York Times,  and   “Antidepressant Discontinuation Syndrome” by C. Warner and colleagues,  in my Statement of Points to the Health Professions Review Board.  I naively believed the Health Professions Review Board Panel would take the time to listen and consider the well researched and documented content of this CBC podcast that succinctly explains the source of the physical and psychological symptoms I endured for several years:  symptoms related  to antipsychotic and psychotropic medications. \n\nThe Health Professions Review Board decision favoured the initial psychiatrist and reported that the documents I submitted “demonstrates that the Complainant is not a reliable historian and that she has demonstrated an unwillingness to accept a diagnosis or treatment that does not accord with her own view of her medical conditions as she understands them.”   \n\nMedical research and documentation relegated to medical textbooks in university and hospital libraries are now available online and it makes sense that I would search for corroborating medical knowledge to confirm that I endured numerous physical and psychological  side effects  resulting from psychotropic medication changes. The evident holes in my medical charts reveal that informed consent was not obtained until I had become reliant on this medication’s sedating properties.  Online research will continue as  the well-known adverse effects from antipsychotic and antidepressant medications are now openly revealed and discussed on public platforms including radio and television in addition to internet sources.   To reiterate:  I naively declared in my initial complaint to the College of Physicians and Surgeons that I began to experience many uncomfortable physical and emotional symptoms coinciding with a conscious attempt to discontinue Risperidone in 2012. These side effects were validated when listening to CBC and researching the numerous sources cited.  \n\nMy original declaration was made without having obtained all my medical documentation and receipt of this documentation would confirm that I was not made aware of the irreversible side effects and difficulting discontinuing Risperidone when this medication was initially and subsequently prescribed until I addressed the issue of the inappropriate use of Risperidone as a chemical restraint in the elderly population in 2008.  The Panel Chair’s response to my review request minimizes the physical and psychological symptoms I experienced when attempting to discontinue Risperidone and the chemical psychotropic medication cycle  perpetuated from this event for several years to follow.  In addition, this response explicitly implies that the symptoms I experienced are a result of my own negligence placing the fault upon the psychiatric patient.  \n\nThe personal nature of psychiatric treatment suggests that psychiatric patients are often emotionally and/or intellectually unstable and unreliable historians creating  invisible barriers hindering the vulnerable psychiatric patient’s ability to complain effectively about psychiatric care they have received.  The invisible barriers intimidate, discourage and prevent the psychiatric patient from submitting  formal complaints against the psychiatric healthcare provider to appropriate governing bodies who dismiss their concerns favouring the psychiatric practitioner. \n\nI did not possess all the essential medical and legal language when formalizing my complaints to these governing bodies and their responses simply reiterate my mental illness history based upon the psychiatrist’s documentation stating I am an inaccurate historian rather than acknowledge that:  \n\n* I was not provided with half of my medical chart essential to ensure greater accuracy in describing the historical events in my initial complaint regarding care received over a 10-year period; \n* the withheld medical charts  indicates informed consent was not obtained during the first 4 years of care;\n* the prescriber neglected to refer to my medical chart prior to re-prescribing an ineffective psychotropic medication strongly suggesting that he, too, is an  inaccurate historian;  \n* The combination of numerous psychotropic medication changes, beginning with initial prescription of Risperidone in 2004,  followed by numerous attempts to discontinue this medication in 2012 contributed to the numerous physical and psychological symptoms I would experience from years to come; and\n* the prescribing psychiatrist did not acknowledge the onset of exacerbated and unexplained symptoms as a result of psychotropic medication changes.\n\nAddressing my concerns to the College of Physicians and Surgeons of British Columbia and extending my complaint further to the Health Professions Review Board were ineffective.   On August 3, 2017,  I registered a “Petition to the Court” in the Supreme Court of British Columbia to set aside decisions made my the Health Professions Review Board and The College of Physicians and Surgeons  with the intent of remitting the matter back to the College of Physicians and Surgeons.  I have enclosed a copy of the  “Petition to the Court” for your perusal.    \n\nThe barriers I experienced in registering this Petition were many and it’s contents may appear simple, naive, and lacking in both legal and medical expertise. \n\nI have cited and listed the same documentation I had provided electronic links to for the Health Professions Review Board to examine in an affidavit to “Petition to the Court”  from the CBC White Coat Black Art podcast that aired May 11, 2018.  Some of the documents cited as evidence affirm that knowledge of the physical and psychological symptoms attributed to discontinuing antipsychotic and antidepressant medications has been known for decades and should have been acknowledged by the initial prescriber of Risperidone.   I would have also cited Dr. Richard Friedman’s article “A Call for Caution in the Use of Antipsychotic Drugs” had I been permitted to submit additional documentation. \n\nI exercise respect when stating that I am not physician, a psychiatrist or a lawyer.  I am an individual, a middle-aged woman, a caregiver, and a patient with a history of mental illness who encountered numerous obstacles and barriers necessitating tenacity in attempting to access the legal system independently when others would simply submit and accept to living with the same “conditions” believing themselves powerless, feeling voiceless and invisible.  \n\nThe dismissive, and often humiliating, incidents I experienced from healthcare professionals occuring while under the care of the initial prescribing psychiatrist continued even after ending this patient/psychiatrist relationship.  These incidents are not the primary issue in my legal suit requesting the Supreme Court of British Columbia to quash the Health Professions Review Board and College of Physicians and Surgeons’ decisions in favour of the initial psychiatrist; rather, these incidents were a manifestation of preconceived notions and stigmatic beliefs towards individuals with mental illness attempting to reclaim their mental wellness and serve to underscore the necessity for transparency between psychiatrist and patient.  There is a defined series of events that transpired when I  attempted to discontinue Risperidone in late 2012:  a \n\nmedication I continued to request higher doses of without being informed of the potential irreversible side effects and the difficulting in discontinuing this medication.  These events continued to undermine any legitimate health concerns I presented with in the small city I resided in and have affected the care and a diagnosis I received from a healthcare practitioner in the metropolis I currently reside in.  It is fortunate that I acquire a GP here who is both an academic and a scientist.   Dare I say, these events may not have occurred had I been given sufficient information to make an informed choice about the nature of Risperidone in 2004 when this medication was quickly prescribed in the final minutes of a 30 minute consult.  \n\nI suspect that the initial prescribing psychiatrist recognized that the harm of his actions, or lack of actions, would require significant explanation and psychiatric care reflecting poorly upon him and his position in authority  within a small healthcare community.   In addition, it was less problematic for him, and perhaps somewhat of a relief, when I sought alternative mental healthcare after losing faith in his abilities. \n\nThe difficulty I experienced discontinuing Risperidone and subsequent psychotropic medications mirrors similar difficulties other patients have experienced exemplifying the “Elephant in the Room” idiom:  The difficulty discontinuing psychotropic medications, including the “powerful” Risperidone, is an undesirable fact that remained unaddressed and ignored until reputable sources such as CBC and The New York Times presented this serious problem identifying the physical and emotional symptoms patients have experienced and their vain attempts to discontinue these medications only to experience failure and to have these symptoms attributed to their declining  mental illness.    I believe I have a legitimate complaint regarding the psychiatric care I received from 2004-2014 in that the prescribing psychiatrist and university professor had an understanding that I was physically and psychologically struggling to discontinue Risperidone and various psychotropic medications trialled when he prescribed Nabilone for pain.  Prescribing a medication without obtaining informed consent and re-prescribing an ineffective medication in error only compounds the harm done by not identifying the disturbing symptoms I began to experience in 2012 when I attempted to discontinue Risperidone.     \n\nRelocating to a larger city for healthcare has revealed that I have “thin basement membrane disease”, a renal aneurysm and a grade 2 rectocele in a relatively kind, emotionally “safe” and “patient” medical environment.  Food has not been an issue for several years and this fact, in isolation, is emancipating.  I take less analgesic and continue to live with intermittent pain, headaches, GI concerns and hypertension coupled with numbness and tingling that began during my “journey”.   I struggle at times with a misaligned circadian rhythm and my sleep quality, for the most part,  is moderate and I have been advised not to work nights shifts again.  I long to be  able to take that satisfying and re-energizing 20 minute midday nap that has been unattainable since discontinuing psychotropic medication well over a year ago.  My cognition has evolved and matured since my initial complaint to the College in February 2017 regarding the psychiatric care I received for more than a decade and I can define my concerns with greater clarity.  \n\nI recognize and even expect that my description of events may be, yet again, dismissed as a result of mental illness contributing to medical, scientific or unkind comments regarding my emotional demeanor.  After all, I am a psychiatric patient and psychiatric patients are poor historians.  \n\nThe issues of mechanically prescribing powerful psychotropic medications, such as Risperidone, without providing adequate medication information in a manner easily understood by patients,  medical complacency in continuous prescribing of large doses of psychotropic medications without inquiring into the patient’s logic and reasoning for their non-compliance,  re-prescribing ineffective psychotropic medication without referring to a patient’s medication history and not identifying and associating the onset of increased or new symptoms with psychotropic medication changes need to be addressed in a medical culture that often corrects emotional maladies with a pill.    \n\n My mental health history clearly indicates the desire to discontinue the psychotropic medication Risperidone and I was prescribed this medication without appropriate medication information.  These facts coupled with experiencing the onset and continuation of very uncomfortable  physical and psychological symptoms when attempting to discontinue Risperidone with insufficient support was both socially and medically undermining marking the beginning of sad and stressful chapter in my life that I look forward to closing.   Resiliency should not be this difficult. \n\nIn conclusion, this journey has been one of isolation coupled with fears of being ostracized for burdening others with my concerns and linked hand-in-hand with suggestions and explicit statements that I was a burden, a waste of time, while attempting to have some of the physical and psychological symptoms I experienced from psychotropic medication changes addressed.  I simply state that my journey has consisted of a series of experiences that have negatively impacted my physical and psychological well-being. I am apprehensive, yet clearly in need of returning to meaningful employment.  My thoughts are more clear and I recognize I have been provided with the gift of time and the opportunity to share my concerns with you and to register  these concerns with the Supreme Court of British Columbia.  As mentioned previously, the tone of this letter is written calmly and is meant to be read and interpreted in this manner  and I hope to maintain this demeanour when I present to the Supreme Court.  \n\nI have encountered many individuals who feel this endeavour will fail; however, the attempt has been made, the concerns addressed and the event recorded for others to follow as the inconvenient truths about psychotropic medications are revealed. \n\nI am presently unsure of how to reestablish a life with purpose and self-worth and trust I will continue to recognize and acknowledge unexpected events as opportunities to reclaim my mental wellness in a new journey towards self-discovery.\n\nSigning off with appropriate affect, thought processes and cognition grossly intact. ", "send_replies": true, "spoiler": false, "stickied": true, "subreddit": "mentalhealth", "subreddit_id": "t5_2qirg", "subreddit_subscribers": 66555, "subreddit_type": "public", "thumbnail": "self", "title": "THE INCONVENIENT TRUTH OF ANTIPSYCHOTICS AND OTHER PSYCHOTROPIC MEDICATIONS", "url": "https://www.reddit.com/r/mentalhealth/comments/9puplw/the_inconvenient_truth_of_antipsychotics_and/"}]}