{"data": [{"author": "mistersadboi", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2f7ezynl", "can_mod_post": false, "contest_mode": false, "created_utc": 1539933471, "domain": "self.self", "full_link": "https://www.reddit.com/r/self/comments/9phi90/i_am_proof_that_capitalism_is_a_lie/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9phi90", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 13, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/self/comments/9phi90/i_am_proof_that_capitalism_is_a_lie/", "pinned": false, "pwls": 6, "retrieved_on": 1539933472, "score": 1, "selftext": "Hello I am an almost middle aged man (35) who due has never finished school and rarely had a job. Yet, I can afford a one bedroom in San Fransisco on Nob Hill. Why? Because my family is wealthy. They are wealthy because my great-grandparents were land owners both in Europe and the USA. They are wealthy because my grandfather owned a factory. They are wealthy because both my parents were managers at their jobs. They learned how to make good investments from my great-grandparents and grandparents, they inherited their investments as well.\n\nI could in theory never work or finish school, and still have enough money to live comfortably into old age. I could even have children and still be fine. This is because I inherited wealth. I did nothing to earn it.\n\nYet every day I see people whom my grandparents and great-grandparents literally called peasants (middle class and working class peoples) believe in and worship \"bootstrap theory\". Believe that if they work hard enough working for somebody else who is rich, eventually that rich person will notice their hard work and make them rich.\n\nSorry, but it does not work that way. That rich person you spend 8 hours a day asking for a big break is just going to give his children, nephews, and nieces the job and the money you want. You will spend your life chasing something that your boss has absolutely no obligation to give you, and most likely never will.\n\nWhen I was 18, I got a job at the company my family owned. My uncle made me a manager, and I was given a pay of $50 an hour. I could have just done this job my entire life, but decided what it was just wasn't for me after about a year there. Also, me being made a manager pissed off a lot of people at the company, and most were conservatives politically (this was in the South). They truly believed that one day they'd have my job (they didn't, when I quit it went to my cousin. Right now it's occupied by the dads college roommates daughter).\n\nYou will most likely never get such jobs unless you are born rich and know other rich people. Economics in this country is determined not by \"hard work\", but by class. Every time I bring this up to friends I have that aren't rich, I get called a filthy communist or a libtard unless they themselves are liberal or even more left leaning. Liberals are silly too though, because even though they think that capitalism isn't perfect they still think it will \"work out\" for them. Again, it won't unless you are rich. Most of my friends I know who are rich, by the way tend to be liberal. They want universal healthcare and tax funded college, because educated workers are actually better workers (that being said they don't think that means they should get paid more!). The ones I know who are conservative tend to be the ones who run places that are damn near sweatshops, and they laugh at their workers dreams of being rich like them. They often tend to be franchise owners of places like McDonalds, Jiffylube etc. Let me tell you, franchise owners may as well be slum lords.\n\nAnyway, if you truly think slaving away at a $15 hour 8hour job or anything between $15 and like $30, you're misguided. I would say the only jobs that might make you rich working for another person is computer science jobs, but maybe for the next two decades.\n\nAnyway, that's my rant. Sleep well ya'll.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "self", "subreddit_id": "t5_2qh96", "subreddit_subscribers": 363342, "subreddit_type": "public", "thumbnail": "self", "title": "I am proof that capitalism is a lie", "url": "https://www.reddit.com/r/self/comments/9phi90/i_am_proof_that_capitalism_is_a_lie/", "whitelist_status": "all_ads", "wls": 6}, {"author": "mistersadboi", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2f7ezynl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1539764040, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9owpe4/the_most_terrifying_thing_is_nobody_knows_what/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9owpe4", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9owpe4/the_most_terrifying_thing_is_nobody_knows_what/", "pinned": false, "pwls": 6, "retrieved_on": 1539764041, "score": 1, "selftext": "We try as best as we can to ignore this ultimate truth.\n\nI can't because I had close family members all kill themselves. I could be next. Whatever affliction came after them could come after me.\n\nI don't even date people anymore because if I will ruin them.\n\nIt's terrifying to think my suffering has no meaning.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397012, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "The most terrifying thing is nobody knows what happens when you die", "url": "https://www.reddit.com/r/depression/comments/9owpe4/the_most_terrifying_thing_is_nobody_knows_what/", "whitelist_status": "all_ads", "wls": 6}, {"author": "mistersadboi", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2f7ezynl", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1539694164, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9onb1m/nothing_is_enjoyable_anymore_i_cant_sleep_and_im/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9onb1m", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9onb1m/nothing_is_enjoyable_anymore_i_cant_sleep_and_im/", "pinned": false, "pwls": 6, "retrieved_on": 1539694164, "score": 1, "selftext": "I was recently diagnosed with paranoid schizophrenia. I was prescribed meds for it, but they are starting to not work at all, causing sleep issues, and a disconnect.  \n\n\nI spent all morning trying to listen to music, stuff I usually enjoy. None of it was really enjoyable. Everything I eat just feels like a struggle and tasteless. On top of that my paranoia goes in and out with the voices. I've been talking to a girl I met on Tinder, but I became paranoid that she was stalking me through online video games. So I stopped playing the game I was into.\n\n&amp;#x200B;\n\nOn top of that one of the meds has the issue of messing with my sleep. When I take it, I end up sleeping for 12 or more hours. Yesterday I slept for 16 hours, and now I haven't been able to sleep at all. I'm going to be up until tonight (its morning now) because if I take a dose now, I'll sleep all day and miss my appointments. It's caused me to miss my meeting with my therapist last week, and I'm going to reschedule today.\n\n&amp;#x200B;\n\nOh about food. I alternate between being hungry and not hungry at all. When I end up taking one bite of food, my hunger vanishes and what I'm eating suddenly becomes disgusting.\n\n&amp;#x200B;\n\nI may have to go back into a psych ward, and I'm terrified. I already dropped out of school for the 9th time because I felt like the computers I did my school work on (I was going for computer science) were working against me.\n\n&amp;#x200B;\n\nI don't even know if anyone who responds is real. I know I'm making this post.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 396699, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Nothing is enjoyable anymore, I can't sleep, and i'm paranoid", "url": "https://www.reddit.com/r/depression/comments/9onb1m/nothing_is_enjoyable_anymore_i_cant_sleep_and_im/", "whitelist_status": "all_ads", "wls": 6}]}