{"data": [{"author": "MisterMexidankus", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2l0y6nly", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542009021, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wc2t6/here_i_am_again/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wc2t6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wc2t6/here_i_am_again/", "pinned": false, "pwls": 0, "retrieved_on": 1542009022, "score": 1, "selftext": " \n\nI planned to say so much, but I just keep writing and erasing one string of text. I started to remember how years ago I could live a life of a normal person - wake up at the morning, go to university, study thing, speak to people, do hobbies, have dreams, plan something, travel around my country and some other things students usually do. I was kinda curious to learn something new about world every day. It wasn't the best time in my life for sure, I always was melancholic and weird, but now I look back and think that I had a decent life. Because I started to compare it with today's life.  \n\n\nnow i am, almost 25 years old, sitting at home alone for 3 years. i wake up at a random part of the day, cook some soup with vegetables cause i cannot afford decent food anymore, and play computer games for 12 hours a day at the very least. i leave home once in a week to buy some groceries for that small amount of money that my parents send me so I don't die from starving. I was fired 2 months ago from pizza delivery restaurant - apparently, I became too stupid to cook pizza, i simply could not remember anything i tried to learn. this job was only thing that i was excited for, if i can call it so, but i break everything i touch, and lost interest almost instantly, just like to almost everything else i did in my life. (all sentences start with I but I dont know how to phrase it differently, lol.)  \n\n\nI looked in a mirror yesterday and realised that i became even skinnier. I used to be 186 cm \\\\ 56 kg, so i already was skinny af, but now it is even worse. i barely gained few kilos in few years. no serious diseases, but my health is not okay at all.  \n\n\nthere was a huge sentence about how my memory becomes worse, but i accidentally deleted it, lol. in few words - i had a phenomenal memory, now it is gone. instead there is a headache and confusion.for last 4 or 3 years i feel like my brain is covered with bubble gum. it became hard to think.\n\n  \ni went to see a doctor at the worst parts of the year, i was diagnosed with depression and probably something else, and i used to eat pills, but, as some of you could already guess, i never took it for longer than a month- not because i-feel-better-now-so-i-dont-need-it-anymore. I simply cannot afford it. There is no insurance or any other way in my country that would cover the price of pills. Those visits to the doctor really disturb my mother, who think that \"they\" will lock me in a mental hospital forever and my employee will know about it and i will never find a job and other random bullshit that hovers around mental health problem. We talked about this like a year ago i guess, i am not sure, and she said that i should go to church and confess to a priest. So, lets say that reddit is my church and you are my priest.  \n\n\nI studied psychology, i wasn't good student, but for some reason they didn't expel me. i don't remember much from study program, but 5 years of reflection will bring nothing good. just imagine this fucking irony. i cant think about anything related to psychology and I am completely burned out.  \n\n\none thing that i am still truly passionate about is music. sometimes something reminds that i love music, so once in a month usually i go to a soundcloud and facebook to check if there is any news from my favorite or new artists. i get goosebumps when i listen to new music, and for a day or two life gets actually quite good. i used to study music production for years a hobby, i wanted to become a soundesigner of a musician, but lack of being decent human being, and here i am.  \n\n\nI am terrified of fulltime job. How can people work hard 8 hours per day, not looking at the clock every 15 minutes. To be not tired as fuck after working day, manage to meet friends and spend time with family, have hobbies and sleep well. This is only thought i have that makes me think that i am alone in the world, because somehow everyone have a job. It does not mean that i think that everyone around have dream job and everyone is happy, I just don't understand. How can you be happy working like this. how can you not lay down in bed for 3 hours every morning, cause there is no reason for you to stand up.   \n\n\nI never planned suicide, but i remember a moment \\~3 years ago - i worked in retail atm, so i went in a shop and realised that i would preffer not-living to this life. like i dont want to kill myself, but either i dont want to live this life. Schopenhauer said something like that it is worth to live only that life, which absolutely, undoubtedly wins before death.  \n\n\nImagine ruining your life so hard. I am sure that i forgot to mention some of worst things, but i am already the pitiest person you know. At this point, i know that there is no way out, considering other circumstances.  But for some reason, somehow, i still think that everything will get better. This stupid hope was with me all my life, for no absolute reason, i am still not ready to give up my dreams, plans, despite i can't do anything anymore, except of using computer games as escapism. But if before it was hope that everything will get better, now i feel that it will all end soon.  \n\n\ni spent like 2 hours at least writing this and i dont want to read and correct it again, so if your native English speaking eye will point out some grammatical nightmare - you should know that i am not very sorry.  \n\n\nI just need some serious fucking help and i will start living again. But sometimes i think that i crossed the point of no return.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 404821, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "here i am, again", "url": "https://www.reddit.com/r/depression/comments/9wc2t6/here_i_am_again/", "whitelist_status": "no_ads", "wls": 0}, {"author": "MisterMexidankus", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2l0y6nly", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542006882, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wbvgu/here_i_am_again/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wbvgu", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wbvgu/here_i_am_again/", "pinned": false, "pwls": 0, "retrieved_on": 1542006884, "score": 1, "selftext": "I planned to say so much, but I just keep writing and erasing one string of text. I started to remember how years ago I could live a life of a normal person -  wake up at the morning, go to university, study thing, speak to people, do hobbies, have dreams, plan something, travel around my country and some other things students usually do. I was kinda curious to learn something new about world every day. It wasn't the best time in my life for sure, I always was melancholic and weird, but now I look back and think that I had a decent life. Because I started to compare it with today's life.  \n\n\nnow i am, almost 25 years old, sitting at home alone for 3 years. i wake up at a random part of the day, cook some soup with vegetables cause i cannot afford decent food anymore, and play computer games for 12 hours a day at the very least. i leave home once in a week to buy some groceries for that small amount of money that my parents send me so I don't die from starving. I was fired 2 months ago from pizza delivery restaurant - apparently, I became too stupid to cook pizza, i simply could not remember anything i tried to learn. this job was only thing that i was excited for, if i can call it so, but i break everything i touch, and lost interest almost instantly, just like to almost everything else i did in my life. (all sentences start with I but I dont know how to phrase it differently, lol.)  \n\n\nI looked in a mirror yesterday and realised that i became even skinnier. I used to be 186 cm \\\\ 56 kg, so i already was skinny af, but now it is even worse. i barely gained few kilos in few years. no serious diseases, but my health is not okay at all.  \n\n\ni went to see a doctor at the worst parts of the year, i was diagnosed with depression and probably something else, and i used to eat pills, but, as some of you could already guess, i never took it for longer than a month- not because i-feel-better-now-so-i-dont-need-it-anymore. I simply cannot afford it. There is no insurance or any other way in my country that would cover the price of pills. Those visits to the doctor really disturb my mother, who think that \"they\" will lock me in a mental hospital forever and my employee will know about it and i will never find a job and other random bullshit that hovers around mental health problem. We talked about this like a year ago i guess, i am not sure, and she said that i should go to church and confess to a priest. So, lets say that reddit is my church and you are my priest,  \n\n\nI am terrified of fulltime job. How can people work hard 8 hours per day, not looking at the clock every 15 minutes. To be not tired as fuck after working day, manage to meet friends and spend time with family, have hobbies and sleep well. This is only thought i have that makes me think that i am alone in the world, because somehow everyone have a job. It does not mean that i think that everyone around have dream job and everyone is happy, I just don't understand.  \n\n\nI never planned suicide, but i remember a moment \\~3 years ago - i worked in retail atm, so i went in a shop and realised that i would preffer not-living to this life. like i dont want to kill myself, but either i dont want to live this life.  \n\n\nImagine ruining your life so hard. But for some reason, somehow, i still think that everything will get better. This stupid hope was with me all my life, for no absolute reason, i am still not ready to give up my dreams, plans, despite i can't do anything anymore, except of using computer games as escapism. But if before it was hope that everything will get better, now i feel that it will all end soon.  \n\n\nI just need some serious fucking help and i will start living again. But sometimes i think that i crossed the point of no return.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 404811, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "here i am, again", "url": "https://www.reddit.com/r/depression/comments/9wbvgu/here_i_am_again/", "whitelist_status": "no_ads", "wls": 0}]}