{"data": [{"author": "MonkeyMouthMadafaka", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1ebwe53x", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542575838, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9y9wc1/nothing_is_ever_enough/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9y9wc1", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9y9wc1/nothing_is_ever_enough/", "pinned": false, "pwls": 0, "retrieved_on": 1542575839, "score": 1, "selftext": "Pardon my english as it is not my native language. I went to a shitty college where working hard was considered as being a loser. I was made fun of for studying and I used to think that if I studied enough and joined a good grad school things would be different. Finally I would be happy. I spent my four years getting laughed at by my peers for working hard and being a loser in general but I never paid much attention to them. I liked my field of study and engrossed myself in it. \n\nAfter graduating things turned out great for me. I joined one of the best grad school and thought now things are going to be great for me. A month goes by and I start feeling shitty. I have sleepless nights thinking what if all this was a mistake. Someone playing a joke on me. Building me up only to make fall real hard. What if I don't score good here, what if I am not enough. The semesters are very heavy as compared to my previous school but I still manage somehow getting by with decent scores. Honestly when I have deadline for submission I feel that I have something to look forward to. Once those are over and I get a free time for two-three days, I just lock myself in and that's when the worst things happen. I stop eating completely as well as stopped sleeping. I never have any good thoughts. I constantly find myself thinking I need to kill myself. I make no acquaintance in my school as I just lock myself in. The only time I go outside is to attend classes  and eat once a day. I don't bathe, some days I don't even brush and just spend days laying in my bed if I don't have any assignments or exams. Initially I thought maybe this was due to stress. But after a year of this, I finally visit a psychiatrist who diagnosed me with severe depression and anxiety. He prescribed me with some benzodiazapenes for a month. Honestly, visiting a psychiatrist was a big step for me and I had only told it to my parents and  a close friend. She started ridiculing me for visiting a psychiatrist and at that time I felt she was right and I was making a big deal out of nothing. I never visited my doctor again. He had written me a prescription for a month and where I pharmacies are very easy going. I just stocked up a large amount of pills. I started abusing them and this went on for three months of my vacation. I didn't remember what happened during those months as my memory went to shit. Finally when my I was out of pills, I thought I turned to drinking and smoking. Only when I am high that the thought of killing myself stop. \n\nFor the last six months I had a fear that I might not get a good job which honestly didn't bother me much. But I had hopes that maybe if I get a good job I could feel happy and normal like I felt when I was a kid. Last month I got a job with a high salary. The day I got a job everyone was happy except me. I felt indifferent. I felt someone is again trying to get my hopes up only to make me fall harder. Past couple of weeks my thoughts have become more vicious. I have blocked every person and deleted their contact as I feel they are making fun of me for visiting a psychiatrist. All because she contacts me again and again and makes fun of me. I can't tell anyone I am depressed as they think I have no reason to be depressed. I have completely isolated myself in the last year.\n\nI feel there is no point in living as I keep setting goals and even if I achieve them I feel just as shitty or even worse sometimes. Telling it my mom only results in her crying so I can't even talk to her. I have to console her that I am doing fine and honestly I am annoyed. My father is just indifferent and thinks I am weak for feeling this way.\n\nI just didn't know what to do. I'll delete this post if I am breaking any rules. ", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 407002, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Nothing is ever enough", "url": "https://www.reddit.com/r/depression/comments/9y9wc1/nothing_is_ever_enough/", "whitelist_status": "no_ads", "wls": 0}]}