{"data": [{"author": "mrstmj", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_21kur74i", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541442684, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ug57t/afraid_of_medication/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ug57t", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9ug57t/afraid_of_medication/", "pinned": false, "pwls": 0, "retrieved_on": 1541442685, "score": 1, "selftext": "I was diagnosed with depression when I was 15 and was too scared to get on medication then. I was able to go to therapy twice a week until I was 18, which helped me immensely. Once I turned 18 that stopped and I haven't been back since. I also haven't had any significant depressive episodes since then... until now.\n\nI'm now 27 and this episode has been going since at least August. (I initially thought it started in September but I've been journaling consistently for the past few months and looking back, it definitely started in August. It got way worse in Sept.) I've cut my friends out of my life, have hardly seen any of my family, and have been around only my husband since early September. I've been forcing myself to go to work but past that, I don't have much energy for anything. \n\nI'm finally at the point of saying I need help. I can't afford therapy like when I was a teenager so I guess it's time for medication. I'm so scared of it. My mom also has depression and spent most of my childhood sleeping, but when I was very young she was on anti depressants and attempted suicide. My best friend was on them when we were in high school and turned into an emotionless zombie. \n\nI don't want to not feel like myself. I'm not suicidal now and I don't want to be. I also don't want my sex drive to dry up as I've heard often happens. But I'm at a loss. I don't know what else to do. I'm miserable and I can't handle it anymore. I just feel like life shouldn't be this hard. \n\nMy husband and I also want to start thinking about starting a family in the next couple years and I'm terrified that this is going to get so much worse when we get to that point. \n\nI guess I'm just looking for some bravery to get this done. It seems like this is my only option at this point and my back is against the wall. I just can't live like this anymore. I just want to feel normal again. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 402662, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Afraid of Medication", "url": "https://www.reddit.com/r/depression/comments/9ug57t/afraid_of_medication/", "whitelist_status": "no_ads", "wls": 0}]}