{"data": [{"author": "munchisforreal", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2kwbtqxy", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541968047, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9w755q/where_am_i_heading/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9w755q", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9w755q/where_am_i_heading/", "pinned": false, "pwls": 0, "retrieved_on": 1541968462, "score": 2, "selftext": "Hi y'all,\n\nI've been browsing through /depression and thought I'd share my story. In a way I feel like I can't be completely honest to anyone about my current state of mind. I figure my friends and family would be shocked if I were to lift the veil.   \nIt seems as if my life is a movie sometimes. Each time I lift myself up, I get punched in the face by life. Surely, depression is an illness that clouds perception. But I've gotten to a point where I can no longer rationalize my sorrow. Well, so far for my dramatic introduction...let's get on with it!\n\nFour years ago I was diagnosed with testicular cancer. My life shattered in front of my eyes. I was 20 years old at the time, a young man. I had just been rejected for joining the military. I've always been the sporty type, at the time I worked out five days a week. Working out gave me stability and meaning. Moreover it was a way of loving myself, as I took care of my body and mind. Initially all I needed was surgery, there were no signs of metastasis.  I was staying at my parents' to recover after the surgery. A couple of days later I had a huge fight with my father. I decided to leave and stayed at my girlfriends' parents for a couple of weeks. I could barely walk at the time, I was eager to start living life again. But then I developed chronic pain in my groin. The pain dominated my life for the year to come, together with an ongoing conflict with my father. The chronic pain made it impossible to work out. I saw many doctors and they all told me the same thing: it is unrelated to the surgery. I coped with my problems in a rather unhealthy way. I drank a lot, smoked a lot of weed and did some other non-addictive drugs. I started to cheat on my girlfriend. I acted like nothing was wrong to the outside world. My girlfriend was one of the few who saw how I really felt. We broke up. I isolated myself even more. \n\nAt some point I felt quite good, and I pulled myself together. But, precisely one year after my surgery, three metastasis were found in my lung. In a matter of days I was hospitalized, I received nine weeks of chemotherapy. The prospects were good, chances of dying were slim. My friends took care of me, and I actually remember this period of my life in a positive way. I was given another chance at life. I got back on my feet and started my second year at college with renewed energy. \n\nBut it didn't take long for reality to catch up with me. I struggled to keep up with my classes. I started working at a restaurant to pay the bills. The pressure built up, and after a couple of months I had very little energy. I felt horrible. I had to quit my job because I wasn't able to remember shit. I felt lonely. It felt so unfair that this happened to me. I isolated myself even more. The only time I felt connected to the world was when I was drunk or using drugs. \n\nI picked myself up again. I quit drinking for a couple of months together with a friend. I made plans for the future. I made myself a promise. If I just worked my ass off at uni I could travel afterwards. I started to do some volunteer work. Things went better for a while. \n\nThen I started studying again after the summer. Slowly I was pulled back into my depression. I made a plan to raise funds for cancer research by cycling the world. This kept me going, as things went sour yet again. But I promised myself I wouldn't let the cancer beat me. I worked hard, studied hard, and graduated with excellent grades. When I received my diploma I felt absolutely nothing though.\n\nI worked long days in order to save up for my dream. I was extremely unhappy at the time. The thought of escaping reality by cycling through nature kept me going. When I finally started the journey I was excited. Unfortunately I had made a mistake. My chronic pain, which had been dormant, returned in full. I struggled with myself as I saw how my friend, who joined me for the ride, easily connected to people whereas I was too busy fighting my demons. I became suicidal and decided to quit. \n\nI came back home, severely depressed. I can't put into words the disappointment I felt. My body had failed me again, and so had my mind. I had become bitter. I started a job which basically involved scamming people. Fuck the world, I thought. My consciousness eventually forced me to quit the job. For some months I isolated myself even more. I had a fight with a very close friend and we cut all ties. Then I met a girl. She swept me off my feet. I fell in love with her. She had her own demons though. She struggled with anorexia and a violent ex-boyfriend. I did all I could to help her. I helped myself by helping her, trying to be an example for her. I decided I would change my life, and finally look for professional help for my depression. But the timing was not right, she was so unstable that we had to stop the relationship. \n\nAnd now I'm here. I have completely isolated myself from most of my friends. I only connect with my mother. I'm in love with a girl that isn't in love with me. Every time I try to work out my chronic pain spikes again. My body tried to kill me. And I truly feel like giving in.\n\n \n\n&amp;#x200B;\n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 404551, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Where am I heading?", "url": "https://www.reddit.com/r/depression/comments/9w755q/where_am_i_heading/", "whitelist_status": "no_ads", "wls": 0}]}