{"data": [{"author": "MusgraviteFracture", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2drb4gji", "can_mod_post": false, "contest_mode": false, "created_utc": 1539125646, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9mtyfh/i_cant_even_be_upset/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9mtyfh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9mtyfh/i_cant_even_be_upset/", "pinned": false, "pwls": 6, "retrieved_on": 1539125647, "score": 1, "selftext": "Without my mom making it about herself.\n\nI'm in my fucking mid-twenties, and I live at home working a stupid retail job and trying to help my disabled mother around the house-- at least that's the excuse I tell everyone. In reality, I'm just a shitty adult and can't manage to live on my own. Depression has fucked up my life. The past year, having lived at home, I've been really trying to fix myself. I was diagnosed when I was in early elementary school, and it has just fucked up my life. I only feel like I've been getting a grasp on being an adult in the last year, working on myself and trying to actually be an adult.\n\nToday, I was set off. I fucked something up and I should have done it early and if I had, I wouldn't be in this goddamn mess. But, I didn't. And my mom just has no fucking sympathy. She actually said \"Enough with the \"shoulda\" I had a lot of thing I *shoulda* done\" and went on for a bit and then we just stopped talking to each other.\n\nI'm just so sick of living at home and being a burden. I know my mom would never actually confirm that to my face, but I know I am. I'm just too damage to do anything on my lwn. God, I can't even fucking see when I'm typing right now, the gears are blurring my eyes and I can barely see my phone. Thank gods for autocorrect but I'm still probably fucking it all up alnway\n\nI know it's an overreaction. I know my mom is probably sick of this, tired of having to hold my hand through every aingle fucking thi ng that I should be able to handle on my own. But I fuxki ng can't. Every time things don't go exactly righg, I break down. I freak out and I know I'm overreacting but honestly, if it's not that, then I just don't react. My emotionsare either 0 or 100. No inbetwen. I bury my emotion down because it's either nothing or just anger. Anger at others, usually anger at myself because I can't do thi ng right.\n\nI'm just done. I don't care and I don't want to care. I'm a burden and I'm tired of dragging down everyone around me. All I have even fucking wanted for the past 20 years is to be normal, and it really seems like that is an impossible task.\n\nI don't even fucking blame my mom. I feel terrible that I'm making her feel this way. I feel like I've ruined her life, now and just by being born. I keep hoping this one thing will fix everything, will make it all better. I keep hoping it will get better and while it hasn't gotten worst, it's still fucki ng terrible.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 394330, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I can't even be upset", "url": "https://www.reddit.com/r/depression/comments/9mtyfh/i_cant_even_be_upset/", "whitelist_status": "all_ads", "wls": 6}]}