{"data": [{"author": "n37x", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13n0pbk1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541001207, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9t00mj/is_this_worthy_of_an_er_visit/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9t00mj", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9t00mj/is_this_worthy_of_an_er_visit/", "pinned": false, "pwls": 0, "retrieved_on": 1541001209, "score": 1, "selftext": "See post yesterday, I have definitely relapsed into depression. I was weaning off my meds with guidance of my Psychiatrist, but as I moved 100's of miles away was unable to meet for a follow-up appt. I weaned myself completely off and was feeling great (this was about 2 months ago). New environment, new job, minimal stress. Until 2 weeks ago, a ton of our procedures changed which had the entire team stressed, but me especially as I was treating about half of our patients in the entire county, while the other therapists split the lower half (home health physical therapy).\n\nCue multiple panic attacks within the last few days, and panicked phone calls this morning to try to get services where I am. It's a year wait for any sort of psychiatry, the counciling center doesn't take my insurance and I have no pills left.\n\nAfter about 3 hours of run around this morning, I was able to schedule an appt with a local PCP for a month out, still haven't been able to schedule talk therapy, but I was able to get ahold of my MD 500 miles away and have him fax a prescription to hold me over until I can get in with the PCP.\n\nThe main problem is is that I am continuing to have panic attacks. My resting heart rate is well over 130 and I'm in such a fog. I was going to try to work this afternoon but honestly don't think I can. Even though it's not a true emergency, as in I'm not going to die, my patients care and my work life kind of hang in the balance. Is it worth going to see if they can put me on something to mellow me out and that I might be able to work without panic attacks the next few days?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 400975, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is this worthy of an ER visit?", "url": "https://www.reddit.com/r/depression/comments/9t00mj/is_this_worthy_of_an_er_visit/", "whitelist_status": "no_ads", "wls": 0}, {"author": "n37x", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13n0pbk1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540940530, "domain": "self.Advice", "full_link": "https://www.reddit.com/r/Advice/comments/9st2ri/the_best_at_the_job_until_i_burn_out/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9st2ri", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/Advice/comments/9st2ri/the_best_at_the_job_until_i_burn_out/", "pinned": false, "pwls": 0, "retrieved_on": 1540940531, "score": 1, "selftext": "Both in professional reviews, and introspecting, I've heard the same thing. I am a relatively young (25) doctorate level physical therapist.\n\nWhen starting a new position, or after recovering from burnout, I constantly hear that I excell at my position. This fuels me. I take on more and more work until I can barely take the stress and inevitably relapse into my depression from an outside (family, etc) catalyst. My work, timeliness with documentation and quality of care suffer for a short time, and then I recover and bounce back.\n\nI have seen this cycle a few times already in my young career. I would like to nip this habit and set healthy working boundaries, but a) I know that's an area I struggle with personally and b) it's even more difficult in the healthcare setting I work in.\n\nAny advice?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Advice", "subreddit_id": "t5_2qjdm", "subreddit_subscribers": 167592, "subreddit_type": "public", "thumbnail": "self", "title": "The best at the job until I burn out", "url": "https://www.reddit.com/r/Advice/comments/9st2ri/the_best_at_the_job_until_i_burn_out/", "whitelist_status": "no_ads", "wls": 0}, {"author": "n37x", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13n0pbk1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540939382, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9sswz3/checking_in_potentially_relapsing_seeking_similar/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9sswz3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9sswz3/checking_in_potentially_relapsing_seeking_similar/", "pinned": false, "pwls": 0, "retrieved_on": 1540939383, "score": 1, "selftext": "Background, maybe 8 months ago I had my first depressive episode stemming from an incident in grad school where I was throwing a party and my best (female) friend who was also drunk took advantage of me (male) blacking out and had violent sex with me in my bed, despite me telling her multiple times before I blacked out that I didn't want to have sex. When I came to I threw her off of me and returned to the party to find from my neck down to my thighs we're covered in bruises, cuts, and blood. My entire body down including my genitals hurt. It was embarrassing as all of my closest friends witnessed this, I definitely had an alcohol abuse problem at the time, and I was hella stressed just weeks away from finishing my doctorate. Within a week of that event I realized I was acting weird. I would almost start crying if alone in a room with a girl I didn't know. I started having panic attacks. I tried to receive help from our schools counselling center where they told me I was drug seeking and to just take some deep breaths. A few days after that, I nearly committed suicide.\n\n8 months ago, I was in a shitty job, had absurd amounts of student debt to pay off, family issues, and was in a failing relationship who expected me to carry the weight of her problems as well. I cracked, began having suicidal tendencies again and was depressed for the first time in my life. To the point where I couldn't get out of bed for weeks at a time, and I eventually ended up losing my job. Nearly committed, some talk therapy and psychiatry, I was diagnosed with general anxiety, depression and PTSD. I was placed on Lexapro and Clonezepam.\n\nTook a few months to start to \"normalize\" life. Introspected and realized I needed to get out of my relationship so I took a job across the state that I always wanted to do, that doubled my salary. It was going super swell, and my doc was not the most personable guy and didn't build a great repoire with me. I felt he wasn't taking me seriously when I asked him to wean off of my dosages, and he told me to wait another 6 months before stepping down.\n\nAnyways, I'm in a new town, feeling great, didn't have a local doc and my prescriptions we're almost empty. I decided to wean myself gradually decreasing the dosages. First the depression, as the depression was more a result of my anxiety. Then, the anxiety, until I no longer took them. I still felt great. This was about 2 months ago, taking them for maybe 5 months.\n\nThe past 2 weeks have been hell. We changed systems at work and I am forever an over achiever, so I was doing a lot more than my coworkers prior to the switch, but as this is a new learning experience I have 1.5 to 2x the amount of work to learn on and it's exponentially blowing up and wearing me down. Lots of family problems, my baby sis (15) has developed drug and alcohol abuse problems from my parents failed marriage. My dad is about to go into the hospital for a semi-emergency surgery. I am financially in a very good place, so I've been taking care of some of dad's bills. He doesn't make much to begin with and what he does he has to give to mom for child support and she buys 3 new cars a year. It's kinda fucked.\n\nFor weeks I've been telling my direct supervisor that my anxiety is through the roof and that something needs to change with my workload. It was met to the tune of it will get better, hang in there. Yesterday, after having a verbal run in with my ex over some things that were still at the house across the state, I shut down. I had difficulty waking up for work (I have the luxury of making my own schedule) so I rolled in around 11.\n\nToday I called off sick and wasn't able to get out of bed, get dressed or eat. Fortunately, no suicidal tendencies at all. I relayed that I am concerned I may he relapsing to my supervisor, and asked if he had any resources available for me. He gave me the local psych place, but they didn't answer my calls or return my messages today. \n\nI still have a few pills left, and I did take some last night, but I am concerned about taking them even just to hold me over as I had some nasty side effects when I first started, and I don't want those right now. I am considering going to the ER just to get some sort of formal medical advice, and I am borderline in crisis, but also I work at the hospital so I kinda don't wanna go there.\n\nMy short term goal is to get back on meds, as I would like to not fuck up a job that pays well, they really like me even though it is a temp position. This is without a doubt affecting the quality of my work and the quality of care my patients receive. This is my biggest concern right now.\n\nMy long term goal is to get on a formal schedule for therapy sessions, as well as wean myself back off meds but have something as an emergency stop gap of and when things do get super stressful.\n\nWhat are your guys experiences with relapsing and work and my general goals?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 400699, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Checking in, potentially relapsing, seeking similar experiences", "url": "https://www.reddit.com/r/depression/comments/9sswz3/checking_in_potentially_relapsing_seeking_similar/", "whitelist_status": "no_ads", "wls": 0}, {"author": "n37x", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13n0pbk1", "can_mod_post": false, "contest_mode": false, "created_utc": 1537917303, "domain": "self.legaladvice", "full_link": "https://www.reddit.com/r/legaladvice/comments/9ix4pn/i_have_never_had_a_traffic_incident_before_this/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ix4pn", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/legaladvice/comments/9ix4pn/i_have_never_had_a_traffic_incident_before_this/", "pinned": false, "pwls": 6, "retrieved_on": 1537917304, "score": 1, "selftext": "Basic traffic court question:\n\nI am 25, never have been issued a speeding ticket (before this morning) so maybe this seems like a silly question, but I'm mostly looking to arm myself with knowledge/information. Pennsylvania, if it helps.\n\nThis morning I was tagged for doing 50.8 in a 35. The catch is that it's a definite speed trap; (I assume) I was tagged immediately exiting a 55.\n\nThere is 1500 feet of a 35 mph speed zone before the left hand turn I was making, which is again a 55 (I drove out after work to measure all distances). I'm going to make a general assumption that I took about 500 feet to slow down to make the turn, giving the offer approximately 1000 feet to make the determination I was speeding.\n\nThe officer did not pull me over until I was somewhere between 1.5 and 2.5 miles down the next road (based on my GPS, and my timings of when I was supposed to be at my next patient's house). He quickly pulled up behind me with lights on; I was under the assumption he was passing me and was shocked when he pulled me over. By the time he pulled me over, I could not in good faith say I was or was not speeding in that area, I honestly just don't know. Driving for a living doing home health, I am usually pretty cautious to observe limits, but who knows, I could have slipped.\n\nOn the citation, he did not list a method used to clock my time (vascar, radar, etc). In the timing comments he mentioned he clocked me doing 100 feet in 1.34 seconds. If he had listed the method used, I would be able to deduce the accuracy of the method. I am assuming if I call the PD tomorrow, I can use the equipment ID he listed on the citation to find out what was used.\n\nIf it is vascar (as the timing suggests), I find it dubious at  best that his reaction time is down to the hundredth of a second; a quarter second too fast of over anticipation and that pushes the reading from 37mph to the listed 50.8 mph\n\nHe was also very aggressive with me, asserting that I was driving with my seatbelt off, I was not. I did take my seatbelt off once I stopped on the side of the road to get my registration and insurance out of the glove box and have it ready for him when he approached my window so we could both move on with our days as soon as possible as I had a patient to treat.\n\nHe lowered the charge from 15 over to doing \"just 5\" over, so I wouldn't get points. In my mind though, if I was doing 15 over, charge me with 15 over. It felt as though he was trying to imply I was getting a bargain just so I would plead guilty. It all just seems fishy to me.\n\n Obviously, I would like to not pay the fine if I was wrongly pulled over, but the $150 fine is not an issue for me. I  have never experienced this, however, and I have no idea what the sequella is. If I plead guilty, will this affect my insurance premium? Would it be better to just eat the 150, and move on with my life? Without me knowing if I was or was not actually speeding at the time, do I have a case?\n\nThanks for the read, and I look forward to reading the comments!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "legaladvice", "subreddit_id": "t5_2rawz", "subreddit_subscribers": 514952, "subreddit_type": "public", "thumbnail": "self", "title": "I have never had a traffic incident before. This morning i was pulled over for speeding, but I honestly don't believe I was speeding", "url": "https://www.reddit.com/r/legaladvice/comments/9ix4pn/i_have_never_had_a_traffic_incident_before_this/", "whitelist_status": "all_ads", "wls": 6}]}