{"data": [{"author": "nemin43", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1s4kfza", "can_mod_post": false, "contest_mode": false, "created_utc": 1539325059, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9nhu6c/depression_mental_health_and_accutane/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9nhu6c", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9nhu6c/depression_mental_health_and_accutane/", "pinned": false, "pwls": 6, "retrieved_on": 1539325059, "score": 1, "selftext": "So some background about me. I was diagnosed with an anxiety disorder when I was 5 and have struggled with mental health on and off for my entire life. I have been depressed before 5 years ago, triggered by my best friend committing suicide. I remember this deep feeling of emptiness and isolation I felt when I was alone. I used to come home from school and play video games by myself for hours, even though my friends were playing at the same time as me just to numb myself out. When it was time for me to go to sleep I remember shaking while closing my blinds because I was so scared of being alone with my own thoughts as I waited to fall asleep. I eventually overcame that through supportive friends, even though I never told anyone about my depression.\n\n&amp;#x200B;\n\nFast forward to going away for first year engineering four years later. I always knew that I would have to keep a close watch on my mental health since I would be super busy, be away from home and away from my friend group. I had been going to therapy all my life until then, but I had never felt like it really helped since I never opened up or even knew what was going on in my head. First year was when I really started noticing my anxiety and how it affected my life. The best way to describe it is at it's best, it's a quiet voice in the back of your head doubting your worth. At it's worst it feels like someone is shouting your deepest insecurities from all directions in the most aggressive, disgusting way possible. Sometimes during bad days, when I would do something as small as walk through the cafeteria I would hear a voice shouting things like \"Everyone fucking hates you, why do you think you deserve to be here? You're a disgusting ugly piece of shit that nobody likes\". \n\n&amp;#x200B;\n\nFirst year is also when I started to get anxiety attacks. I haven't really figured out everything that triggers them, but a lot of the time something simple like looking in the mirror on a bad day could do the job. I would start to feel an overwhelming sense of anxiety that made me curl up in my bed, listen to sad destructive music through my headphones way too loud and curl up tighter and tighter until my body was shaking. I would also sometimes stare in the mirror until my features morphed into weird versions of themselves and I barely recognized myself almost as if I was hallucinating. For example I would see my face shift or look at my stomach and think it had too much fat, and then the next second think I was horrifyingly skinny. I remember one time I had a specifically bad anxiety attack and I left my room to go to the bathroom and after I came back I couldn't bring myself to go back in my room I just sat in the hallway and trembled because I was so scared. I haven't told anyone about this.\n\n&amp;#x200B;\n\nI had had acne for a few years before and ran through the common treatments that my doctor prescribed, each one working for a few months, but my acne always came back worse than before. For somebody who has high anxiety and is insecure, this felt like the worst thing that could have happened to me. It caused a lot of anxiety in my life and it was  literally in the back of my mind every minute of every day. I finally went on Accutane this summer and knew about it's link to depression and suicide. I have been on Accutane for almost 5 months now and am so grateful for the results, it has improved my self confidence and lifted a huge weight off of me. Up until about a month ago I had been depression free expect for the odd day (maybe twice in the last 5 months) where I felt sad and lonely for no reason.\n\n&amp;#x200B;\n\nThis brings us to this September when I started my second year of Engineering, in a program known for being very difficult. My eating/sleep schedule has not been ideal, I stopped going to the gym and school takes 8-10 hours a day on average. For the last few weeks I have felt on and off depressed and it really set in this week. I have felt unmotivated, feel like isolating myself from my friends and the worst of all is that deep sense of emptiness that I had 5 years ago is back strong especially when I'm alone. I have also had a few anxiety attacks and have self harmed a few times. The worst night yet was I was doing work at my desk and started to feel an overwhelming sense of emptiness and anxiety so I lay in my bed and felt an anxiety attack coming on. That lasted for a few minutes and I had the urge to self harm. I grabbed the sharp end of a pencil like I had done a couple times before and pressing it into my arm and running it along the skin when my eye caught a knife lying on my shelf. I had never used a knife to cut myself before, but I felt a strong urge to try it, so I took the knife and started doing the same thing. I did that for 15-20 mins, talking to my housemate in the middle of it and then locking my door again. As I was laying on my bed about 5 mins after I felt a strong sense of panic setting in. I started to severely hyperventilate and felt as if I was unstable on my bed. I kept trying to sit up in my bed even though I was already sitting up and kept saying \"no, no\" to myself and looking at my door in terror as if there was a threat there.\n\n&amp;#x200B;\n\nSince then I have had the normal depressed symptoms. I have considered reaching out, but am scared that if I tell someone they will force me to go off Accutane, which I really do not want to do especially since I only have one month left on it. I've tried to wait it out, but these past couple days have been tough and I really would like to improve my mental health now, especially since I think that my depression is caused by my lifestyle rather than Accutane, but am not sure how to do that on my own.\n\n&amp;#x200B;\n\nI'm open to any suggestions.\n\n&amp;#x200B;\n\nTL;DR I have had mental health issues in the past, I am having them now on accutane, don't want to tell anyone because don't want to go off accutane.\n\n&amp;#x200B;\n\nP.S. I was very tired when i wrote this so it probably doesn't make much sense", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 395087, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Depression, Mental Health and Accutane", "url": "https://www.reddit.com/r/depression/comments/9nhu6c/depression_mental_health_and_accutane/", "whitelist_status": "all_ads", "wls": 6}]}