{"data": [{"author": "Noodledoodlepoodl", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1hv7jf9d", "can_mod_post": false, "contest_mode": false, "created_utc": 1538951791, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9m9fii/i_ruin_everything/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9m9fii", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9m9fii/i_ruin_everything/", "pinned": false, "pwls": 6, "retrieved_on": 1538951791, "score": 1, "selftext": "I've ruin everything. \nMe and my family were going to a buffet and I was already feeling overwhelmed, with many family members coking to spend the night, I'm an introvert and every single one of them except for my mom, is an extrovert. To say the least, theyre draining to be around. I go to my mom as a coping mechanism and she understands this, ever since I was born I was always latched onto her. She makes me feel happy and gives me enough energy to go on. When we went to the buffet my little brother (11) was annoying me, and I can deal with annoying people. I have two younger sisters and I never get this frustrated at them like I do with him. He has narcissists tendencies, and when he realizes he's annoying someone, he'll do it further rather than to back off, he isn't stupid, he admitted it, just doesn't care. It seems pointless to get this annoyed at an 11 year old at my age, but he is the type of people I try so hard to stay away from. I love him to death, don't get me wrong, but I'm sure it's only because he's my little brother. I can't see any good in his personality, not since he was 9. We soon left the buffet and went to the mall, at this point I was drained and weak, but I don't tell anyone because they all (except my mom) can't stay still for too long (it's 7 of us in all). And my mom gets irritated due to my social anxiety easily, so i refrain. Until we were suppose to split in groups, my extroverted family members, and my mom and I. I had thought I could get away from my brother for a while and charge myself with only my mom and I. But he didn't want to go with them because of a series of pointless excuses he made up. He purposely kept annoying my mom and I just to get a reaction. And I (regretfully) finally gave him one and called him annoying, saying no one wants to be around him because of this. I soon apologised, but after that, my mom was irritated at me and him (understandable), and I tried to act happy and extroverted, hoping she'd be happy again, but it didn't work. That's when I realized I has ruined it all. \nI feel like a complete waste of time and space, I'm a disappointment despite what my family says, I bet to differ. I'm annoying, I want validation and assurance all the time. I wish I could just die, my mom may have less space, and she has two other daughters, maybe she can try for a perfect daughter with them, I might be missed for a while, but I'm sure they'll soon move on. She has so much going through her life, and I'm a huge problem causing her more stress with my disabilities. I have been diagnosed with depression, professionally. And I've tried treatments, therapy, etc etc since I was 10 (I'm 17 now) and it's so scarring for a kid to go through mental hospitals, various medication with dangerous side effects and feeling imperfect all the time, not to mention being around therapists who talk about THEIR problems. We aren't rich, we can't afford the best of the best. Anyway, money doesn't equal quality. I've given up on meds and therapists I'm done. And nothing can convince me. Antiepressants just don't work for my brain, I'm waiting for a new anti depressant invention.. Not to play the pity me card, but I've been through huge psychological trauma as a child, and this may be the reason for my constant need for reassurance that I'm worthy and I'm not annoying anyone. My mom gets frustrated the second time I ask.. I get it though, I'm just an idiot and wish I didn't have to live. She wanted a daughter and got me, trash. You know.. She did want to abort me when she found out she was pregnant with me, but it was too late. I was a mistake, let's face it. I wasn't suppose to be here. I'm a burden, and always will be. I hate myself. I hate my personality. I hate my brain. I want to die. I feel like dying everyday. It's not just this moment. And please don't suggest seeking help, I won't. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 393627, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I ruin everything", "url": "https://www.reddit.com/r/depression/comments/9m9fii/i_ruin_everything/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Noodledoodlepoodl", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1hv7jf9d", "can_mod_post": false, "contest_mode": false, "created_utc": 1537898455, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9iuh7c/my_mom_attempted_to_kill_herself_today/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9iuh7c", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9iuh7c/my_mom_attempted_to_kill_herself_today/", "pinned": false, "pwls": 6, "retrieved_on": 1537898456, "score": 1, "selftext": "I'm a bit new here, but don't know of any other places to find some people to talk to, because I really need it.Okay.. I'll just jump right into it.\n\nWhilst in the middle of writing in my notepad in my room, suddenly my mom bursts in crying and acting hysterical. She said: \"I just swallowed 15 sleeping pills and if I die I love you\" it was extremely heartbreaking and I imidiately began crying. Her depression wasn't surprising though, I knew she was awfully sad because of her boyfriend, his emotional abuse, narcissm and manipulation (his whole family also manipulates and emotionally abuses her!) Yet when I left her and my 3 month old sister in the living room to go to my room, she was happy and we laughed so much that night (but as I know, that doesn't mean anything, one could still smile but be broken inside). Anyway, I told her to please go throw it up, but she refused many many times and I was afraid it already dissolved, so i ran downstairs and told my mom's boyfriend to \"please help my mom\". He \"forced\" her to throw it up, after he refusing and repeatedly saying \"I'd rather be dead than with you\". She only threw up water.. it seemed to dissolve already. He gave her coffee to keep her awake, and the meds seems to be working because she was absolutely out of it. I tried to coax her into calling the police, but she was afraid, and so was her boyfriend. They were afraid me and my young siblings will be taken away (we don't have any family where we live) and she'd have to fight to get us back. She really doesn't want to live, she never did, with the endless stream of abusive boyfriends, no job, and five kids, I can see how awfully hard it is to go on. Don't judge but.. apart of my wishes for her to have peace, I'm sick and tired of seeing her in so much pain. I love her so much and she doesn't deserve this. Yet we can't live without her, she's out Best friend, and the future has to get better? Right? She was holding my 3 month old sister and nearly falling over from the pills, I had to take care of my baby sister and her up until her boyfriend came back from work. He did, and they convinced me to go to bed. I wanted to call 911 so badly, but I knew what would happen if I did. We'd be taken away, mom would be taken away, and I can't bare to see my baby sister going off with my mom's boyfriends awful family. So I didint call them, even when my mom seemed like she needed it the most. We aren't wealthy, mental hospitals are the worst, they treat you like garbage and rarely do they care. I don't know what to do. She's okay right now, but still depressed. \nThis situation is so complicated and I'm sorry.. no one's story is the same. Ours just happens to be twisted and confusing.. \n\nNote: she isn't brave enough to break up with her boyfriend (He is the father of my baby sister) and she's very lonley \n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 389992, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "My mom attempted to kill herself today", "url": "https://www.reddit.com/r/depression/comments/9iuh7c/my_mom_attempted_to_kill_herself_today/", "whitelist_status": "all_ads", "wls": 6}]}