{"data": [{"author": "nostpatch", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2k3o0gja", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542321091, "domain": "self.ProjectFiCouponCodes", "full_link": "https://www.reddit.com/r/ProjectFiCouponCodes/comments/9xg1q2/and_another_one/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xg1q2", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/ProjectFiCouponCodes/comments/9xg1q2/and_another_one/", "pinned": false, "retrieved_on": 1542321093, "score": 1, "selftext": "A5XCPV", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ProjectFiCouponCodes", "subreddit_id": "t5_8xopw", "subreddit_subscribers": 8, "subreddit_type": "public", "thumbnail": "self", "title": "And another one", "url": "https://www.reddit.com/r/ProjectFiCouponCodes/comments/9xg1q2/and_another_one/"}, {"author": "nostpatch", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2k3o0gja", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541643405, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9v5ywp/hopeless/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9v5ywp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9v5ywp/hopeless/", "pinned": false, "pwls": 0, "retrieved_on": 1541643405, "score": 1, "selftext": "I'm getting so sick and tired of fighting. Some days I just lie in bed staring at the ceiling for a few hours before I get out of bed. I do the same every night when it's time for sleep. I'm almost 30 and my parents keep bailing me out constantly from my own recklessness. I'm really trying to do good this time. They're both about 70 years old now and they should be relaxing and enjoying themselves. They deserve more out of their kids than my broken sister and me. They've paid for my psych ward visits, my time in rehab, my failed attempts in college, and all of my frivolous spending. I try to stop being a burden on them again and again but it always ends up the same way and they just won't give up. If I killed myself, they'd get the money from the life insurance policy they took out on me and even more from the hefty one I took out on myself The suicide clause on it has expired. It would be like winning the lottery for them financially. I can't stop seeing the faces that they made when they found me during or after an attempt on my own life though. I know hearing that news would hurt them more than than hearing about me needing to spend more of my inheritance early even though I think that particular balance went negative a long time ago.\n\n&amp;#x200B;\n\nI'm a stubborn loser. I don't want to wake up in a psych ward again. I really don't want to wake up there with deformities or loss of control/healthy function to my body. I already can't tolerate my existence enough. I think the scariest thing that I can think of is being trapped in my body like that once it becomes a prison without a way to end it all. It would be so easy for me to guarantee death, but I would have to make sure no one would have to be put through seeing me after the fact. Maybe the lack of closure would help my family. Maybe they would think I found happiness somewhere.\n\n&amp;#x200B;\n\nI don't even want to be happy. I just want to stop sliding back into this pit all the time. My insides feel like they're so much heavier. I sleep 10 to 14 hours a day when I'm down. I can't start practicing better habits when I'm lucky if I have enough energy to avoid getting fired from another job for poor attendance. I'm scared my mom wasn't being delusional when she was carting me around to all those different doctors until one granted the diagnosis she wanted to me. I can inquire further, sure.  I would have to travel to doctor appointments out of state for treatment and I can't even afford the travel.\n\n&amp;#x200B;\n\nIf I died, no one but my mom, dad, and sister would actually give a shit. When I'm not being boring, I'm either a downer or venomously toxic. My phone never wakes up \"just cause\" unless it's from my mom or sister. I'll go weeks without hearing from either of them besides my mom's email forwards.\n\n&amp;#x200B;\n\nI've been ghosted by both of the talk docs I've seen since I moved to this city. I had one appointment with one lady and she seemed. She called the morning of my third appointment and said she was sick and would get back with me to reschedule. I had two appointments with a man who spent a long time as a professor of a major university. He gave me testing and seemed very interested in helping me through my issues. During our second appointment, he led me through a series of questions in an impressive way. I'm usually pretty good at figuring out where a line of questioning is coming from in the DSM V after all my time in their offices. He blind sided me and said he has an assumption that I'm on the autism spectrum and he's going to look into an official diagnosis and treatment options with me. I've been stuck on this cliffhanger for 2 months now. Between the two, I found a new psychiatrist who seems pretty great. She diagnosed me as bipolar type II with rapid cycling. That explains those wonderful periods where I felt like I was 10 feet tall, bullet proof, and worth liking.\n\n&amp;#x200B;\n\nI try to avoid spending time with people as much as possible when it isn't related to school or work. There are a couple guys from work who I go drinking with on occasion and it doesn't open that pit in my chest. I get a fair number of compliments on my appearance. I say \"thanks\" and try to change the subject. I just see a piece of shit with dead eyes when I look in the mirror. I lost my virginity to a sex worker when I was 22. I proposed to the first non-sex worker I slept with about 2 years later. We were a fucked up mess for about 3 years. It took me a few years after that before I figured out how to get a date through Tinder. Never got a third date with anyone aside from my ex-fiancee. Hung out with a few of the girls I met that way platonically after the fact. I tried that the other night. I should have known better. I was a spectacle for her and her friend. \n\n&amp;#x200B;\n\nI have no talents, no hobbies, no goals. I'm not even supposed to exist. I wish my disappearance didn't have to leave a vacuum. Well, more of a vacuum than it already is. I wish I could donate my life to someone who would be happy with it. Someone who doesn't have a worthless brain that is going to sabotage every chance of happiness they get. Someone who could fade away peacefully without hurting anyone if I could actually take their place.\n\n&amp;#x200B;\n\nI'm so sick and tired of fighting. I'll outlive my parents. I'll hold onto that. I see the trope of \"live for yourself\" come up a lot in movies, books, and tv. It always refers to the character pursuing a way of life where they choose their own details instead of surrendering to someone else's standards set for their lives. I could live for my parents though. When I was 10 and too scared to go to face my bullies at school anymore, I tried slitting my wrists in front of my dad once I realized that he was going to make sure that I went. That's the only time that I've seen him cry while he kept telling me he just wanted me to be happy. My mom is more picky, but she's too frail to take the shock of my suicide. I can't imagine the toll it would take on her. My sister and I aren't close. I don't like talking to her. That's only because we're both so awkward conversationally that it turns into a disaster. We still get along though. I'm even happy that she isn't self-aware enough to notice when she's annoying me.\n\n&amp;#x200B;\n\nMost days, I know for certain that I can outlive my parents. My sister shouldn't last much longer than my parents. I don't think I'll survive that long on my best days. I need rest. Not sleep, that doesn't do anything for me anymore. I need to feel refreshed. I can't keep putting my mind and body through this wringer.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 403289, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Hopeless", "url": "https://www.reddit.com/r/depression/comments/9v5ywp/hopeless/", "whitelist_status": "no_ads", "wls": 0}]}