{"data": [{"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541975298, "domain": "self.AskDocs", "full_link": "https://www.reddit.com/r/AskDocs/comments/9w85le/sharp_pain_in_upper_arm/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9w85le", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskDocs/comments/9w85le/sharp_pain_in_upper_arm/", "pinned": false, "pwls": 6, "retrieved_on": 1541975299, "score": 1, "selftext": "18 F / white / 175 lbs / 5’6” \n\nAbout 24 hours ago I suddenly noticed pain in my upper arm. It’s on the outside of my arm and not pain from the joint, I believe. Googling symptoms it appears like it might be bicep tendinitis. \n\nIt’s interfering with sleep, cramping, warm to the touch, tender to the touch. Pain is worst when I try to move my arm back, but reaching my arm across my chest hurts badly too. Motion is limited in these ways.   I can extend my arm and turn palm upside down. The pain has been interfering with changing clothes or washing my hair. The pain is pretty severe but not unbearable. \n\nThe skin isn’t bruised. Doesn’t appear to be any super significant swelling. \n\nIs this something I should go to the doctor for? If it is bicep tendinitis, sounds like most treatment is at home care. I’m in college so I have to carry my backpack (which can be pretty heavy), and I also have chemistry lab which would require a fair amount of arm movement (pretty much any movement of the arm causes pain). Beyond that I could rest it. So is it worth getting checked out or do you think it could subside on its on? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc", "subreddit_subscribers": 75303, "subreddit_type": "public", "thumbnail": "self", "title": "Sharp Pain in Upper Arm", "url": "https://www.reddit.com/r/AskDocs/comments/9w85le/sharp_pain_in_upper_arm/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_cakeday": true, "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541246162, "domain": "self.AskDocs", "full_link": "https://www.reddit.com/r/AskDocs/comments/9tticj/bruise_like_pain_beside_a_cut/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9tticj", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskDocs/comments/9tticj/bruise_like_pain_beside_a_cut/", "pinned": false, "pwls": 6, "retrieved_on": 1541246162, "score": 1, "selftext": "Hi. I’m 18F, 5’6”, 175 pounds, white. Issue began around 12 hours ago and is on my forearm. No recreational drugs or smoking. Medications include Wellbutrin and Apri, for depression and dysmenorrhea. \n\nI was doing work outside and got a relatively minor cut on my the outside of my forearm arm—was definitely not even close to deep enough for stitches from was deep enough for the skin to separate a little bit (I’d say maybe 1/8 of an inch deep?). It’s about two inches long. Bleeding stopped in a few minutes. \n\nMy concern is next to the wound, probably like an inch away, there’s pain when I push on it, like a bruise. Nothing visible on surface of skin that would indicate anything is wrong there. If I squeeze my hand tight I can feel the area that feels like a bruise. Is this normal for wounds like this? Most wounds I’m used to are like skinned knees or something more shallow than this and I’ve never had pain underneath the skin beside the cut. \n\nIs this a normal reaction to a cut? \n\nThanks ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc", "subreddit_subscribers": 74375, "subreddit_type": "public", "thumbnail": "self", "title": "Bruise like pain beside a cut?", "url": "https://www.reddit.com/r/AskDocs/comments/9tticj/bruise_like_pain_beside_a_cut/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541000305, "domain": "self.relationships", "full_link": "https://www.reddit.com/r/relationships/comments/9szvlv/is_it_time_for_me_18f_to_end_my_relationship_with/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9szvlv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "new", "link_flair_richtext": [], "link_flair_text": "[new]", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationships/comments/9szvlv/is_it_time_for_me_18f_to_end_my_relationship_with/", "pinned": false, "pwls": 6, "retrieved_on": 1541000306, "score": 1, "selftext": "Michael has been my best friend for years, though we’ve had a lot of struggles. He was abused and as a result has a really bad temper and poor communication skills which has caused a lot of issues, but we can normally get through them. I’ve gone with him to his therapy sessions before to work through some of these issues. \n\nI’ve been a bad friend lately. I’ve been controlling and insecure and worried that he will abandon me as he makes new friends in college. While I’m not trying to make any excuses for me being toxic, a big part of it comes from my mental health, which I’ve been failing at properly working on. \n\nLast week, we got into an argument after he chose to cancel a visit to see me to stay at his campus to go to a friends birthday party. It’s wasn’t fair to say he doesn’t care about me because he cancelled our visit for someone else, but I honestly still am kinda hurt that we had plans and he cancelled them. \n\nHe hasn’t spoken to me since that fight. I apologized to him after spending some time and realizing how terribly I’ve treated him over the past few months by being so needy. In the past week, I actually went to the counseling center on campus. So I’m going to start a long term therapy program, change my depression medications around (though it will be a few weeks until the psychiatrist can see me), and am starting a group therapy for how to have healthy relationships. I’m not going to be cured overnight but I am making the steps to change that I promised him I would in my apology. \n\nHe won’t speak to me, and honestly it’s okay if people get into fights and take time away from each other, but I don’t know if I’m okay with how he treats me when he’s mad. The last thing he said to me is “what the fuck is wrong with you?” (When he does get upset he often says rude things. For example, he’s told me that I’m too fat for a boy to ever be attracted to me. So he does have a history of being pretty toxic to me too). He ignored my apology. But when he’s in contact with other friends, he talks about plans when I visit his campus next (implying he still thinks we are friends and everything’s okay but he is just choosing to not speak to me right now). \n\nI think it’s unfair to completely ignore me for however long he wants, not tell me directly if he’s planning on being friends with me again, and not communicate about this issue at all. This has been a long term problem in our relationship that he says he’ll change but never does. He doesn’t communicate, and when he gets upset (or I get upset with something he does), he disappears until he’s ready to just ignore the issue and act like the fight never happened, so nothing gets worked out. \n\nI realize the fight started from my actions, so it’s not fair for me to say if he’s allowed to be upset or how long he’s allowed to be upset. My issue is that he knows when he completely ignores me that it hurts me, and he’s okay just shutting me out, leaving me to think he’s not friends with me, even though in his mind he thinks he can just come back whenever. \n\nHe’s my best friend and most of the time things are really good. He’s like family to me. But I don’t know if I should hold onto a friendship where the other person won’t communicate to fix our issues and will just ignore me when his temper goes off. We both have serious issues, but I’m the only one who ever admits when I do something wrong. And I’m unable to really fix these issues with him because he won’t discuss our issues. \n\nDo I give him time to contact me because I’m the one that messed up? If so, how long is fair? Do I even have a right to be hurt over how he’s treating me? \n\nTldr: I caused an argument with my friend, so I’m not sure if it’s fair to be upset with how he’s responding, but he constantly chooses to just disappear or say rude things when he gets upset with me for as long as he wants. Since I’m the one that hurt him, do I just be patient, or is it time to end the relationship with him if he doesn’t respect me when he’s upset? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "subreddit_subscribers": 1764042, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is it time for me (18F) to end my relationship with my best friend (18M)?", "url": "https://www.reddit.com/r/relationships/comments/9szvlv/is_it_time_for_me_18f_to_end_my_relationship_with/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540425448, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9r54dj/i_think_i_need_to_go_into_a_hospital_how_do_i/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9r54dj", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9r54dj/i_think_i_need_to_go_into_a_hospital_how_do_i/", "pinned": false, "pwls": 6, "retrieved_on": 1540425449, "score": 1, "selftext": "It’s been my biggest fear and I’ve done everything in my power to avoid it because I know it’s not good for treatment and it’s expensive as fuck and I’ve seen my friends go through it and it seems like a super demeaning experience, but I know I need it or I’m going to do something bad. I’m willing to check myself in voluntarily. \n\nI’m 18 and in my first semester of college. So I’m away from my mom but she still pays my insurance so would be the one paying this bill. I know if I go in for a few days and wouldn’t respond to her, she’d honestly probably call the police assuming something happened to me, and even if she didn’t contact me in those days she’d get the bill anyway. I don’t know how to tell her. When I was diagnosed with bulimia, my parents became hyper-attentive, watching everything I eat, refusing to let me close any doors. My step mom called me “pukey.” I don’t want to go through that again. \n\nI could ask my mom to not tell extended family, which she might abide by. But I don’t want to hurt her or have her constantly worrying about my safety when I get out. I don’t want to go in and fail a semester of college because of it (from being behind), so we have wasted money on both a hospital stay and college. \n\nI’ve tried to think of any option to not go to a hospital. But even if I spoke to a therapist and tried to get help that way, I wouldn’t be able to be honest much without them sending me to the hospital anyway. \n\nHow do I tell my mom I need to do this? And if I do, what if she tells me I don’t actually need to go (which happened a few years ago)? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398813, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I think I need to go into a hospital, how do I tell my mom?", "url": "https://www.reddit.com/r/depression/comments/9r54dj/i_think_i_need_to_go_into_a_hospital_how_do_i/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540378449, "domain": "self.needadvice", "full_link": "https://www.reddit.com/r/needadvice/comments/9qyked/best_friend_stuck_between_choosing_me_and_other/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qyked", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "#cc5289", "link_flair_richtext": [{"e": "text", "t": "Friendships"}], "link_flair_template_id": "f9b02b4e-bce9-11e8-b50e-0ea0d3f4bec2", "link_flair_text": "Friendships", "link_flair_text_color": "light", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/needadvice/comments/9qyked/best_friend_stuck_between_choosing_me_and_other/", "pinned": false, "pwls": 6, "retrieved_on": 1540378450, "score": 1, "selftext": "I have a hard time not taking things personally or jumping to extreme conclusions (“they didn’t text me back so they don’t care about me” type of things). \n\nA few weeks ago, my best friend was told he could get a free ride to visit me at college when another person was driving to the area, but he didn’t know when it was. \n\nHe told me yesterday that it was this weekend that he would be coming, which I was super excited about because I didn’t think I’d be able to see him until we both came home for break. \n\nToday someone asked him to throw a birthday party this weekend at his sisters apartment (so he would have to be there, since it’s his sister’s place). So now he doesn’t know if he’ll take the free ride to visit me or not. \n\nWe’re both freshman in college, and it’s normally expensive to get bus rides to visit each other, so having a free trip would be really nice. And the persons birthday party would be someone he’s only met in his time since he’s went to school, and the person is actually just the roommate of his better friend. \n\nI’m afraid I’m going to overreact and have very hurt feelings if he chooses not to come this weekend (which will probably be the case). They have a plan if they can’t use his sister’s apartment, but I think it’s just that he wants to be there to hang out with them. And I know that that is super reasonable to want to form good friendships in college. \n\nMy issue is that my mind jumps to the idea that he gets to see these people any time he wants—we don’t get to see each other often. And he doesn’t want to sacrifice two days away from them to see who he calls his best friend? And it’s super last minute to ask him to have a birthday party somewhere, so the plans that we (tentatively) had for weeks might be thrown away because someone asked 4 days beforehand to throw a party at a place, where they could do it somewhere else? \n\nPlus the fact that he’s hasn’t been able to make a choice, I interpret it as he doesn’t actually want to visit me but he’s just afraid of telling me no and upsetting me. He asked me what to do but I feel like that’s just him asking me to give him permission to chose a girl he doesn’t know super well (like they don’t even hang out alone together—it’s a mutual friend of theirs that asked to use his sister’s apartment) over me. \n\nMy issue of being hypersensitive is a pretty big issue in my life that I know I have to work on as a whole (and am, but it’s a slow process), but I could use some advice to help calm down in this situation so I don’t freak out on him when it’s probably not appropriate. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "needadvice", "subreddit_id": "t5_2r367", "subreddit_subscribers": 123209, "subreddit_type": "public", "thumbnail": "self", "title": "Best friend stuck between choosing me and other friends... how do I not get my feelings hurt?", "url": "https://www.reddit.com/r/needadvice/comments/9qyked/best_friend_stuck_between_choosing_me_and_other/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540076766, "domain": "self.proED", "full_link": "https://www.reddit.com/r/proED/comments/9pypf0/my_best_friend_called_me_fat/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pypf0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/proED/comments/9pypf0/my_best_friend_called_me_fat/", "pinned": false, "pwls": 0, "retrieved_on": 1540076767, "score": 1, "selftext": "And while being completely aware of how one of my biggest struggles is that I feel unlovable, he told me no guys would be attracted to I reached my goal weight. He’s the only boy who has ever seen me naked too. So the person who knows me best and has seen the most of me told me that. \n\nHe said he knew boys would like me when I was think because back like 4 years ago (before a lot of weight gain), lots of boys were interested in me. He also knows that at that time, 4 years ago, I was diagnosed and being treated for bulimia. \n\nI know this should just be like fuel to try harder to lose weight, but hearing all the thoughts you say to yourself confirmed by the person closest to you, just makes me feel so... hopeless. Even if I try to keep going, he was my only friend, but I don’t know how I’d ever be able to speak to him again. I’m all alone now. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "proED", "subreddit_id": "t5_38934", "subreddit_subscribers": 31303, "subreddit_type": "public", "thumbnail": "self", "title": "My best friend called me fat", "url": "https://www.reddit.com/r/proED/comments/9pypf0/my_best_friend_called_me_fat/", "whitelist_status": "no_ads", "wls": 0}, {"author": "oakleyluver", "author_flair_background_color": "", "author_flair_css_class": "modmsg", "author_flair_richtext": [], "author_flair_template_id": "", "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540013904, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9prkn0/i_pushed_away_the_only_people_i_stayed_alive_for/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9prkn0", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9prkn0/i_pushed_away_the_only_people_i_stayed_alive_for/", "pinned": false, "pwls": 0, "retrieved_on": 1540013904, "score": 1, "selftext": "I was afraid of hurting two people—my mom and my best friend. \n\nMy mom used to call every Friday. She hasn’t called in weeks. She doesn’t text. So I don’t have to worry about her caring. \n\nMy best friend was another issue. But I think he finally got tired of me feeling sorry for myself. Tonight he called me ugly, and fat, and said I cause all my own issues which could easily be solved. He said no boys would be attracted to me until I lost weight. It ended when he said he no longer wanted to speak to me. \n\nSo I guess I got the reassurance I needed. I can leave and it’ll be okay. In fact, my best friend and I had a falling out years ago, where he said he was able to convince himself he hated me. If he could do that once, surely he could do it again and doesn’t really need me here. \n\nI’m allowed to leave and everything will be okay. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 105551, "subreddit_type": "public", "thumbnail": "self", "title": "I pushed away the only people I stayed alive for.", "url": "https://www.reddit.com/r/SuicideWatch/comments/9prkn0/i_pushed_away_the_only_people_i_stayed_alive_for/", "whitelist_status": "no_ads", "wls": 0}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540004423, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9pqmbc/im_going_to_fail_college/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pqmbc", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9pqmbc/im_going_to_fail_college/", "pinned": false, "pwls": 6, "retrieved_on": 1540004423, "score": 1, "selftext": "I haven’t gone to classes in over a week. I can’t bring myself to leave my bed. I’m going to fail all my classes and waste so much money and I just feel like I’m being lazy. \n\nI don’t have any friends here, but any opportunity to make friends I ignore because again, I feel physically incapable of leaving my bed. \n\nAll the other friends I have from home I don’t even respond to, but when I do I push them away because I assume they all hate me. \n\nSo I’m stuck feeling so lonely and isolated but can’t make an effort to fix it, and any conversation I do have, I always end up thinking “they don’t care about me anyway.” \n\nI can’t function any more, but I don’t know how to fix it, and even if I did, there’s no fix fast enough that could help me before I ruin everything in my life. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397925, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I’m going to fail college", "url": "https://www.reddit.com/r/depression/comments/9pqmbc/im_going_to_fail_college/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "can_mod_post": false, "contest_mode": false, "created_utc": 1539305926, "domain": "self.femalefashionadvice", "full_link": "https://www.reddit.com/r/femalefashionadvice/comments/9nfrkp/help_finding_my_size/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9nfrkp", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/femalefashionadvice/comments/9nfrkp/help_finding_my_size/", "pinned": false, "pwls": 6, "retrieved_on": 1539305928, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "femalefashionadvice", "subreddit_id": "t5_2s8o5", "subreddit_subscribers": 599516, "subreddit_type": "public", "thumbnail": "self", "title": "Help finding my size", "url": "https://www.reddit.com/r/femalefashionadvice/comments/9nfrkp/help_finding_my_size/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "can_mod_post": false, "contest_mode": false, "created_utc": 1538975852, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9mc3ce/every_time_i_reach_out_for_help_i_feel_worse/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9mc3ce", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9mc3ce/every_time_i_reach_out_for_help_i_feel_worse/", "pinned": false, "pwls": 0, "retrieved_on": 1538975852, "score": 1, "selftext": "I try to tell friends and family how bad it is getting. I’ve told my friend not to buy me a birthday gift for next month because it’ll be wasted money because I won’t be around. \n\nNo one seems to care. I think they don’t believe me. I don’t know. \n\nI’m so lonely at college, I don’t know anyone here and all my friends and family are hours away. Even when I do talk to them, I’m to depressed to be able to carry on a conversation. \n\nI don’t remember what being happy feels like. I keep reaching out for any reason to hold on but each time I do I feel like I just keep getting pushed closer to doing it. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 104371, "subreddit_type": "public", "thumbnail": "self", "title": "Every time I reach out for help, I feel worse", "url": "https://www.reddit.com/r/SuicideWatch/comments/9mc3ce/every_time_i_reach_out_for_help_i_feel_worse/", "whitelist_status": "no_ads", "wls": 0}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "can_mod_post": false, "contest_mode": false, "created_utc": 1538886539, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9m2iz6/im_so_lonely/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9m2iz6", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9m2iz6/im_so_lonely/", "pinned": false, "pwls": 0, "retrieved_on": 1538886539, "score": 1, "selftext": "Every day I just feel so alone. Even with I’m with people I feel like an outsider. I’m at college and have no friends—I could probably go whole days without speaking any words. I eat all my meals alone. I do everything alone. \n\nI feel my friends from high school growing apart from me. I have no one. If I do have conversations with old friends, I’m too depressed to even have words to say, which just pushes people away farther. \n\nI think this is just who I am. Everyone says things get better but they just don’t. I was told that boys didn’t like me in high school because they were dumb and things would be different in college. I knew it was bullshit when they said it but now that’s shown I won’t ever be able to get anyone romantically interested in me, it still hurts. \n\nI don’t want to live long enough to see myself desperately want a family and be unable to get one. I don’t want to be alive to live every day in isolation. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 104266, "subreddit_type": "public", "thumbnail": "self", "title": "I’m so lonely.", "url": "https://www.reddit.com/r/SuicideWatch/comments/9m2iz6/im_so_lonely/", "whitelist_status": "no_ads", "wls": 0}, {"author": "oakleyluver", "author_flair_background_color": "", "author_flair_css_class": "-035lbs", "author_flair_richtext": [], "author_flair_template_id": "9fa877c8-c3a4-11e5-b5fe-0e2ce0f5159f", "author_flair_text": "18F 5'6\" SW: 232 CW: 195 GW: 140", "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "can_mod_post": false, "contest_mode": false, "created_utc": 1537750672, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/9idn5w/feeling_discouraged_after_seeing_a_group_photo/", "id": "9idn5w", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 16, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/9idn5w/feeling_discouraged_after_seeing_a_group_photo/", "pinned": false, "pwls": 6, "retrieved_on": 1537750672, "score": 1, "selftext": "I am used to being the larger one in my friend group, but after losing about 35 pounds, I was starting to gain a little more confidence and just feel.. not quite so big. It's doesn't feel good to be the biggest person in the room. \n\nI took a picture with 3 other friends today, and looking at it, it's clear how much bigger I still am than them. I feel like my waist is double the size of one of my friends. Yes, my BMI is still in the obese range, I don't expect to look slim. When I mentioned it to someone, they said, \"but you won't be big for much longer.\" And I guess that's the logical way to look at it, but I'm feeling discouraged and the thought of having to wait a year until I can be the size of my friends is pretty upsetting. Yes, I get that time will pass anyway so I should just stick with it, and in the grand scheme of things, whatever time it takes to reach my goal weight is not long compared to the rest of my life. But I'm still just disappointed. \n\nI'm not sure if I'm being rational enough that any advice would help, but maybe someone can offer something to help. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_subscribers": 1038750, "subreddit_type": "public", "thumbnail": "self", "title": "Feeling discouraged after seeing a group photo", "url": "https://www.reddit.com/r/loseit/comments/9idn5w/feeling_discouraged_after_seeing_a_group_photo/", "whitelist_status": "all_ads", "wls": 6}, {"author": "oakleyluver", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_jlid5xi", "can_mod_post": false, "contest_mode": false, "created_utc": 1536092211, "domain": "self.Pitt", "full_link": "https://www.reddit.com/r/Pitt/comments/9czazq/why_does_markettogo_smell_so_bad/", "id": "9czazq", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "permalink": "/r/Pitt/comments/9czazq/why_does_markettogo_smell_so_bad/", "pinned": false, "retrieved_on": 1536092212, "score": 1, "selftext": "I don’t know if I’ve ever smelled anything worse ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Pitt", "subreddit_id": "t5_2rhsl", "subreddit_subscribers": 6582, "subreddit_type": "public", "thumbnail": "self", "title": "Why does Market-to-Go smell so bad?", "url": "https://www.reddit.com/r/Pitt/comments/9czazq/why_does_markettogo_smell_so_bad/"}]}