{"data": [{"author": "orangey75", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eqiqk9d", "can_mod_post": false, "contest_mode": false, "created_utc": 1539519532, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9o2aom/my_life_is_a_mess_and_my_boyfriend_doesnt/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9o2aom", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9o2aom/my_life_is_a_mess_and_my_boyfriend_doesnt/", "pinned": false, "pwls": 6, "retrieved_on": 1539519533, "score": 1, "selftext": "This is definitely going to be a long post. I really need to vent so I might just blurt out my whole life story. I don’t actually really know where to begin. I just made a reddit account because I felt like I had nowhere else to turn to and I realized that there was a subreddit here for people who struggle like me.\n\nI’m a 17 year old girl in my last year of high school. Ever since before I could remember, I’ve struggled with really bad anxiety. I worried about everything, no matter how big or small the issue was. This anxiety that I’ve lived with for so long was definitely hereditary, as my dad has many mental health issues and so does everyone in his family. These issues have also been circumstantial. \n\nAll my life, all I’ve known was fighting. My parents constantly fought when I was a baby, up until one day when I was about 3 or 4 years old my mom decided she had enough and she up and left my dad and took me with her. I still saw him regularly, but my mom and I moved in with my grandparents (my mom’s parents) until we could find our own place. My grandparents were like a second set of parents for me and we became so close. I’m grateful for that. \n\nFast forward some years and I’m maybe 7 or 8. My dad was a cranky bastard at that time, and sometimes I felt scared of him. I think he might’ve been physically abusive when I was a toddler, but sometimes I can’t tell nightmares from what really happened because I was so young. I left my dad’s house one day after a weekend visit. He told me he’d call me like he always does sometime the week. He ended up never calling. I never heard from him or my aunt and uncle on that side of the family for 8 more years. \n\nShortly after my dad abandoned me with no explanation, my mom met this guy who she started dating. He was awesome at first. He was funny and a good cook and I felt like I could talk to him about anything. Finally, another father figure to fill my empty void of being forgotten. Things were great until he moved in. I realized this guy was an alcoholic, like his own father. My mom and her boyfriend fought every night and day, and eventually it became physical. I would hear him beating the shit out of my mom every second night, but I was young and afraid. I felt helpless. These fights made me feel like I was suffocating inside. At this point, I didn’t know it was anxiety.\n\nOne night once my mom had went to sleep before her boyfriend, and I was having trouble sleeping. I went into the hallway outside of their room and asked for my mom, but her boyfriend came in instead. I didn’t care, because every time they fought we forgave him and things went back to normal for another few days. I told him I couldn’t sleep and I felt scared of the dark, or something dumb like that. He kneeled beside my bed and talked to me for a while, drunk off his ass. I laughed and smiled and was happy that I got to stay up later talking to someone. Soon enough, my mom’s boyfriend crawled into my bed with me. I was kind of wary about it, but I shrugged it off. \n\nHer boyfriend began to spoon me, holding me very tightly. I was so uncomfortable, and I asked him multiple times to go back out to his own room. He ignored me, and eventually I felt a boner growing in his pants. I was horrified and confused. He was drunk and wouldn’t let me go. Eventually, my mom woke up and he retreated back to their room quickly, acting like he didn’t do anything. I don’t think I slept that night.\n\n4 years ago, my nan passed away. The nan I grew up with and was raised by. We watched her suffer from cancer and tumours for 2 years, and we knew it was coming, but that didn’t make it any easier. I delivered the eulogy at her funeral with my cousins, and I still feel my grandpa’s heart break every time he talks about her. \n\nI felt like a part of my heart was missing at this point. Not too long after my nan’s passing, my mom finally dumped her piece of shit boyfriend. He tried so hard to worm his way back into our lives, but my mom gathered up whatever strength she had left from her mother dying and told him to get the fuck out. She didn’t know about the bed incident at this point, and I never planned on telling her.\n\nI started 9th grade with some hope. It was my last year of middle school (junior high is 7-9 here) and my mom’s shitty boyfriend that I had to deal with for 5 years was finally gone. I had funny, great friends who were there for me through everything, and I was actually excited to get up for school in the mornings.\n\nIn December of 9th grade, I went to a local hockey game like I always do with my grandpa. I always knew that my dad worked in hockey rinks when it was time for the season, but I never expected to see him again. One night, I found my dad at the rink and we reunited. It was like the empty hole that I had from my nan dying was refilled. I had hope again and I finally got to see someone I missed dearly. Reuniting with my dad then is a moment that I’ll never forget. I started going to his house on weekends, and even stayed with him the following summer. It was amazing. \n\nA month into 9th grade, I started talking to this boy. I’ll say his name is Jared for privacy purposes I guess. I knew Jared in 8th grade. He was a weird kid, but everyone liked him, and he was into the fine arts and all of that impressive stuff. He’s very talented. I had never had a boyfriend before, and the more we got to know each other in math class, the harder and faster I was falling. Everyone knew we liked each other, and the only people denying it was ourselves. Eventually, my best friend got us together, and I finally had my first boyfriend.\n\nThe first few months together were so great. I felt so comfortable, and not only was he my boyfriend, he was also a best friend. I went to his house every Monday after school, and we played video games together and made out. I was so, so in love. I think I’ll always care for him in a way.\n\nAbout 5 or 6 months in, almost towards the end of the school year, things started to get rocky. We always found ourselves fighting, and my boyfriend at the time was so incredibly indecisive. A bunch of conflict led to me breaking up with him. I didn’t think it was the right choice at the time, but I was dumb and did it out of impulse anyways, thinking I was doing the right thing. \n\nAfter talking we both agreed we still wanted to be together. My boyfriend was going on a summer trip to Europe with his choir, and he told me that once he got back we would get back together. We shared one last kiss after he walked me home on the last day of school, and that was it.\n\nIt was late July when I realized that Jared must of been back by now. I texted him, and he revealed to me that he had been back for a week. I was confused, remembering that he told me he would reconnect with me as soon as he got back. He then out of the blue told me he wanted to just be friends. I didn’t know how to react. I was angry, and so upset. I was cold and stern with him at this request, and ruined any chance I had at maintaining a friendship with him. We didn’t text again after that for the whole summer, and completely forgot what we had together.\n\nI was heartbroken. Heartbreak is the most painful thing I’ve ever felt and I would take a bullet if it meant I never have to feel it again. He was my first love. I know this sounds dumb, because I was only turning 15, but I really did love him, and he loved me. \n\nSeptember of that year I was due to start high school. I had already acknowledged the fact that I had anxiety at this point. My dad helped me deal with it, because he has the same issues. I was anxious about starting high school, and had panic attacks almost every day leading up to the first day. I was nervous about seeing my ex again, and I was sad that I lost all of the friends that we shared because of our breakup. I still had my close friend group consisting of 3 girls.\n\nI got through my first day of high school, and evidently hated it. I despised it, actually. The school has 1200+ people, a way bigger number compared to my student body of 400 in middle school. I hardly saw anyone I was familiar with, and didn’t have any friends in any of my first semester classes.\n\nI cried almost every day I came home. I gave up on my studies, and barely tried in math. This resulted in a 29% at the end of the course. I was never good at math, but this became so much harder than I ever expected. \n\nI stopped going to school every day of the week. I could only go 4 days at most, 5 was too much to handle. I stopped caring about my appearance, stopped reaching out to my friends, never did homework and spent all of the time I could in bed. I had to deal with seeing my ex boyfriend whom I still loved by my locker everyday. I felt so detached from the world, like my childhood was ripped from my hands so quickly.\n\nAfter I flunked grade 10 math in the first semester, I figured I’d just do summer school to get it out of the way. Second semester wasn’t as bad, because I knew summer was closer and closer. I eventually finished 10th grade with everything but those 2 math credits. I couldn’t attend summer school because my mom couldn’t afford it at the time, so I figured I’d just redo the course in the first semester of grade 11 and do grade 11 math in the second semester. \n\nI was so happy all of the summer. I got to spend a lot of it with my dad, and I was finally able to get rid of this terrible numbness I had for all of winter and most of 10th grade. Softball is a big part of my life. It’s a family thing, and I went to every game at the field with my grandpa to see my uncle play. Everyone at the field knows me, and I really felt like I belonged.\n\nWhen summer started to draw to a close, I could feel that despair start to set in again. The unfortunate truth that I had to return to that hell hole for another year. I was nervous about math, and the winter.\n\nJust as I thought, things became even harder that year. I failed 10th grade math again, and my attendance seemed to drop even more than it had in 10th grade. The funny thing is, I didn’t care. I didn’t care at all, actually. I didn’t care about finishing high school or my social status, I just wanted to die. By February/March of this year, I was at rock bottom. I had breakdowns in school, and cried to my mom, begging to come home over the phone. I couldn’t handle being there anymore. One day, I sat down with my mom and looked her in the eyes and told her how badly I was struggling. How badly I wanted to just not exist. I’ve tried to open up to her about this before, but this was the first time she actually listened to my cries for help. She kept me home for a few weeks, and scheduled an appointment with my guidance counsellor and another with my family doctor.\n\nI went to my family doctor and told her everything I’ve been feeling up until that point. I knew what was coming. She diagnosed me with anxiety and depression, and prescribed some antidepressants to me.\n\nAfter this, we went to the counsellor. We told him everything, and after a long chat we worked out a plan. He dropped 2 classes from my second semester schedule to make it ‘easier’ for me. At the time, that felt relieving. I only had 11th grade English with my favorite teacher and art class. Things somehow got harder, though.\n\nOnly having 2 classes and such big gaps in my schedule made me not want to attend anymore. I still just didn’t care. My antidepressants were making me more suicidal than I was, and I genuinely couldn’t feel a thing in my body. I couldn’t feel emotions, couldn’t cry, and I was never hungry.\n\nI somehow managed to survive the rest of the year, rushing in last minute things to pass the two courses. It dawned on me that I was about to head into grade 12, my final year of school, and I still didn’t have any math credits. You need 4 math credits to graduate, meaning you could only do grade 10 and 11 math if you were in a tight spot like me. I decided to discuss this with a teacher once I returned to school in September.\n\nMy dad and I got into a huge fight around April or May of this year, and we barely contacted each other because of it. We only just recently reconnected again.\n\nSo, the summer began, and I got back into my grind of getting to be happy again. I spent a lot of time with my grandpa, whether it was softball or road trips to his home town. I was so happy again.\n\nIn August, I decided to download Tinder. I wasn’t expecting much of it, only some horny guys asking for my snapchat and maybe a few swipe rights. I matched with a cute ginger guy a few days into having the app, who is now actually my boyfriend.\n\nWe talked for hours and hours for at least two days, and I proposed that we made plans to meet and hangout in person for the first time. We did it and hit it off so well. I had never felt so connected with a guy, not even my first love. Before I knew it, we started dating on my birthday, August 19th.\n\nIt felt great to finally experience something like this again. To have a stupid boy think I’m pretty. I felt like I deserved it after these shitty few years.\n\nI started going to my boyfriends house, and due to my anxiety, I didn’t really connect with his parents and was too afraid to introduce myself. I didn’t want to seem rude, that’s the last thing I wanted, but apparently it came off that way. As of the day this post was written, his parents still don’t like me.\n\nMy boyfriend figured out not that long after we started dating that he was moving 3 hours away. We were both so upset, but convinced each other that we’ll make it work. He’s also moving to a whole other province sometime next year to train to be a police officer, which will make things even harder if we’re still together.\n\nThis Friday is our 2 month anniversary. (He’s a year older than me, btw. He graduated in June) Now that I’m back to school, I’m still experiencing the same problems with depression, and as of this post being written, I haven’t been to school in 2 weeks. I can’t sleep and don’t feel a lot of emotion. I opened up to my boyfriend about these issues about a month into our relationship, and he’s been indifferent. He’s claimed he doesn’t really believe in mental issues, and tonight he admitted to me that he thinks I’m looking for pity and attention. I had a breakdown tonight about school, and told my mom that I can’t go back, because I truly feel that I can’t. She said if worst comes to worst I’ll drop out and work until I can get my GED. I told my boyfriend of this plan, and he was appalled. He’s rich and smart, I’m the complete opposite. I feel like I’m dragging him down and holding him back. He doesn’t need a high school dropout. And things are going to be so much more difficult once he moves 3 hours away. We only see each other once a week now and his parents don’t like me. I feel so guilty, because everyone that cares about me is counting on me to graduate, but what if my mom’s plan is the best option? My boyfriend said he likes strong, independent people and lately I haven’t been that, according to him. I love him, but we fight every night. He judges me whenever I talk about how hard school is for me. \n\nWhile the guilt was eating away at me, I decided to try and do some of the work that I’ve missed within the past two weeks and I told myself I’d go back to school soon, for him. But now that I’m sitting here writing this long ass post, having not actually started any work, I don’t know what’s good for me anymore. If I was dead, this would be easier. I don’t think my heart can handle a breakup right now, but he’ll probably dump me for being a depressed bum even though he promised me he never would.\n\nI told all of my life traumas to you guys to make you understand why I’m the way that I am. If my boyfriend won’t understand, I just want someone else to.\n\nI’m so lost", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 395946, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "My life is a mess, and my boyfriend doesn’t understand my depression and anxiety", "url": "https://www.reddit.com/r/depression/comments/9o2aom/my_life_is_a_mess_and_my_boyfriend_doesnt/", "whitelist_status": "all_ads", "wls": 6}]}