{"data": [{"author": "Ouranor", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_13yc1z", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540673716, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9rxnt3/helping_a_friend_in_need/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9rxnt3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9rxnt3/helping_a_friend_in_need/", "pinned": false, "pwls": 0, "retrieved_on": 1540673717, "score": 1, "selftext": "Hey guys\n\nI‘m not sure if I‘m allowed to post questions here that are not about me specifically, so please do delete if I‘m violating any rules!\n\nFirst off, a little bit of context: I‘m currently attending a school that preps us for higher studies at a university (don‘t ask, it‘s complicated lol). It‘s been really fun and fulfilling so far, but is also now, after our vacation days, starting to become more challenging.\n\nAnyhoo, I have this classmate (male, late thirties) who fell quite ill, was hospitalized and then fell into a deep depression. According to him, he gets these deep depression every couple of years and knows how to deal with them. It‘s been up to me to gather homework and keep track of what we‘ve learned at school to facilitate an easier return for him. I’m glad to help however I can and see it as an opportunity to get better organized :). Btw, our school and teachers deserve a huge shoutout here, they‘ve been amazingly supportive!\n\nAnyway, I‘ve been quite hands-off with him, simply asking him what he needs and how I can be supportive. He told me that he needs more rest and that he‘ll call me next week. I of course respect his wishes, but here‘s the thing: he‘s been saying that for the last two weeks. \n\nNow, he‘s been missing school for several weeks, and might miss the next couple of weeks as well (let‘s hope not). I wasn’t kidding when I say that this school is getting tougher, even with us (classmates and teachers) doing our best to „compress“ all of the new material down to its bare minimum.\n\nI‘m reaching a point where I might need to insist to have a more „serious“ talk with him, to let him know that the load isn‘t getting any smaller, aka that we need to actually sit down and organize soon-ish, but that I and everyone else (we‘re a very small class and are close) are also there to support him every step of the way. I do NOT want to put on any pressure, but I also want to be real with him. I have diagnosed depression myself, but it‘s mild and I know how to cope when it hits. I have NO CLUE how to deal with someone who completely isolates himself.\n\nALSO: I know that his mental health and career are not my responsibility. But I do want to do more than just throw the pile of work at him (if he lets me, I won‘t push if he doesn‘t).\n\nIn short: I really care for him and don‘t want to make his depression worse, but I DO need to talk to him about work soon. Nobody in the school wants him to quit because he is an awesome guy and would be missed if he left. He also keeps insisting that he misses us and wants to come back. Do you guys have any advice on how to approach this the right way? Is there anything specific that you guys would appreciate to hear if you were suffering and can’t get out of bed? As far as I‘m concerned, an honest inquiry from the heart never hurt anyone, but I don‘t have the experience to be sure. It also hasn‘t done much so far...\n\nThank you guys SO much for your time. Apologies again if this doesn‘t belong here.\n\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 399594, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Helping a friend in need", "url": "https://www.reddit.com/r/depression/comments/9rxnt3/helping_a_friend_in_need/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Ouranor", "author_flair_background_color": "", "author_flair_css_class": "-020lbs", "author_flair_richtext": [{"e": "text", "t": "27/F/5'7.5\" | SW: 282 | CW: 258 | GW: 176"}], "author_flair_text": "27/F/5'7.5\" | SW: 282 | CW: 258 | GW: 176", "author_flair_text_color": "dark", "author_flair_type": "richtext", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1522958773, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/8a318k/why_cant_i_freaking_stick_to_it/", "id": "8a318k", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/8a318k/why_cant_i_freaking_stick_to_it/", "pinned": false, "retrieved_on": 1522960942, "rte_mode": "markdown", "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_subscribers": 788629, "subreddit_type": "public", "thumbnail": "self", "title": "Why can’t I freaking stick to it.", "url": "https://www.reddit.com/r/loseit/comments/8a318k/why_cant_i_freaking_stick_to_it/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1521126380, "domain": "self.offmychest", "full_link": "https://www.reddit.com/r/offmychest/comments/84n55c/naw_my_father_and_his_sister_have_fucked_up_one/", "id": "84n55c", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/offmychest/comments/84n55c/naw_my_father_and_his_sister_have_fucked_up_one/", "pinned": false, "retrieved_on": 1521175180, "rte_mode": "markdown", "score": 1, "selftext": "Obviously, I am far from the only one to have an issue with my father and his behaviour. But still. Fuck him.\n\nI am now at an age where I not only see what he pulls, but I also see the web of lies and the patterns of the disfunctional, fucked-up side of his family. How willing they are to guzzle down his every fucking lie as long as it makes them look good. How willing they are to sugercoat everything, just to protect their sweet brother/son. I see it all, and I'm sick of it. Now that he is actively preventing me from moving ahead in life, making me go through every single authority to get the document I need, I am just about done. After years of trying to do the right thing, to be understanding, to be kind, I'm done.\n\nHis sister, my aunt, says that I'm an angel with devil's horns when asking hard-hitting questions. Oh lady, you ain't seen nothing yet. I will show you what happens if you pull your crap for too long. There is no going back, I'm quitting this family and telling every single one of them exactly WHY. I hope my grandmother can forgive me, because she's the only sane one.\n\nYou will say that I'm crazy, that I'm evil after I'm gone, but the damage will be too great, and I will still be the winner. For the longest time, I went the road of understanding and \"there should be no winner, but at least a compromise\". Well, FUCK THAT. You are too comfortable in your bubble, and I'm about to burst it.\n\nI will burn every bridge necessary to make you pay for the decades of silence, ignorance and bullshit you piled on me and my siblings. We don't need you, you don't deserve us. You will pay for constantly lying to me. I will fuck you up, and you will know what it's like to have made a grave fucking mistake. You will know what it's like when you antagonize an entire fucking generation in your family. And you will stop insulting and putting the full blame on my mother, because at least SHE was there and owned up to her mistakes. She is a thousand times the person than any of you combined, you inbred fucking pieces of delusional garbage.\n\nDad, no - Martin. You are not my father anymore. I will keep this farce up until I get what I want from you, and then you. are. OUT. Then again, that's exactly what you want. You keep telling everybody how much you love us, how you keep photographs of me in your drawer because you DO love me OH so much.\n\nOnly to turn around and show me your true colours every. single. time. You think you can hide forever? You think you can pull this crap off for much longer? No. No more. You will pay, if not in this life, then surely the next one or the one thereafter.\n\nI am patient. I can wait. You will pay.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "offmychest", "subreddit_id": "t5_2ranw", "subreddit_subscribers": 462306, "subreddit_type": "public", "thumbnail": "self", "title": "(NAW) My father and his sister have fucked up one too many times. It's over.", "url": "https://www.reddit.com/r/offmychest/comments/84n55c/naw_my_father_and_his_sister_have_fucked_up_one/", "whitelist_status": "house_only"}, {"author": "Ouranor", "author_flair_background_color": "", "author_flair_css_class": "-020lbs", "author_flair_richtext": [{"e": "text", "t": "27/F/5'7.5\" | SW: 282 | CW: 258 | GW: 176"}], "author_flair_text": "27/F/5'7.5\" | SW: 282 | CW: 258 | GW: 176", "author_flair_text_color": "dark", "author_flair_type": "richtext", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1519199126, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/7z3wgx/waking_up_after_a_binge_and_it_feels_different/", "id": "7z3wgx", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/7z3wgx/waking_up_after_a_binge_and_it_feels_different/", "pinned": false, "retrieved_on": 1519264911, "rte_mode": "markdown", "score": 28, "selftext": "Awww man. Been slowly and steadily losing weight since the beginning of February, but I always derail after 2-3 weeks and/or when I approach the 250lbs mark (what the heck is THAT about anyway). \n\nI \"binged\" on Pizza and truffle chocolates last night and I gotta say that while it was worth it in the moment, it was NOT worth it waking up, reflux and extreme sluggishness only being the beginning. Never felt this physically terrible after a binge. My tummy hurts really bad, those truffle chocolates fucked me UP T_T. The pizza itself was \"only\" 800 cals, but those truffles were easily 1'200 calories, like hotdamn. My body was like \"wtf woman, SUFFER!\" lol\n\nWell, NO MORE! This is a setback, not a k.o.! I will continue doing my thing, with renewed focus and persistence.\n\nGonna take it easy today to give my digestion time to recover and will have a light dinner tonight. Not to cut calories to \"make up\" for the binge, but to seriously just be kind to my poor body.\nThe way I ate until now worked perfectly, I was never hungry and I ate delicicous home-made cooking every day (#tootingmyownhorn). I even left my purse at home so I won't be tempted to go buy stuff again. This is a resoluteness I never knew I had lol.\n\nI wish everybody who reads this a successful Wednesday :D!", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_type": "public", "thumbnail": "self", "title": "Waking up after a binge, and it feels different", "url": "https://www.reddit.com/r/loseit/comments/7z3wgx/waking_up_after_a_binge_and_it_feels_different/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": "-025lbs", "author_flair_richtext": [{"e": "text", "t": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176"}], "author_flair_text": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176", "author_flair_type": "richtext", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517834355, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/7vehgw/uh_oh_big_celebration_coming_up/", "id": "7vehgw", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/7vehgw/uh_oh_big_celebration_coming_up/", "pinned": false, "retrieved_on": 1517882753, "rte_mode": "markdown", "score": 2, "selftext": "Hey y'all\n\nI really just want to vent and put my thoughts out there, my apologies if the stream of thought doesn't make sense... Anyway, after starting (yet again) on CICO after falling off the bandwagon hardcore over the holidays and then some, I really got a grip on things this time. Something clicked, and all was right and worked and the weight dropped. I feel excellent and I know: This time is different.\n\nLast week was AMAZING. I felt like \"normal\" person and everything in my life (groceries, cooking, household etc) clicked into place. Regular, homecooked meals, a body that immediately adapted to the 1'300 calories a day that make me fully satisfied, and my mind was finally saying: \"This is how it's gonna be from now on and look, it's all right!\"\n\nBut today's my mum's 50th birthday, and I found myself thinking about the food days in advance, actually worried about fucking things up again. We're eating out tonight, and I only have 700 calories left. My mind, of course, keeps trying to reassure me that it's alright, that it's only one celebration and that things will be normal again the next day. I'm not used to worrying about that so much, and I don't think it's healthy. So for tonight, I'm going to have that amazing steak, and I WILL have some dessert, goshdarnit! My journey is far from over, and this, compared to the bigger picture, is nothing. It's a day of celebration, not worry. At least it should be.\n\nI guess I was just weirded out by how my mind just kept circling \"oh my gosh, oh my gosh ohmygosh you're gonna wake up 5kg heavier\" which is NONSENSE.\n\nSo yeah. I'm just gonna enjoy tonight :)! Things will be fine!", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_type": "public", "thumbnail": "self", "title": "Uh oh... big celebration coming up!", "url": "https://www.reddit.com/r/loseit/comments/7vehgw/uh_oh_big_celebration_coming_up/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": "-025lbs", "author_flair_richtext": [{"e": "text", "t": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176"}], "author_flair_text": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176", "author_flair_type": "richtext", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517003725, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/7t80me/threw_away_15_bucks_worth_of_food/", "id": "7t80me", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 32, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/7t80me/threw_away_15_bucks_worth_of_food/", "pinned": false, "retrieved_on": 1517069639, "rte_mode": "markdown", "score": 45, "selftext": "I keep falling back into the binge eating, but I remember reading a post on here talking about how you can stop a binge ANY. TIME. So tonight, I got me a cheeseburger, some chicken nuggets and my favourite pizza, even though I KNEW that it wasn’t what I wanted (how does this keep happening, wtaf). I ate 3/4 of the cheeseburger, 3 nuggets and half the pizza before my brain finally kicked back into normal gear again.\n\nI‘ve kept the 4 leftover nuggets for tomorrow (combining it with vegetable salad for lunch), but the cheeseburger and pizza are in the garbage.\n\nI‘m not proud of myself, but it‘s the first time I‘ve thrown out food that I ordered. Maybe as time goes on, I will manage to stop ordering food altogether. I‘ve done it before, albeit only for 3-4 weeks at a time.\n\nGood luck to all of you, and have a great weekend!", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_type": "public", "thumbnail": "self", "title": "Threw away 15 bucks worth of food", "url": "https://www.reddit.com/r/loseit/comments/7t80me/threw_away_15_bucks_worth_of_food/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1515169692, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/7ocah2/i_deeply_resent_people_with_mental_illness/", "id": "7ocah2", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/7ocah2/i_deeply_resent_people_with_mental_illness/", "pinned": false, "retrieved_on": 1515223166, "score": 1, "selftext": "(Not sure if this needs a trigger warning?)\n\nBasically what the title says. I am absolutely, 100% torn at all times about sentiments like these, because I am fully aware of how hypocritical and awful they are. But I really want to put them out there, in the hopes of lessening my own burden, maybe.\n\nLet me try to explain as badly as I can:\nThe issue is that I have had depression since I was a child (among other things), but I can still function as a sibling, offspring, friend and employee. The guilt and sense of duty I feel towards any work (that I don't give a damn about) makes me get out of bed. So when I see all the depressed people that are literally unable to leave their homes, live on benefits and are objectively worse off than I am, I STILL deeply resent them for getting what I myself \"hope\" for. You know, being left alone all day, not really taking responsibility for my life, wasting away in peace etc... I OBVIOUSLY know that I should consider myself lucky to NOT have this bad of a depression (I have diagnosed moderate depression with bouts of heavy episodes). But I am jealous, resentful, bitter and only stop myself from actively saying these things because I like to think that I have SOME shreds of compassion and decency left. And I realize how wrong I am about this, but the thoughts just keep coming back.\n\nOn good days, I feel nothing but empathy towards the people that are suffering and count my blessings. But on bad days, like today, my mind goes incredibly dark. My first reaction to most people talking about their struggles is something along the lines of \"Yeah, go ahead. Please DO stop bitching and DO kill yourself, you're literally a failed and broken piece of human engineering that should be prevented from ever reproducing or wasting our limited resources.\", among other things. I used to be horrified and shocked at the dark and violent thoughts (a hankering for Eugenics, how freaking charming indeed) towards the mentally ill and the handicapped, but now I've grown almost used to them. I realize that this is worrying, even if it IS only inside my own head for now. Maybe an interesting note: I have an uncle that has been severly handicapped his entire life (unable to walk, speak, eat, live on his own. He's a gross baby in an 50-year old body) and has been nothing but a huge burden to the entire family. He is loved, but let's be real. If they could choose again, my grandmother and her other children would do some serious thinking.\n\nStill, I rightfully feel like a piece of shit, and all these dark thoughts obviously apply to me as well. But I do not hate myself. I just accepted that I am resentful and bitter and terrible, and that there are numerous reasons why I will not find happiness with other people in this life unless I manage to curb my awful, mean-spirited streak.\n\nI guess what I want to know is if anybody can relate, or if I'm really alone in my awfulness. I also tried googling if maybe this \"penchant\" for viciousness aside from depression has a name/diagnosis, but I couldn't really find anything. Though you might not believe it, I have a huge capacity for love. I love whole-heartedly, but I lack in the empathy and patience department I guess. I always wanted to be kind, but I get the feeling that I simply don't have it in me. At least not in this life.\n\nAnyway, I do feel a bit better now already. I console myself with the (false?) thought that these sentiments are not \"me\". They come from withing me, but that's about it.\n\nI gotta stop, this has become too long. Despite all I have said, I do sincerely wish everyone reading this a great day and a successful weekend.", "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I deeply resent people with mental illness, despite being diagnosed myself.", "url": "https://www.reddit.com/r/depression/comments/7ocah2/i_deeply_resent_people_with_mental_illness/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": "-025lbs", "author_flair_text": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1512501317, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/7hs04l/cauliflower_rice_is_dope/", "id": "7hs04l", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/7hs04l/cauliflower_rice_is_dope/", "pinned": false, "retrieved_on": 1512580833, "score": 1, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "subreddit_type": "public", "thumbnail": "default", "title": "CAULIFLOWER RICE IS DOPE", "url": "https://www.reddit.com/r/loseit/comments/7hs04l/cauliflower_rice_is_dope/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": "-025lbs", "author_flair_text": "27/F | 5'7.5\" | SW: 282 | CW: 258 | GW: 176", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1507584011, "domain": "self.loseit", "edited": 1507585598, "full_link": "https://www.reddit.com/r/loseit/comments/75cajm/weight_loss_goals_with_a_little_twist/", "id": "75cajm", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 14, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/75cajm/weight_loss_goals_with_a_little_twist/", "pinned": false, "retrieved_on": 1507666343, "score": 12, "selftext": "Hey lovely Loseitians!\n\nTo motivate myself a bit more, I thought of something that might give me a chuckle every day (because I find myself hilarious, please bear with me)!\n\nI am a Zelda fan, so I figured: Why not create different \"weight-classes\" with really achievable, steady goals or, as I prefer to say, levels? To show you what I mean, here's what immediately came to mind:\n\n\nLEVELS (KG / LBS / Achievement date)\n\n\nHinox: 115 / 253.5 /\n\nLynel: 110 / 242.5 /\n\nDarmani: 105 / 231.5 /\n\nJalhalla: 100 / 220.5 /\n\nGreat Fairy: 95 / 209.4 / \n\nTelma: 90 / 198.4 / \n\nRutela: 85 / 187.4 / \n\nNabooru: 80 / 176.4 / \n\nCremia: 75 / 165.3 / \n\nRuto: 70 / 154.3 / \n\nZelda: 65 / 143.3 /\n\n\nObviously, these are all meant to fit a 5'7.5 female like me, so Mipha was clearly out of the question xD! Honourable mentions go to: Calamity, Lord Jabu-Jabu, Valoo, Great Fairy (BotW, because dang) and Ilia!\n\nWhy did I post this? Because I hope it gives some of you guys a laugh too, and maybe there's even some Zelda fans here that could give me some suggestions what the different levels could be, because none of this is actually based on research/lore, just what I remembered off the top of my head :D! Maybe someone will make a guy version for themselves, too?\n\nAnyway, I hope you all achieve your goals and have a fabulous day! Ouranor out :)!\n\n*Edit: Is it just me, or is reddit on pc a nightmare for layout freaks like me xD?*\n", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "thumbnail": "self", "title": "Weight loss goals with a little twist...", "url": "https://www.reddit.com/r/loseit/comments/75cajm/weight_loss_goals_with_a_little_twist/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": "blank", "author_flair_text": " ", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1506461824, "domain": "self.loseit", "full_link": "https://www.reddit.com/r/loseit/comments/72nnyp/stress_binge/", "id": "72nnyp", "is_crosspostable": true, "is_self": true, "is_video": false, "locked": false, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/loseit/comments/72nnyp/stress_binge/", "pinned": false, "retrieved_on": 1506544895, "score": 4, "selftext": "Heya! First time poster here after having lurked in the shadows for about two weeks, how are you all?\n\nI just wanted to shout into the void real quick... I've been having such a great, healthy run (cooking, eating well, intermittent fasting, depression managed, all good!) for almost two months, but today's been my third day of binging in the evening.\n\nStress from work hit me really hard these past few days and it's really frightening how little it takes for me to fall back into old patterns. I lost 12kg from January to mid-Mai (I was in a clinic to treat my depression and eating disorder and to get a grip on life), but my return to work didn't go well at all (closest co-worker guilt-tripped the hell outta me, fuck her) and I've been stuck at 117-120 kg ever since. But with lots of patience, I am now getting my life and finances back in order, slowly but surely. Still, I'm pretty sad about the state of things at the moment.\n\nI don't hate myself, nor do I feel ashamed for the binge. I'm just really sad, tired, stressed and generally bummed out right now 😢... i know, baby steps and all, but man. Today just really sucked.\n\nHeading to bed now, because I know tomorrow will be a new day. Maybe not better, but nevertheless a new day for me to take another step!\n\nI hope you guys had a better few days than I did!", "spoiler": false, "stickied": false, "subreddit": "loseit", "subreddit_id": "t5_2rz8w", "thumbnail": "self", "title": "Stress binge", "url": "https://www.reddit.com/r/loseit/comments/72nnyp/stress_binge/", "whitelist_status": "all_ads"}, {"author": "Ouranor", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1483863274, "domain": "self.Breath_of_the_Wild", "full_link": "https://www.reddit.com/r/Breath_of_the_Wild/comments/5mpw8g/tphds_castle_murals/", "id": "5mpw8g", "is_self": true, "locked": false, "num_comments": 12, "over_18": false, "permalink": "/r/Breath_of_the_Wild/comments/5mpw8g/tphds_castle_murals/", "retrieved_on": 1489412659, "score": 5, "selftext": "I'm probably really late to the party, but don't these murals pretty much confirm Gorons, Zoras and Ooccas to be in BotW? Of course it's not a direct confirmation, but now that we have the new bird race confirmed at least, the rest makes sense as well.\n\nThe tiny Link could be a hint to how he was drawn and appeard in many games of the downfall timeline. Farfetched? Most probably 😂.\n\nIs there any more info on this? I was not very successful in finding a previous reddit-thread on this.\n\nTl;dr: What do you guys think? Can the confirmation of Kass and Joe Falco be taken as a hint that Gorons and Zoras will be in the new game based on the TPHD murals?", "spoiler": false, "stickied": false, "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6", "suggested_sort": null, "thumbnail": "self", "title": "TPHD's castle murals", "url": "https://www.reddit.com/r/Breath_of_the_Wild/comments/5mpw8g/tphds_castle_murals/"}, {"author": "Ouranor", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1483369744, "domain": "self.Breath_of_the_Wild", "full_link": "https://www.reddit.com/r/Breath_of_the_Wild/comments/5llni0/high_hopes_for_horses_h3/", "id": "5llni0", "is_self": true, "locked": false, "num_comments": 17, "over_18": false, "permalink": "/r/Breath_of_the_Wild/comments/5llni0/high_hopes_for_horses_h3/", "retrieved_on": 1489392828, "score": 11, "selftext": "I don't know whether or not this has already been talked about, but I sincerely hope Nintendo just absolutely nails the horse mechanics in the game.\n\nHere's my unrealistic wishlist for horses:\n- Finer controls. The animation looks great, but I also hope that the horses have \"different gears\", not just galloping and speeding up. I've been way too spoiled by RDR (BEST horses in gaming, ever), but come on Nintendo! I believe in you!\n- The ability to pick up mushrooms, apples etc... from the back of your horse. Pleeease? That would kick so much butt!\n- Use the horse as a pack mule if necessary (maybe have the speed being affected the more you put on it or something? Although that's a stretch).\n- Different types of horses, not just in colour. We've seen the ponies the Bokoblins are riding on, which are probably unavailable for Link, but could there be other differences? \n\n- Random interlude: I hope you can ride the horse and have the wolf (or doggo ❤️) running after you. That would be so great!\n\nBack on topic:\n- Maybe own more than one horse? Although that's not really important to me.\n- FINALLY adding some stuff where you can \"upgrade\" the horse in various ways. Stuff like having to replace the horseshoes after a while, or maybe even minigames to improve the horses stamina, speed, health etc...\n- Different levels of horse accessories, like the above mentioned horseshoe for example: the first horseshoe has a pretty low durability and you'd need to find a better smith etc... Maybe even specialized horseshoes for travelling up glaciers? Just a thought.\n- Quest for Epona. Just like the green tunic probably being unavailable for a pretty long time or even being optional because of Nintendo's focus on customization/RPG, I would LOVE there to be an optional but challenging, bordering on tedious side-quest to get Epona, the fastest and strongest horse in the game. I want to be worthy of her, not just have her thrown at me!\n\nThis game honestly is a dream come true for me, and the above is wishful thinking at its best. Heck, I dreamt about our horse receiving giant wings after we help out Not-Falco xD! Pegapona? Eponus? My subconcious apparently couldn't contain the hype that night!\n\nBut more than anything, I would LOVE to know what you guys think! Are the horses important to you? What are your hopes? Please share, I would love to talk to like-mindes folks!\n\nHappy 2017 to everybody! May the time fly, and the hype stay strong!\n", "spoiler": false, "stickied": false, "subreddit": "Breath_of_the_Wild", "subreddit_id": "t5_3f1s6", "suggested_sort": null, "thumbnail": "self", "title": "High Hopes for Horses (H3)", "url": "https://www.reddit.com/r/Breath_of_the_Wild/comments/5llni0/high_hopes_for_horses_h3/"}]}