{"data": [{"author": "PastaBoy14", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1yxvanx7", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1539981051, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9pnnf3/dear_reddit/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9pnnf3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9pnnf3/dear_reddit/", "pinned": false, "pwls": 6, "retrieved_on": 1539981053, "score": 1, "selftext": "Dear reddit, \n\nI write you this text because I don’t know to who I could talk right now instead of you. “Everything is good right now”! This is what I thougt the last few weeks. New really good and good payed job, great girlfriend, supportive family. To let you know what caused this situation: I had really bad surroundings till I turned 15 or 16. My mother always told me: you don’t have friends, you have partners in crime. I never believed it, allways defended my friends. But 9 Month ago I met my girlfriend. She is the most beautiful, mature and supportive woman I ever met. For your information, i am 26, was in the hospital for  approximately 6 month (over a year ago) and I am diagnosed with burnout, depressions and ADS. When I was younger I was a really peace loving and calm boy, till I turned 16. I got aggressive, violent and super dissatisfied. Like I told you a went to the hospital instead of jail and when I came out, I was almost “fixed”. But when I met my girlfriend 9 month ago I really changed 100%! No drugs, no violence, no any other “bad habits”! Ofcourse it was not a change from one second to the other, but it was a process. I do everything for her, doesn’t matter if it’s physical oder psychological. Please don’t misunderstand me! I am not like a creepy and overly attached boyfriend, just like a “good” boyfriend has to be. The last few weeks we got more and more discussions. We fight over so stupid things and I am really sad about it. Sometimes I feel insecure and like there is something in the air, even if there isn’t. I tell her really polite and try to fix those things by having conversations. Few minutes ago we talked again and it was hurtful. Not That we yell at each other, but I talked and she just sat there crying silently in the end.... it broke my heart. And now, since I moved to her town, changed my “friends” from hundred to zero, I can’t tell anybody when I am down. Because when I try to tell her, we recently use to have bad vibes. It kills me slowly, because I know it’s stupid. She was so supportive when we met. It’s not that i am super annoying or demanding. I just don’t know what to do... so now I am sitting outside on a parking lot and write down this text. I just want to get rid of this bad thoughts that I sometimes have without a reason. Never wanted to be the man who makes her cry. Even if you guys don’t have any suggestions, but it’s just nice to talk it from my soul.\nIn Germany The Nights got colder since today and I just don’t know what to do... \n\nLove you guys ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397824, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Dear Reddit", "url": "https://www.reddit.com/r/depression/comments/9pnnf3/dear_reddit/", "whitelist_status": "all_ads", "wls": 6}]}