{"data": [{"author": "perfumednostril", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2foggim1", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540588107, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ronht/how_do_i_become_a_functioning_human_being/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ronht", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9ronht/how_do_i_become_a_functioning_human_being/", "pinned": false, "pwls": 0, "retrieved_on": 1540588107, "score": 1, "selftext": "Hey guys, \n\nI'm not sure how that whole thing works? So I'm just going to ramble a bit because I'm kinda going crazy and can't really do anything about it. \nI've been diagnosed with Major Depression a year and a half ago. At that time I wasn't 18 yet so I went to a therapist without my parents knowing. They never understood my problems (I rarely decided to talk about them because of that) and always brushed off everything that had to do with my personal feelings (which is why I'm still having problems to talk about feelings and allow them). The therapist I went to told me I should tell my parents about my depression (which at that time I didn't want to acknowledge but had for several years already) and I did. It went absolutely amazing, my Dad laughed at me and told me to get over it and to focus on bigger problems (which at that time I agreed with) and my mom basically ignored it (she is working as a psychologist) and so did my dad over time. It went on like this until now. I graduated school in June and since then  several months have passed with me waiting for university to start. \nI cannot handle my life, myself anymore. I sleep all day and when I decide to actually get out of bed every task is so draining that I have to sit or lay back again. I don't enjoy anything anymore and I'm losing control of time and space. It feels terrifying. I have no motivation to shower or eat even though I used to love both things. Everytime I should feel feelings I can't. Something is wrong with me and I'm really scared that it cannot be fixed anymore. I'm emotionally dead. I can't handle everyday life anymore, I forget deadlines and appointments and my concentration is completely gone. It feels as if my braincells are dying one after another, I can't remember anything anymore and everything feels as if I'm in a big cotton ball. I'm spacing out all the time and I'm so tired all the time. My room is a mess and I can't bring myself to clean anything. \nI never saw depression as a problem until now. I was a functioning human being that was just feeling numb all the time. Now it's become my biggest problem  and the worst part is I'm no longer at a point where I can fix it myself. I don't want to be like this anymore. I always dreamt big and I have a lot of potential but I simply can't do it. I feel so guilty because my life is good and I have nothing to complain about. I'm so lucky that I don't have to pay for University where I live and ideally I could do all the things I love. I never wanted to become a person like that. I don't know what to do. I don't even know what I expect to get out of posting this? I'm sorry for rambling there's probably no one who read this. Well yeah uhm\nThanks for listening? :)\n(Sorry for sounding weird English is not my first language)\n-kt", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 399423, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "how do I become a functioning human being?", "url": "https://www.reddit.com/r/depression/comments/9ronht/how_do_i_become_a_functioning_human_being/", "whitelist_status": "no_ads", "wls": 0}]}