{"data": [{"author": "pissofflou", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_16h6amt9", "can_mod_post": false, "contest_mode": false, "created_utc": 1539597215, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9oba0l/trying/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9oba0l", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9oba0l/trying/", "pinned": false, "pwls": 6, "retrieved_on": 1539597216, "score": 1, "selftext": "I’m going to register with my University counselling service later today. Part of me still want to run away and avoid. I haven’t make an appointment with my GP and the last time I went to the GP was in 2016 when I was diagnosed with reactive depression. Even though I feel the crush of anxiety and depression everyday, I still feel like I need to prove it. Like the people working at the service won’t take me serious or offer me anything unless I have a new diagnosis or something. I went through my last big depression last year but somehow got through it. This is worse and I’m avoiding and about to ruin everything. I’m trying to stop it early so I can salvage something. \n\n&amp;#x200B;\n\nDon’t really know what I’m looking for. Has anyone got counselling from their university/college services? How did you find it? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 396345, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Trying", "url": "https://www.reddit.com/r/depression/comments/9oba0l/trying/", "whitelist_status": "all_ads", "wls": 6}, {"author": "pissofflou", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532569787, "domain": "self.socialskills", "full_link": "https://www.reddit.com/r/socialskills/comments/91y2uc/old_friendsacquaintances/", "id": "91y2uc", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/socialskills/comments/91y2uc/old_friendsacquaintances/", "pinned": false, "pwls": 6, "retrieved_on": 1532569788, "rte_mode": "markdown", "score": 1, "selftext": "Not sure if this is the right subreddit. \n\nIs it okay or weird to send a message on whatsapp or something to friends I haven’t spoken to in 2 years? I left the university I met them at in 2016, I kinda dropped of the radar without any warning. \n\nNot sure if it’s a little manipulative or toxic or whatever if I just strike up a conversation when I want to, I also don’t want to seem dumb.\n\nIdk if the friendships meant much to them, since they finished up their degrees already and made other friends. We did fun stuff, not sure if they’d remember me even. Part of me is thinking ah well fuck it I’ll never talk to them again who cares if they think it’s odd. I’m just curious about what they’re doing and tbh I’m lacking in social contact at the moment. Then I’m worried I’ll go all avoidant again and avoid them or something.\n\nIs it worth trying or nah?\n\nThanks for any help.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "socialskills", "subreddit_id": "t5_2r275", "subreddit_subscribers": 498576, "subreddit_type": "public", "thumbnail": "self", "title": "Old friends/acquaintances?", "url": "https://www.reddit.com/r/socialskills/comments/91y2uc/old_friendsacquaintances/", "whitelist_status": "all_ads", "wls": 6}, {"author": "pissofflou", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1525960262, "domain": "self.raisedbynarcissists", "full_link": "https://www.reddit.com/r/raisedbynarcissists/comments/8if0t5/helping_sg_older_sister/", "id": "8if0t5", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/raisedbynarcissists/comments/8if0t5/helping_sg_older_sister/", "pinned": false, "pwls": 6, "retrieved_on": 1525960263, "rte_mode": "markdown", "score": 1, "selftext": "I found this subreddit after having one of the worst days yesterday. \n\nI showed my SG older sister an article on the narcissistic family dynamics a few weeks ago, and it fit so well. My second oldest brother is the obvious GC, I feel like I fit more into the lost child role at the moment, having times in childhood where I was treated like a GC (being the youngest) and times as an SG (when defending my sister). \n\nI can’t express my emotions well and cry when in confrontational situations. I hate that I can’t be as strong and determined as my SG sister. There’s a lot of guilt over situations when I haven’t supported her. My sister has been a substitute mother figure in my life, I depend on her a lot but find it difficult to support her. She helps me through all of my shit, gets me through with pep talks and is genuinely trying to help me. \n\nMy SG sister is going through a stressful time. When she comes to me for advice, I panic. I can’t think. She, understandably, gets annoyed that I’m taking it too seriously. Even minor decisions, like deciding where to get food, make me panic and I defer decision making to her. When she came to me for advice yesterday, it was a repeat of all the other times. She brings up what is bothering her and I go quiet. In my mind, theres blankness. I’m trying so hard to think of what to say. Sometimes I’m genuinely thinking of a solution or something to help her, but struggle to verbalise until I have a coherent thought by which point its too late. I feel like I have to have an answer. I also struggle with saying what I think people want to hear. I cry when she gets annoyed at me, which turns a situation that was about her problems into something about me. It makes her feel guilty for creating a situation where I cry, which makes her feel like there’s no one to help her. She has no one else to go to, she’s always fixing other people’s problems. I don’t intend for her to feel guilty, I don’t want to cry, but the result of my actions always makes her feel worse. Another issue is that my advice is always obvious, she tells me that she could’ve thought of that herself, and what was the point in coming to me. Although she says this bluntly, I know its out of frustration and ultimately, as much as it hurts, its true. \n\nThe worst feeling is wishing that the situation will end, I care so much for her, but I hold back and only think of myself wanting it to stop. It's a situation that makes me feel uncomfortable, not having the answers makes me uncomfortable so I would rather ignore the problem and brush it under the carpet like I do with all my problems. Its selfish and shows that I don’t care about her as much as I care about myself, but I want it to stop.\n\nMy SG sister and I are close as hell. She’s my only friend, we go everywhere together. Because she’s older than me, I feel like I don’t have the experience or the knowledge on certain things she’s struggling with to tell her or advise her. If I have a problem, like about university, she can tell me from a perspective of having been through something similar or just about university in general. I feel that because I don’t have that experience, that what I say or suggest will be wrong.\n\nI want to know if anyone else has experienced this. All I want is to be able to help my sister, to offer advice in a calm way, to think about things rationally. Any tips on how to overcome this, or what you would want to see from an SG perspective? ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "raisedbynarcissists", "subreddit_id": "t5_2we9n", "subreddit_subscribers": 250414, "subreddit_type": "public", "thumbnail": "self", "title": "Helping SG older sister", "url": "https://www.reddit.com/r/raisedbynarcissists/comments/8if0t5/helping_sg_older_sister/", "whitelist_status": "all_ads", "wls": 6}]}