{"data": [{"author": "pleasehelp16599", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2i01vrpx", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540794206, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9sao9u/i_need_help/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9sao9u", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9sao9u/i_need_help/", "pinned": false, "pwls": 0, "retrieved_on": 1540794206, "score": 1, "selftext": "Apologies if this is a mess. I've been crying on my bathroom floor for the past half hour and I really cant think right now. I just need to write this out or I'm going to lose it. I dont even know where to begin, I've been diagnosed with anxiety since I was 5 and have had countless eating problems on top of just general social anxiety. I have episodes of paralysis when it gets bad enough. Also been diagnosed with depression. Im exhausted. Im in college and working part time. I love school, but work is stressting me out. To be quitr honest I really have nothing to stress about, but when my anxiety wants to take over I stress about EVERYTHING. The voice in my head keeps reminding me of every slip up and how its going to come back to haunt me and its just this giant snowball effect. It never stops. The minute I wake up my mind is racing and my body aches from just being so tense all the time. My heart beat is so off beat im just used to it at this point. My limbs go numb all the time because im so stressed. I tell myself all the time I should just end it. Im weak, im stupid, all the instults you can think of I throw my way. I feel like im drowning and at this point im accepting it. I want to end it but the only thing keeping me here is my boyfriend. He is the light in my life. I've been with him for 3 years and he is nothing but loving and affectionate. I hate telling him my problems and burdening him. I stay here because I dont want to hurt him. Thinking of the pain he would go throw scares me more than my desire to release myself from all the shit going on im hy head. I feel selfish for being depressed, so many people have it worse and im the one complaining? It makes me want to end it even more. I know I need help and deep down I want it, but for some reason the thought of ending it all keeps popping back up.\n\nAgain, sorry for the mess. I just needed to get this out in writing and out of my head. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 400036, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I need help", "url": "https://www.reddit.com/r/depression/comments/9sao9u/i_need_help/", "whitelist_status": "no_ads", "wls": 0}]}