{"data": [{"author": "PracticalTemporary", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2ia65r6y", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541630023, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9v46a2/i_cant_be_responsible_for_other_peoples_feelings/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9v46a2", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9v46a2/i_cant_be_responsible_for_other_peoples_feelings/", "pinned": false, "pwls": 0, "retrieved_on": 1541630025, "score": 1, "selftext": "I have recently been diagnosed with depression after the break up of a 15-year relationship 5 months ago. There are lots of things contributing to my being depressed but in all honesty I feel like I have a bloody good reason to be and I know I'm doing all the right things to get through it (medication, counselling etc) and I know that things will improve as I have suffered previously and this is merely a relapse.\n\nMy problem is that depression makes me become very inward-looking. I know what I need to do, I know what makes me feel better, I know what triggers me and so I believe myself to be actually quite good at seeking support and self-care the only downside being that I do this better on my own schedule. Working to someone else's timeline increases my stress and anxiety and as such caused me to 'shut down'.\n\nMy family are being supportive but it feels like my mum is increasingly pushing me to 'get things moving'. She's constantly asking if I've made the appropriate appointments, called the right people, taken myself for a walk etc. When she sees me she says I look sad but actually, a lot of the time I'm feeling guilty because although I've had what I consider a content say of long baths, favourite movies etc to feel good I haven't washed up which she takes as me being too down. I inevitably end up quite emotional and tired, trying to explain to her that I am sad, yes, but I have the right to be at the moment and I will get through it in my own time.\n\nYesterday she got emotional and said 'If you can't do it for you, do it for me.' I understand where and why she said it. It comes from a place of love and concern but it made me so angry. I tried to explain to her that putting her feelings on me just gives me another responsibility that I can't handle right now. That I have to be selfish and look out for me, and I will and do reach out if I need it but its unfair of her to put her emotions on me.\n\nWas I right to be angry about this? How do others deal with family asking them to 'cheer up' or 'do it for them'?\n\nSorry for the wall of text...", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 403214, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I can't be responsible for other people's feelings", "url": "https://www.reddit.com/r/depression/comments/9v46a2/i_cant_be_responsible_for_other_peoples_feelings/", "whitelist_status": "no_ads", "wls": 0}, {"author": "PracticalTemporary", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2ia65r6y", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540901452, "domain": "self.Anxiety", "full_link": "https://www.reddit.com/r/Anxiety/comments/9sn8nf/calm_anxiety_attack/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9sn8nf", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/Anxiety/comments/9sn8nf/calm_anxiety_attack/", "pinned": false, "pwls": 1, "retrieved_on": 1540901453, "score": 1, "selftext": "Hi, I'm new here and created this account purely to seek help/support/advice.\n\nI have recently been diagnosed with stress-related anxiety and depression. I have started a course of medication and I am seeking counselling services. I have experienced a definite panic attack (unable to breathe, convinced I was dying, palpitations etc) which is what prompted me to seek medical help with the building stress I was experiencing, however;\n\nSince beginning my medication I seem to be experiencing instances of anxiety which prevent me from doing what I need to do (such as going to work) but it seems to present in a calm way. I wake up in the morning and I cannot get out of bed. I feel heavy, almost glued in place and it can take upward of 2 hours to be able to muster up the ability to simply move from the position I woke up in. When it comes to doing things like washing up/ shower/laundry/go to work I am overwhelmed with the thought 'I can't do that today' and as much as I try to override it the voice is there, 'I can't do that today'. I get quite emotional and frustrated with myself but my main worry is how calm I feel through this. Those hours laying bed, unable to move I just feel a calm acceptance like 'well, this is me now'.\n\nSo my question is, can I describe this to my GP as an anxiety attack? I don't feel 'attacked'. I feel apathetic to it but I do feel if someone were to question me or try to goad me out of it it would develop into an anxiety attack, if that makes sense?\n\nAny thoughts or suggestions/ideas would be appreciated. Thanks.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Anxiety", "subreddit_id": "t5_2qmij", "subreddit_subscribers": 204292, "subreddit_type": "public", "thumbnail": "self", "title": "Calm anxiety attack?", "url": "https://www.reddit.com/r/Anxiety/comments/9sn8nf/calm_anxiety_attack/", "whitelist_status": "house_only", "wls": 1}]}