{"data": [{"author": "RedSh0e1", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2di2igsx", "can_mod_post": false, "contest_mode": false, "created_utc": 1539033146, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9miwbg/rough_day/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9miwbg", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9miwbg/rough_day/", "pinned": false, "pwls": 6, "retrieved_on": 1539033147, "score": 1, "selftext": "I'm brand f new to Reddit. So I hope you'll excuse any newbie-isms. I was diagnosed with dysthymia (now Persistent Depressive Disorder) nearly 15 years ago. I've tried medication, several therapists and have now been in therapy for the past 4 years with someone who does her best to push me out of my comfort zone and challenge my negative thoughts. Not an easy task as I've lived this way for decades. I'm 40 now. I'm a bit of a loner, have some friends, though they're not super close, same goes for my family I guess. I can talk to them, but in the past they tired of my sensitivity and I was less inclined to share my thoughts unless it was necessary.\n\nI'm having a bit of a rough patch today. Lots of guilt and shame. See, I occasionally foster shelter animals. Usually shy adults who need a breather from shelter life. I have a lot of experience with the animal shelter community. A few months ago, my shelter asked me to take in a young cat. Still a kitten in many ways. I had a personal rule that I wouldn't foster kittens. But, he reminded me of my old cat and I hadn't fostered for a while, so I took him in. It wasn't a good fit. I had him for 6 weeks when I finally told the shelter they should find another foster home for him. It took another 6 weeks to find one. And by that time, I was a little attached to the rambunctious little monster. (He wasn't aggressive, just had a lot of energy). I dropped him off at his new foster home today and I feel like a failure. His new foster is perfectly nice. He'll have other pets to play with. But, I still feel like a failure. The thought of having to go to work tomorrow makes me depressed. I texted my older sister, who responded with encouragement, but didn't follow-up when I explained how sad I was. \n\n&amp;#x200B;\n\nNow, I just feel alone and trying to overcome this feeling and failing at that as well. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 393989, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Rough Day", "url": "https://www.reddit.com/r/depression/comments/9miwbg/rough_day/", "whitelist_status": "all_ads", "wls": 6}]}