{"data": [{"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1094mmmz", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540519595, "domain": "self.TalkTherapy", "full_link": "https://www.reddit.com/r/TalkTherapy/comments/9rgmua/turmoil_over_therapist_caring_or_not/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9rgmua", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 13, "num_crossposts": 0, "over_18": false, "permalink": "/r/TalkTherapy/comments/9rgmua/turmoil_over_therapist_caring_or_not/", "pinned": false, "retrieved_on": 1540519596, "score": 1, "selftext": "My therapist has shown through a lot of his actions, words, body language, etc, that he cares about me. I asked him directly too. He's told me before that it's extremely obvious from his perspective that he cares. \n\nLast session didn't go too well, at least from my side of the perspective. This happens sometimes, that I come out feeling like he was far away from me or emotionally disconnected from me. Maybe some of you experience this too. And after these types of sessions, it's like the tentative trust I felt just dissipates out of thin air and I'm back to square one. Intellectually I remember all the nice things he did, nice things he said, his smiling. But I can't re-create in my mind the feeling I felt when he said those things. Doubt sets in, and I wonder if something changed, I wonder if he's sick of me now. It throws me into emotional turmoil. All day I've been trying to talk some sense into myself, try to put things into perspective, try to snap myself out of this mood, remember what he said in the past. It doesn't work. I don't see him often so I can't talk to him about it any time soon. I know this has roots in my traumatic childhood, but knowing the fact doesn't change how I feel. It's very difficult, I don't know how to fix it and feel better. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "TalkTherapy", "subreddit_id": "t5_39dpu", "subreddit_subscribers": 3562, "subreddit_type": "public", "thumbnail": "self", "title": "Turmoil over therapist caring or not", "url": "https://www.reddit.com/r/TalkTherapy/comments/9rgmua/turmoil_over_therapist_caring_or_not/"}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1094mmmz", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540386673, "domain": "self.socialanxiety", "full_link": "https://www.reddit.com/r/socialanxiety/comments/9qziio/the_link_between_shame_and_social_anxiety/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qziio", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/socialanxiety/comments/9qziio/the_link_between_shame_and_social_anxiety/", "pinned": false, "pwls": 6, "retrieved_on": 1540386674, "score": 1, "selftext": "I've been reading a lot on shame recently and I've been surprised at how many parallels it has with the experiences of someone with social anxiety. For instance, here the author is talking about the link between parent and child:\n\n*Whereas empathic attunement results in a state of joy and excitement, misattunement results in a drastic diminution of joy and excitement. Interest, enjoyment, exploration, activity, and eye contact stop. These misattunement events create an experience of the mother as a stranger and the infant as deficient. These experiences of misattunement may be understood as shame experiences. Shame experiences result from the sudden awareness that one is being viewed differently than one anticipated. In a shame experience, there is a split in awareness. The self is simultaneously experienced as deficient, helpless, confused, exposed, and passive, and at the same time is experiencing the shaming other as if inside the self. The other is experienced as powerful, overwhelming, judging, and right. Unrepaired shame experiences result in a self defined in shame. The shame self leads to a preoccupation with the feelings, behavior, and concerns of the other. This is a “false” self that experiences disorganization and an inability to regulate itself.\n(...)\nThe state of shame (i.e., of ruptured integrity), resulting from experiences of misattunement that are overwhelming and unrepaired, can be understood as the origin of learned patterns of interpersonal connections based on fear—fear of losing the other, fear of losing the love or approval of the other, fear of being unlovable, fear of punishment by the other, and fear of not living up to one's ideal for one's self. These misattunement states may be lived out in a counterphobic manner wherein the importance of relatedness is denied. These patterns, when internalized, can result in a kind of social blindness that emerges from the person's desperate seeking for selfobject functions in adult relationships. Impetuousness, in fact, undermines the access of true self intelligence required to judge social situations reasonably clearly. The person living in a state of ruptured self is preoccupied with feelings defined in shame. The self is simultaneously concerned with its own emotional pain and lack of adequacy, and overwhelmed with concern about the other as one who controls the self experience and well-being.*\n\nDoes this ring a bell for you guys?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n", "subreddit_subscribers": 125519, "subreddit_type": "public", "thumbnail": "self", "title": "The link between shame and social anxiety", "url": "https://www.reddit.com/r/socialanxiety/comments/9qziio/the_link_between_shame_and_social_anxiety/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1094mmmz", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1539627716, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ofa51/is_this_what_depression_feels_like/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ofa51", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ofa51/is_this_what_depression_feels_like/", "pinned": false, "pwls": 6, "retrieved_on": 1539627717, "score": 1, "selftext": "I've been diagnosed with dysthymia (persistent depressive disorder), with bouts of depressive episodes apparently. I've been like this for a long time, I don't know what's \"normal me\" and what's the depression, they're intertwined. So I've been trying to connect feelings I have to actual labels for what they are. Something I experience a lot is that I often have, in the back of mind, a constant feeling of dread and sadness. I could be at comfortably at home, nothing bad is happening, I'm enjoying a video game - as much as it's possible for me to enjoy anything, but there's this hole inside me full of emptiness and fear. Could be the childhood trauma too, I'm not sure. I feel my best when I'm actively doing something outside the house because it distracts me from that feeling. But once I'm alone again and I'm not focused on doing something, the feeling comes back. I don't know what that feeling is. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 396464, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is this what depression feels like?", "url": "https://www.reddit.com/r/depression/comments/9ofa51/is_this_what_depression_feels_like/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1094mmmz", "can_mod_post": false, "contest_mode": false, "created_utc": 1539371647, "domain": "self.TalkTherapy", "full_link": "https://www.reddit.com/r/TalkTherapy/comments/9nn6kd/being_invalidated_by_your_therapist/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9nn6kd", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "permalink": "/r/TalkTherapy/comments/9nn6kd/being_invalidated_by_your_therapist/", "pinned": false, "retrieved_on": 1539371648, "score": 1, "selftext": "So I was assigned a psychologist through the public health system. There's apparently a psychologist shortage, after a long wait I just ended up with whichever random person was available. At the start she admitted she never had any experience treating someone with social phobia or AvPD like me.\n\nI feel like she's fairly competent on a technical level. However she jumped straight into challenging me, not caring or not understand what the impact of what she says has on me, not caring about earning my trust either. I try to be \"better\" and not let it affect me, but it does. I talked about my life story, my difficult childhood, how my father abandoned me, how my mother was completely absent on an emotional level, never cared how I felt, was never involved in my life, didn't care that I was sad and things were going badly at school. My mother wasn't close to the rest of our family, I was isolated, stuck alone at home, and had no support. There was no play, no attention, no scheduled activities outside the house, nothing. In retrospect I feel like my mother has a limited capacity for empathy. I feel like people don't understand what it's like to grow up and not have a single person in the world that cares about you, that's there for you. Your perspective is completely invalidated, your feelings don't matter, you don't have any self-worth. I developed a deep sense of shame, that I was a fatally flawed person, a kind of defective, inferior human that was treated badly because I didn't deserve love. I didn't fight back when the bullies hit me at school; I thought I deserved it. I had trouble making friends because I thought nobody would like me.\n\nThe other day I come in for a therapy appointment and at some point in the conversation she mentions she wants to send to me to a neuropsychologist and get testing. I ask her why, and she says that because my grandmother was mentally ill, I might have inherited something. I ask what \"something\" is and she says it could be anything, she doesn't know. She says it was possible my issues were purely developmental, but that they could also be purely biological. I didn't let it show but that really upset me. I've always felt I'm responsible for everything bad that happened to me. My family always acted as though it was perfectly normal to neglect me. With the help of therapists in the past, I've been fighting with myself to convince myself that I deserved better, that I deserved people that took care of me, that it wasn't my fault that I was abandoned. I'm fine with the testing, I'm curious what the results would be and I'm quite confident the results would be normal or fairly normal. But the fact she's willing to overlook my entire history and take in consideration that a purely biological explanation is possible makes me very upset. Why am I telling this person my history? It clearly doesn't matter. She's invalidating me just like my family did. Even if the voice of my past therapists in still in my mind, I know they would disagree with her, it still hurts. Would she tell this to a \"child adult\" who had suffered physical abuse or sexual abuse? \"It might be because you're biologically flawed that you lived through this childhood badly.\" Why is it OK to invalidate people who suffer neglect? I wish I had been beaten instead, society would have understood my point of view.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "TalkTherapy", "subreddit_id": "t5_39dpu", "subreddit_subscribers": 3489, "subreddit_type": "public", "thumbnail": "self", "title": "Being invalidated by your therapist", "url": "https://www.reddit.com/r/TalkTherapy/comments/9nn6kd/being_invalidated_by_your_therapist/"}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_1094mmmz", "can_mod_post": false, "contest_mode": false, "created_utc": 1537038409, "domain": "self.socialanxiety", "full_link": "https://www.reddit.com/r/socialanxiety/comments/9g423u/who_else_had_a_bad_childhood/", "id": "9g423u", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/socialanxiety/comments/9g423u/who_else_had_a_bad_childhood/", "pinned": false, "pwls": 6, "retrieved_on": 1537038410, "score": 1, "selftext": "There's some people with SA who had fairly normal parents and normal childhoods, but spontaneously developed SA as teens.\n\nMy history is really different. As a kid my parents would always ignore me, never played with me, never asked me anything. I felt like they didn't care one bit about me. Already at 6 years old I had some kind of inferiority complex. Starting getting bullied immediately after starting school. The older women monitoring the playground didn't believe me when I told them, they didn't seem to care either. My homeroom teacher was awful with me because I had bad grades. I had bad grades because I felt very distressed by the situation, but nobody cared to try understanding. One time she got very upset at me because she said I wasn't paying attention in class, she yelled at me and I starting crying. She forcefully gripped my hand and dragged me to a room next to the library, as I was crying, and locked me up there for the rest of the day to \"punish\" me. I cried for a long time. When the bell rang the end of the school day, she didn't even bother to help to me out, I had to bang on the door and get the attention of a library assistant to help me leave. By this point my father had abandoned me and I would never see him again, and my mother didn't give a flying shit what happened to me at school. The bullying continued and kids would push me around and go to the teachers and make up stories that I was doing something wrong, and I would get punished or fall under suspicion when I hadn't done a single thing wrong. It was like psychological warfare on top of the beatings.  I didn't have the self-confidence to stand up to myself, I felt like I had no value. The kids I could understand, but it really fucked me up that adults, the people supposedly looking out for you, were heartless monsters too. \n\nThis is basically what happened ages 6-7... I'll leave it there because the post would last forever. But things didn't get better as I got older.\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n", "subreddit_subscribers": 115616, "subreddit_type": "public", "thumbnail": "self", "title": "Who else had a bad childhood?", "url": "https://www.reddit.com/r/socialanxiety/comments/9g423u/who_else_had_a_bad_childhood/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534801127, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/98xqw0/dreading_to_be_alone_with_thoughts/", "id": "98xqw0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/98xqw0/dreading_to_be_alone_with_thoughts/", "pinned": false, "pwls": 6, "retrieved_on": 1534801128, "score": 1, "selftext": "When I'm out and about, doing anything even boring things like grocery shopping, walking to the bus or going to an appointment, I'm distracted and I feel better. But then when I get back home, it's just me, alone with the TV and computer screen, for hours on end. I get as much time as I want to just stew on everything's that's wrong with my life. That's the tough stretch of the day. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 379892, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Dreading to be alone with thoughts", "url": "https://www.reddit.com/r/depression/comments/98xqw0/dreading_to_be_alone_with_thoughts/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534277691, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/97bqwk/how_to_tell_if_you_have_dysthymia/", "id": "97bqwk", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/97bqwk/how_to_tell_if_you_have_dysthymia/", "pinned": false, "pwls": 6, "retrieved_on": 1534277691, "score": 1, "selftext": "So my psychologist seems convinced I have dysthymia (chronic low-grade depression) or something similar to it. Some things I experience that seem relevant:\n- I don't have a lot of energy. I look at what ordinary people do e.g. handling full time work, house chores, raising multiple children, and I don't know how they do it.\n- I wake up tired and sore. Taking a shower and getting dressed feels like a lot of effort for some reason. Seems weird considering everyone does it like it's nothing. It gets better as the day goes by though. \n- I don't really enjoy much. Sometimes I'll push myself to do something that's supposed to be fun and maybe I'll enjoy it a little. But when I weight it against the hassle and stress it causes me (I have social anxiety), it comes out to be more of a chore than fun. Do I want to prepare clothes, make sure I look good, do 1 hour of public transit feeling self-conscious, feel self-conscious doing the activity, feel a tiny bit of fun, then have to do 1 hour of public transit to go back home? Not really, it's just not worth it.\n- It's very difficult for me to laugh. I could watch 10 youtube compilations of \"try not to laugh\" and it would a miracle of any of them made me laugh. It's legitimately a mystery to me how people laugh to them.\n- I am sad a lot of the time. But I think it would be kind of insane not to be sad in my situation. I have no job, no friends, no partner. I'm working hard in therapy to get better. I feel like the stress and sadness I feel is very appropriate considering the situation. Can it really be called depression at that point?\n- Some days I kind of feel like I have to battle to keep my head over water (mood-wise).\n- Coffee helps somehow. I have more energy / enthusiasm after drinking it.\n\nThe thing is, all these things are \"normal\" as far I know. I've been like this for a long time. I have no idea where the line between my \"real\" personality and the supposed dysthymia is. The idea that I have a form of depression just seems outlandish to me, I don't feel depressed. I have good moments sometimes. But when I look at the criteria for diagnosis intellectually, it kind of lines up with what I experience. So I don't know, I'm confused. My therapist wants me to get on antidepressants but I'm not a fan of messing with psychiatric drugs, especially if it's not necessary. \n\nAnyone with dysthymia has some experience / thoughts on this?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 378074, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "How to tell if you have dysthymia?", "url": "https://www.reddit.com/r/depression/comments/97bqwk/how_to_tell_if_you_have_dysthymia/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_1094mmmz", "can_mod_post": false, "contest_mode": false, "created_utc": 1531264240, "domain": "self.socialanxiety", "full_link": "https://www.reddit.com/r/socialanxiety/comments/8xuak9/anyone_experience_this_doublebind/", "id": "8xuak9", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/socialanxiety/comments/8xuak9/anyone_experience_this_doublebind/", "pinned": false, "pwls": 6, "retrieved_on": 1531264241, "rte_mode": "markdown", "score": 1, "selftext": "My situation is a probably a little different from most SAD sufferers. As part of my therapy I've been putting myself in a lot of scary social situations. My anxiety has gone down a fair bit compared to when I started. But sometimes it's like, what's the point? I'll make the effort to go to a social outing, putting myself under the potential scrutiny of strangers. I get over the initial anxiety, but I'm still uncomfortable the whole time I'm there. I don't enjoy myself, I don't make new friends, I don't feel comfortable being myself or saying what's on my mind around these people I don't know. I go back home and it's like... well, what was the point of that? The whole point of me doing this was to make friends and have more people in my life. But that hasn't happened at all. And it's frustrating because I'm doing exactly the exercises my therapist tells me to do, but my hard work yields nothing.", "send_replies": false, "spoiler": false, "stickied": false, "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n", "subreddit_subscribers": 105362, "subreddit_type": "public", "thumbnail": "self", "title": "Anyone experience this double-bind?", "url": "https://www.reddit.com/r/socialanxiety/comments/8xuak9/anyone_experience_this_doublebind/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528134480, "domain": "self.AvPD", "full_link": "https://www.reddit.com/r/AvPD/comments/8ojalu/being_guarded_and_subdued/", "id": "8ojalu", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "permalink": "/r/AvPD/comments/8ojalu/being_guarded_and_subdued/", "pinned": false, "retrieved_on": 1528134482, "rte_mode": "markdown", "score": 1, "selftext": "As part of my therapy, I've been putting myself in a lot of social situations. I can't say it's been pointless because my social anxiety has gone down a lot, I'm doing things now that would have been unthinkable a year ago.\n\nBut I think I'm hitting a deeper problem now. I go into a social situation. I make an effort to speak more and participate more, even though I'm shy and I have trouble being assertive. But most of the time I just don't enjoy it. Sometimes the people aren't interesting. Sometimes people keep rambling too much and I have trouble getting a word in. But I guess fundamentally, I don't enjoy myself because I feel like I'm not allowed to be myself. When I'm around people I feel comfortable with, I say what's on my mind, I'm spontaneous and I can enjoy myself. When I'm around new people, I automatically become guarded. I guess I feel like they would never accept me as I really am, or that they would try to hurt me or make fun of me if I were genuine, in a weird way it makes me feel resentful towards them. I was really traumatized early on, I felt like I had to erase myself completely or other people would never accept me. But it's so upsetting to be treated so unfairly. I guess it's the past now, but it still feels like I have to follow this unfair \"rule\". This kind of guardedness is so ingrained in me, I don't know how to improve it. Do you guys experience something similar?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AvPD", "subreddit_id": "t5_2vjua", "subreddit_subscribers": 5113, "subreddit_type": "public", "thumbnail": "self", "title": "Being guarded and subdued", "url": "https://www.reddit.com/r/AvPD/comments/8ojalu/being_guarded_and_subdued/"}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1524424580, "domain": "self.socialanxiety", "edited": 1524424936, "full_link": "https://www.reddit.com/r/socialanxiety/comments/8e5gt7/bad_exposure_experience/", "id": "8e5gt7", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": false, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/socialanxiety/comments/8e5gt7/bad_exposure_experience/", "pinned": false, "retrieved_on": 1524427278, "rte_mode": "markdown", "score": 3, "selftext": "Yesterday I went to meeting of a group who plays board games, about 20-25 people were there.\n\nFirst we played a 12-people game that revolved around negotiation, we had to go around the table and make deals with other people within 2 minutes, very loud and hectic. I have a hard time being assertive around strangers, especially in a large group. I can't be myself in these situations. I didn't do as well as I could have even though I had a good strategy, really got me down. My therapist tells me to do these things so I can get better and more comfortable at talking with other people, but nobody was engaging in small talk at all, only making off-hand comments about the games, it made it hard to have an \"in\" into talking for me. I have trouble speaking loud enough sometimes which made it difficult because there were so many people talking and so much noise, I barely spoke the whole time.\n\nTowards the end we played a long game, but a player on the other team was repeatedly not following the rules and it messed up what I was doing. It didn't affect anyone else's role except mine so nobody cared. I was so done by this point I just impulsively told them I was done playing, say goodbye to the organizer, got my things and got out. I probably looked like a right idiot. I was there 5 hours. \n\nIt was really depressing seeing other people laughing and having a good time, participating fully, but I just couldn't do the same. I had to hold back tears on the way back home. I guess occasionally crashing and burning is part of the process. I guess that on the positive side it's really clear to me now that assertiveness and spontaneity is something I have to work on, specifically. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "socialanxiety", "subreddit_id": "t5_2r22n", "subreddit_subscribers": 90551, "subreddit_type": "public", "thumbnail": "self", "title": "Bad exposure experience", "url": "https://www.reddit.com/r/socialanxiety/comments/8e5gt7/bad_exposure_experience/", "whitelist_status": "all_ads"}, {"author": "Renardt", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1523853321, "domain": "self.therapy", "full_link": "https://www.reddit.com/r/therapy/comments/8cl0h8/advice_for_difficult_scheduling_issue/", "id": "8cl0h8", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "permalink": "/r/therapy/comments/8cl0h8/advice_for_difficult_scheduling_issue/", "pinned": false, "retrieved_on": 1523857137, "rte_mode": "markdown", "score": 1, "selftext": "My therapy and my relationship with my therapist is very good, but there's one problem: my therapist only has space every 3 weeks. I've tried scheduling several appointments in advance but no dice, I think he's purposefully leaving space empty for his other clients, he doesn't want anyone to have a 2-week spacing because it would push other people into the 4-week wait range. I've told him I find this spacing difficult, he says all his other clients are waiting 3 weeks too. He says there's a shortage of psychologists in our area. He used to have space available every 2 weeks, so I think what's happening here is that he doesn't have the heart to turn away new clients so more people are being squeezed into the same schedule. I feel like it should be common sense that existing clients should be prioritized over the taking of new ones, especially when it's getting to this point where appointment time is stretched this thin.\n\n3 weeks is rough. My support network is basically non-existent. I think 3 weeks is a very tough waiting time for anyone with any serious issue. It's definitely impacting my therapy in a negative way. Recently he's told me out of the blue that it would be good if I took medication because he believes I may have dysthymia (persistent low-grade depression). Maybe I do, maybe I don't, I can't tell. I have a lot of tangible, real-world reasons for being sad, anyone in my situation would have to be literally insane to not be at least a little depressed. The mystery here is how I'm not more depressed than I am. I'm a little offended because I feel like he's checking out of his responsibilities. He's the one that created this painful 3-week waiting period... and he's pushing medication to deal with the fallout. I just want support, that's all I need, even 2-weeks spacing would make a world of difference.\n\nWhat do you guys think I should do, or say to him? I like him a lot, he's a good person, I don't want to offend him. It's really tough for me though.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "therapy", "subreddit_id": "t5_2r76d", "subreddit_subscribers": 2574, "subreddit_type": "public", "thumbnail": "self", "title": "Advice for difficult scheduling issue", "url": "https://www.reddit.com/r/therapy/comments/8cl0h8/advice_for_difficult_scheduling_issue/"}]}