{"data": [{"author": "Sea-of-Needles", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hyc7ddw", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540398180, "domain": "reddit.com", "full_link": "https://www.reddit.com/r/depression_help/comments/9r15gr/from_a_tormented_mind/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9r15gr", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9r15gr/from_a_tormented_mind/", "pinned": false, "retrieved_on": 1540398180, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 18478, "subreddit_type": "public", "thumbnail": "default", "title": "From a Tormented Mind", "url": "https://www.reddit.com/r/depression/comments/9qs3xl/from_a_tormented_mind/?st=JNNDA13H&amp;sh=314b0f56"}, {"author": "Sea-of-Needles", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hyc7ddw", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540325458, "domain": "self.depression_help", "full_link": "https://www.reddit.com/r/depression_help/comments/9qsmuh/from_a_tormented_mind/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qsmuh", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9qsmuh/from_a_tormented_mind/", "pinned": false, "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "EqFPJ02xy_4b-Ehm9sS5rnRkNSJTKFdl64rghMKzsSw", "resolutions": [{"height": 108, "url": "https://external-preview.redd.it/FzeSDCOOUTy2f5GzJg13wd5mBdOKm9maWTl4NyFRpWI.jpg?width=108&amp;crop=smart&amp;auto=webp&amp;s=279dbeeae9568ea1467415df0f5ee515d245c477", "width": 108}], "source": {"height": 150, "url": "https://external-preview.redd.it/FzeSDCOOUTy2f5GzJg13wd5mBdOKm9maWTl4NyFRpWI.jpg?auto=webp&amp;s=49f2e6764442fefe1f7a26f56e39b27759d89d90", "width": 150}, "variants": {}}]}, "retrieved_on": 1540325460, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 18440, "subreddit_type": "public", "thumbnail": "self", "title": "From a Tormented Mind...", "url": "https://www.reddit.com/r/depression_help/comments/9qsmuh/from_a_tormented_mind/"}, {"author": "Sea-of-Needles", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hyc7ddw", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540321994, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qs3xl/from_a_tormented_mind/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qs3xl", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qs3xl/from_a_tormented_mind/", "pinned": false, "pwls": 6, "retrieved_on": 1540321995, "score": 1, "selftext": "I have a few unorthodox methods of dealing with depression.\n\n&amp;#x200B;\n\nTo understand where these feelings come from, I need to be transparent.\n\nMy parents are divorced. I was shared week by week for my entire adolescent life 1-18\n\nMy mother has severe depression, and during her late teens and early 20s she was in and out of a mental hospital for suicide attempts. She did receive electric shock treatment prior to my birth.\n\nMy Mothers mother, I don't have much history on. But she also suffered the affliction that is depression.\n\nBetween the ages of 4-14 I was physically assaulted and or molested in a pool/bedroom by a male cousin of mine. I am also male.\n\nI was also taken advantage of by a 15 year old boy when I was about 10. He was experimenting with gay sex using me, before I knew what normal sex was. On this note I am not a homosexual.\n\nDuring middle school things escalated, I made REAL friends(in my eyes at the time) and soon after I was removed from that school and put into another. Disconnected.\n\nOnce in the new school I joined the Gifted Program which I was then removed from a quarter through the year. Disconnected yet again.\n\nAfter that the only friend I could maintain, whom I appreciate very much - was likely autistic and tended to spit in my face/ put off other people.\n\nThis led me further into online gaming, which up until that point in time I had played an unhealthy amount, and had a lackluster social life.\n\nThis lacking of human contact led me into a trap, a 39 year old women - and at this point im 15-16 entering high school. The woman gave me more \"love\" and attention than I probably ever had in my life, likely even to this day. We shared everything, and did a lot together in online videogames. My parents eventually saw the phone records and contacted police - I happened to be in the center of a ring of children she was dating/or trying to date online. \n\nAfter police got involved I was yet again. Disconnected. I cried and I hated life, the one thing that breathed life into me after so long was taken away.\n\nI do not remember much of high school after that, It was mostly a blur until my brain started to actually develop. And with it came my affliction.\n\nTo add on to this I ended up dating my first \"real girlfriend\" in 11th grade. Whom had high expectations of me. She pushed harder and faster for physical contact and sex than I was. In fact 100% more than I was. My feelings and wants were disregarded in her path to force herself unto me. Which caused our break up a week after beginning the relationship. \n\nFool me once. Shame on me. \n\nShe cried.. like I was a puppy she had owned for 10'000 years. She wrote the ex love letters/to take her back/ she apologized. And I fell back in.. for a week. Until the same mistakes were made, and the same conversation had been had over and over. I had to end it.\n\nFollowing this came constant harassment from her. She would come to my lunch spot daily and cry, break glass bottles near me, yell and even sometimes punch or kick me.\n\nThese events caused me to remember the things in my past that I seemed to have looked over for some time. Thus sending my slow spiral downward.. into a straight drop.\n\nI disconnected from a lot of people. It was hard for me to get along or be friends with anyone but after that it just seemed much more difficult. Now I had history.\n\nMy typical day consisted of going to class, to class, to class... to lunch, to sit alone and stare at the clouds pass by.. or sometimes watch the shadow casted by the tree above my concrete spot. I didn't eat. I hardly spoke. People would visit but I was all but there - Mentally at least. \n\nThis is about the time I started seeing a therapist, whom after my first appointment sent me to a psychologist to be assessed. I was diagnosed with Severe Depression/Major Depression, which I have odd feelings about.\n\nSometime during this era I had invited one of my closer friends over to hang out. Being suicidal during this time I would casually make jokes at school or at home. But when my friend went over I pretended like he hurt my feelings and stuck a belt in the door and hung myself.. for no longer than 5 seconds, and it was funny. This sparked a habit that went on for about a year.\n\nI was hanging myself on a nightly basis to make my brain stop.\n\nI was hanging myself so I could fall asleep.\n\nThat seemed to be the only way to get away from myself.\n\nEventually I went too far and broke blood vessels, my mother noticed a day later when my face, neck and eyes were blotched with purple and red marks which ended up getting me baker acted and hospitalized for 4 days.\n\nI did my good boy act and got out faster than most and without staining my record.\n\nMy parents were convinced that all the time I spent alone was causing this behavior/ so they practically ended up forcing social interactions unto me, which led to many falling outs and..\n\nThings sparked up a little after meeting another girl who lived an hour drive away(not that it matters).. She breathed a life in me I don't think I'll ever be able to find again. She turned my world inside-out. The space between myself and all other people seemed much shorter now, and I no longer felt that I was alone in this world. She showed me sides of myself I never saw before. She played a big role in who I am today.\n\nYet, like all good things. It came to an end. She went to see the movie \"Logan\", and soon after called me. Telling me that we were breaking up. I still haven't gotten a reason why.\n\nAfter this I think I'd lost touch with just about everything. I had lost all interest in anything. I spent the summer before college lying in bed 16 hours a day. I stopped playing videogames, I stopped talking to my friends. I stopped talking to my family. Although I never really talked that much in the first place.\n\nAround the time I started college, I had been relatively self harm sober. I would occasionally chew the tips of my hair combs into sharper points to drag across my chest whenever I didn't want my heart and mind to hurt anymore.\n\nI met a girl during hurricane Irma. Fast forward a year and I'm still dating her. We've broken up twice. I did it both times. I don't think my feelings are the same as they were when we met. She's been doing a lot of growing, and the reason I broke up with her was because she was very childish and had unrealistic expectations. Wanting more time from me than I gave myself.  I ended up dropping out of college after 1 semester.\n\nDuring the course of the relationship I picked up cutting. It started with glass, and later - shaving - razor blades, which I bent into a triangular shape to cut deeper and easier.\n\n&amp;#x200B;\n\nNow that you're up to speed. My Unorthodox Methods of Dealing with Depression\n\nThe medicine I take now helps me fall asleep - it was prescribed by my psychologist along with Prozac. And unfortunately - making me drowsy is all the medicine seems to do\n\nPrior to this my head would burn and thoughts would not stop until I asphyxiated myself, using a belt, blanket, and or hands.. etc. This caused my brain to focus on physical pain instead of mental torment. While my body focused on not physically dying - it became easier to fall asleep. However I would never enter R.E.M sleep/ thus no dreams.. The sleep was usually not revitalizing when I awoke the next morning\n\nDue to self asphyxiation I did end up in the hospital for the suicide attempt that I was caught for because I had broken my blood vessels in my face and neck. \n\n&amp;#x200B;\n\nThen I worked at a yacht club, this job kept me busier than I likely ever was beforehand. To the point where the stress had me blitzing across the dining rooms to get things done. Often times a waiter or member would break a glass, I was typically the first responder on these situations. I usually ended up picking up the broken glass with my bare hands - either cutting myself on purpose/ or sticking it in my pocket for later- I'd either cut in the car whilst driving listening to loud music, or in the quiet comfort of my cold room. The uniform there was long sleeve shirts/ and I typically where jackets or long sleeves everywhere I go anyways. \n\nI did not cut for attention. I self harm for mental relief.\n\nThe job at the yacht club eventually broke my spirit one too many times and I dropped my badge and quit.\n\n&amp;#x200B;\n\nNow I work as a security officer. And I have more time to think than I know what to do with. After giving up glass not even a few weeks beforehand. I got into a scuffle with my parents and ended up deciding to move out. During the interim between getting an apartment I got to stay at my fathers house while he was away on vacation with my girlfriend.\n\n&amp;#x200B;\n\nThis was the first time we spent more than a day or two together.\n\nMy feelings got so bad I waited for her to leave or to hang out with someone else so I could fix myself.\n\nAnd so I did, she left one day to go play dnd and I decided to bend my razor blades and slash all over my left arm and chest, nearly causing myself to faint = in combination with the hot shower water. The shower made it easier to cut.. It made it entertaining.. Blood dripped down my arms and chest and it was... fascinating. It made me feel quite alive, to just let the blood flow out of me. \n\nThis sparked a trend that lasts to this day. My left arm is riddled with scar marks.\n\n&amp;#x200B;\n\nFor methods that appear safer in the public eye...\n\nFor awhile I wrote songs and had drawings that accompanied or highlighted them.\n\nI still have those songs but that need to write has long since left me until now. - I guess that's why Im here posting on reddit for the first time.\n\nI also do pen work, heavily influenced by troubles that are my own and.. maybe things you can relate with.\n\nI'd hate to self advertise but..\n\n[https://www.instagram.com/4no\\_limits/](https://www.instagram.com/4no_limits/)\n\n&amp;#x200B;\n\nIf the picture I've painted for you here isn't enough. Maybe that will satisfy you.\n\nAnd if that's not enough. I suppose you have a way to message me.\n\n&amp;#x200B;", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398508, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "From a Tormented Mind..", "url": "https://www.reddit.com/r/depression/comments/9qs3xl/from_a_tormented_mind/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Sea-of-Needles", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_hyc7ddw", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540228952, "domain": "instagram.com", "full_link": "https://www.reddit.com/r/depression_help/comments/9qfxnw/im_stuck_in_a_place_i_cant_get_out_of_and_this_is/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qfxnw", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": false, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9qfxnw/im_stuck_in_a_place_i_cant_get_out_of_and_this_is/", "pinned": false, "retrieved_on": 1540228953, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 18394, "subreddit_type": "public", "thumbnail": "default", "title": "I'm stuck in a place I can't get out of, and this is how I express myself.", "url": "https://www.instagram.com/4no_limits/"}]}