{"data": [{"author": "shortstuff_005", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_nkkr1dk", "can_mod_post": false, "contest_mode": false, "created_utc": 1538294628, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9k4mti/im_tired_of_being_me/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9k4mti", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9k4mti/im_tired_of_being_me/", "pinned": false, "pwls": 6, "retrieved_on": 1538294629, "score": 1, "selftext": "The worst part about all of this pain and self hatred right now is that it wasn’t brought on by anything specific tonight. I’ve never posted here, but I’ve never felt more alone. I’m reaching out because since I was diagnosed with depression this past April it feels like I’ve exhausted all of my friends and family. They seem to think I’m starting to get better because I can see how it’s wearing on them and I’m trying to hide it more. \n\nI went on a date tonight. My ex dumped me at the end of June this year. I’m trying to get back out there. Being dumped wasn’t the trigger for my depression, it was the abuse beforehand. But abuse for me isn’t new. I just haven’t realized until recently how it’s been a constant in my life for as long as I’ve been alive, I just never really noticed it because it was always there. The guy I went out with was so sweet, but I kept reacting out of instinct to how I wild react to the way my ex treated me and this sweet guy would assure me he wouldn’t hurt me like that. Compared to him, I am so broken. And I don’t want to be treated as something fragile. But I’m starting to feel as though I might be. \n\nI’ve been abused my whole life. I grew up in a broken home. I’ve always seemed to be involved with people who treat me in the way that I am familiar with, which I have only now begun to realize is abusive. I was brought up in that way though, Being treated as such feels comfortable. I didn’t know any better. It’s ingrained into who I am or so it feels like. I am tired of being me. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 391290, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I’m tired of being me", "url": "https://www.reddit.com/r/depression/comments/9k4mti/im_tired_of_being_me/", "whitelist_status": "all_ads", "wls": 6}]}