{"data": [{"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1424483694, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/2wm4g0/adderall_interfering_with_romantic_life/", "id": "2wm4g0", "is_self": true, "num_comments": 12, "over_18": false, "permalink": "/r/ADHD/comments/2wm4g0/adderall_interfering_with_romantic_life/", "retrieved_on": 1440895331, "score": 8, "selftext": "I'm 19 years old, diagnosed with ADHD 2 years ago, in my senior year of high school, and I've been on Adderall ever since. I took it every day until December, when I stopped taking it for winter break because I felt that I was becoming dependent on it and it was severely increasing my anxiety. Now, I only take it once a week or so, when I particularly need it to focus.\n\nI don't want to go into all the details of my personal life here, but just to give you the relevant background information, I'm very romantically inexperienced (haven't had a boyfriend since 9th grade) and haven't really pursued any sort of romantic relationship since starting college, but for the past month or so there's this guy I've been talking to, and we both like each other, and it's the strongest I've felt about anyone in years. Except that when I take Adderall, it seems to kill all my feelings for him. Like, all of a sudden I'm entirely uninterested in him romantically and his flirting annoys me. Which is pretty frustrating to me.\n\nI'm trying to figure out why Adderall might have this effect on me. After all, it increases dopamine, which is associated with love, isn't it? So you would think it would make me feel more strongly for him, not less. On the other hand, it also definitely increases my anxiety, and I already know that some of my anxiety both stems from and interferes with my romantic relationships, and makes it harder to feel positively about the source of said anxiety (that is, the object of my affections, the person I'm anxious about).\n\nHas anybody else experienced this or a similar issue on Adderall? And is there anything that can be done about it that won't leave me falling out of love every time I need to focus?", "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "thumbnail": "self", "title": "Adderall interfering with romantic life?", "url": "http://www.reddit.com/r/ADHD/comments/2wm4g0/adderall_interfering_with_romantic_life/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1424498489, "domain": "self.misophonia", "full_link": "https://www.reddit.com/r/misophonia/comments/2wms18/ranting_my_coping_mechanism_has_been_forbidden_by/", "id": "2wms18", "is_self": true, "num_comments": 11, "over_18": false, "permalink": "/r/misophonia/comments/2wms18/ranting_my_coping_mechanism_has_been_forbidden_by/", "retrieved_on": 1440895025, "score": 12, "selftext": "I've been spending a lot of time in the guest bedroom lately because it's quiet in there and I can't hear as much of the noise from the rest of the house. But my mother just arbitrarily decided that I can't use that room anymore, which means I'm back in my room, where anything on the TV or anything my parents say to each other is audible as a constant murmur in the background. I can even hear it above music playing through headphones. Hearing muffled speech through walls and such is a major trigger for me, and now I'm not allowed to escape it.", "stickied": false, "subreddit": "misophonia", "subreddit_id": "t5_2sd5e", "thumbnail": "self", "title": "Ranting -- My coping mechanism has been forbidden by my mother.", "url": "http://www.reddit.com/r/misophonia/comments/2wms18/ranting_my_coping_mechanism_has_been_forbidden_by/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1431886476, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/36a7a3/cashiersales_associate_with_adhd/", "id": "36a7a3", "is_self": true, "num_comments": 9, "over_18": false, "permalink": "/r/ADHD/comments/36a7a3/cashiersales_associate_with_adhd/", "retrieved_on": 1440730715, "score": 3, "selftext": "I currently have a job working in retail at a pet store as a cashier/sales associate, and when I'm not on Adderall (which is most of the time because I don't have a psychiatrist to prescribe it anymore...) it is TORTURE. The job is so boring, and I feel like my mind is working against me the whole time. When I am on Adderall, it's still boring, but the brain fog clears up and I don't feel like my mind is preventing me from focusing on work anymore. Has anybody else found working in retail to be pretty unbearable when unmedicated? Like, it's so bad that I've been considering quitting, even though I could use the money, because I dread going to work every day and it feels like torture every moment I'm there. On the other hand, today I took one of my spare Adderall IRs I have on hand for emergencies, and despite still being a shitty job, I feel so much better about it. But I can't do that every day.", "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "thumbnail": "self", "title": "Cashier/Sales Associate with ADHD?", "url": "http://www.reddit.com/r/ADHD/comments/36a7a3/cashiersales_associate_with_adhd/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1431893056, "domain": "self.Trichsters", "full_link": "https://www.reddit.com/r/Trichsters/comments/36ak9g/trich_and_adderall/", "id": "36ak9g", "is_self": true, "num_comments": 11, "over_18": false, "permalink": "/r/Trichsters/comments/36ak9g/trich_and_adderall/", "retrieved_on": 1440730547, "score": 6, "selftext": "I have both trichotillomania and ADHD, and I find that when I take Adderall for the ADHD, my trichotillomania gets MUCH worse. Has anybody else experienced this?", "stickied": false, "subreddit": "Trichsters", "subreddit_id": "t5_2s7dh", "thumbnail": "self", "title": "Trich and Adderall?", "url": "http://www.reddit.com/r/Trichsters/comments/36ak9g/trich_and_adderall/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1438192872, "domain": "self.MakeupAddiction", "full_link": "https://www.reddit.com/r/MakeupAddiction/comments/3f21l3/foundation_gathering_in_pores/", "id": "3f21l3", "is_self": true, "num_comments": 7, "over_18": false, "permalink": "/r/MakeupAddiction/comments/3f21l3/foundation_gathering_in_pores/", "retrieved_on": 1440581455, "score": 1, "selftext": "Every time I use foundation, it seems to gather in my (rather large) pores and look very unnatural and cakey. But looking at all the pictures on here, everyone else's foundation looks so smooth and even. So what could my problem be? I don't know if it's a problem with the foundation I'm using (though this has happened with every foundation I've tried), or with my primer, or with my application technique, or what.\n\nI've been using the MUFE Mat Velvet foundation applied with a UD Optical Blurring brush over MUFE HD primer.", "stickied": false, "subreddit": "MakeupAddiction", "subreddit_id": "t5_2rww2", "thumbnail": "self", "title": "Foundation gathering in pores?", "url": "http://www.reddit.com/r/MakeupAddiction/comments/3f21l3/foundation_gathering_in_pores/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1438497796, "domain": "self.SkincareAddiction", "full_link": "https://www.reddit.com/r/SkincareAddiction/comments/3fhkkt/product_question_will_paulas_choice_2_bha_gel/", "id": "3fhkkt", "is_self": true, "link_flair_css_class": "PQ", "link_flair_text": "Product Question", "num_comments": 5, "over_18": false, "permalink": "/r/SkincareAddiction/comments/3fhkkt/product_question_will_paulas_choice_2_bha_gel/", "retrieved_on": 1440574090, "score": 1, "selftext": "This may be a very stupid question. I've recently started using the Paula's Choice Skin Perfecting 2% BHA Gel, and I like it, but when I use it it leaves a sort of gel film over my face instead of absorbing completely. I've been putting on  my Pocketderm prescription after it (after waiting 15-30 minutes), but I was wondering if the film left on my face would prevent my Pocketderm from fully being absorbed? It does seem a little more difficult to completely rub in than it is without using the BHA gel beforehand, but I don't know if that would actually effect how well it works or not.", "stickied": false, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "thumbnail": "self", "title": "[Product Question] Will Paula's Choice 2% BHA gel interfere with my Pocketderm?", "url": "http://www.reddit.com/r/SkincareAddiction/comments/3fhkkt/product_question_will_paulas_choice_2_bha_gel/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1438676622, "domain": "texasobserver.org", "full_link": "https://www.reddit.com/r/todayilearned/comments/3fq48q/til_a_neurosurgeon_infamous_for_maiming_and/", "id": "3fq48q", "is_self": false, "num_comments": 2, "over_18": false, "permalink": "/r/todayilearned/comments/3fq48q/til_a_neurosurgeon_infamous_for_maiming_and/", "post_hint": "link", "preview": {"images": [{"id": "k2vYnCv7lTS02KmPXFsewnN_wuZUzHK37eJ9uz-qyKc", "resolutions": [{"height": 134, "url": "https://i.redditmedia.com/iGZOnz1B6M9YedRsBZjohepXl5M6IEbmKK6xwxU_Du0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=fdaf4125cb37195da9c825bcabe6e6a7", "width": 108}, {"height": 268, "url": "https://i.redditmedia.com/iGZOnz1B6M9YedRsBZjohepXl5M6IEbmKK6xwxU_Du0.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=9fb0bd953f9e6cd44fb8242cc9612887", "width": 216}], "source": {"height": 357, "url": "https://i.redditmedia.com/iGZOnz1B6M9YedRsBZjohepXl5M6IEbmKK6xwxU_Du0.jpg?s=99339a5e806aee1ae05cb8469a1ee121", "width": 287}, "variants": {}}]}, "retrieved_on": 1440570042, "score": 15, "stickied": false, "subreddit": "todayilearned", "subreddit_id": "t5_2qqjc", "thumbnail": "http://b.thumbs.redditmedia.com/-O9Oc3owPyupgvWNyldxJTkO3atlZXyhGb2Gdo8oglg.jpg", "title": "TIL a neurosurgeon infamous for maiming and killing patients before losing his medical license was arrested for shoplifting.", "url": "http://www.texasobserver.org/surgeon-christopher-duntsch-arrested-for-shoplifting-pants/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1438981182, "domain": "imgur.com", "full_link": "https://www.reddit.com/r/MakeupAddiction/comments/3g69dn/my_first_fotd_cc_very_w/", "id": "3g69dn", "is_self": false, "num_comments": 12, "over_18": false, "permalink": "/r/MakeupAddiction/comments/3g69dn/my_first_fotd_cc_very_w/", "post_hint": "link", "preview": {"images": [{"id": "YnthCeJ-M-7TSaWYLD8h69PKA4ojxI1yH7U-73BA_TE", "resolutions": [{"height": 144, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=d8c2ad2643f940b634c9cecdc7172524", "width": 108}, {"height": 288, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=7b7253b56ee359622e1b1c344b42872f", "width": 216}, {"height": 426, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=1f549aa547d90010d6b25e7a4c47ffa9", "width": 320}, {"height": 853, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=f61eb02fa6e418c12625931efc2840f2", "width": 640}, {"height": 1280, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=2f9f3b82f7ea1ba24eca4abc67169bcd", "width": 960}], "source": {"height": 1280, "url": "https://i.redditmedia.com/FmiN_pfS2C7Ub7idvAotG0kCbjEHymM5RtRTjfalWKI.jpg?s=95300bc86bf823f45763801dd408dcd9", "width": 960}, "variants": {}}]}, "retrieved_on": 1440562449, "score": 7, "stickied": false, "subreddit": "MakeupAddiction", "subreddit_id": "t5_2rww2", "thumbnail": "http://b.thumbs.redditmedia.com/q4OzucJcYNG44u5kf6CAEL80e1n4LMflLHYVf6U3ATI.jpg", "title": "My first FOTD - CC very W", "url": "https://imgur.com/a/OJ2qA?"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1439139580, "domain": "self.MakeupAddiction", "edited": 1439140051, "full_link": "https://www.reddit.com/r/MakeupAddiction/comments/3gd57c/really_picky_and_searching_for_an_hg_foundation/", "id": "3gd57c", "is_self": true, "num_comments": 8, "over_18": false, "permalink": "/r/MakeupAddiction/comments/3gd57c/really_picky_and_searching_for_an_hg_foundation/", "retrieved_on": 1440559178, "score": 1, "selftext": "I've been having a lot of trouble finding a foundation that would meet all my needs, and I was hoping some of you here could help. I have what I think is combination skin, with a T-zone that gets very oily, especially when I'm very makeup, but also some dry spots from my acne medication, and spots that can get very dry in the winter (Iowa wind could make anyone's skin dry). I have large pores that foundation tends to settle in and look awful. I also have significant acne and acne scarring that I'd like to cover, so something full-coverage would be great. Lastly, my skin is very pale and I've had trouble with certain brands finding a foundation that'll match it.\n\nAt Sephora they recommended MUFE's Mat Velvet to mitigate how oily my skin gets when I wear foundation and also to provide fuller coverage (they also tried KVD's Lock It foundation, but the lightest color it came it was still a little too dark and yellow for me), but the Mat Velvet really collects in my pores and looks cakey and unnatural, and also doesn't look good on the drier parts of my face. Is there anything you guys can recommend that would look a little more smooth/natural/skin-like on my face, while still providing full coverage over my acne and scars? And are there any other tips you can give me for making my foundation look a little better?\n\nEdited to add: Cheaper is obviously better, but if you have an expensive foundation to recommend, I'm certainly open to considering it.", "stickied": false, "subreddit": "MakeupAddiction", "subreddit_id": "t5_2rww2", "thumbnail": "self", "title": "Really picky and searching for an HG foundation", "url": "http://www.reddit.com/r/MakeupAddiction/comments/3gd57c/really_picky_and_searching_for_an_hg_foundation/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1439777880, "domain": "self.relationships", "edited": 1439785670, "full_link": "https://www.reddit.com/r/relationships/comments/3h9mnv/cant_keep_dealing_with_my_19f_kindof_boyfriends/", "id": "3h9mnv", "is_self": true, "link_flair_css_class": "m-vt relationships", "link_flair_text": "Relationships", "num_comments": 14, "over_18": false, "permalink": "/r/relationships/comments/3h9mnv/cant_keep_dealing_with_my_19f_kindof_boyfriends/", "retrieved_on": 1440543707, "score": 6, "selftext": "Sorry, this wound up longer than I intended.\n\nThis past January, I wound up having to take a semester-long leave of absence from college (halfway through my 2nd year) after failing all of my classes the semester before (last fall) due to severe anxiety and depression. I was initially really upset about this, and posted about it a lot on my page on my school's own private social media site. A 31-year-old (at the time) alumnus of my school happened upon my post and let me know that he had been through a similar thing while he was there and invited me to text him if I needed support. I was feeling really alone and like I had nobody to talk to, so I did text him, and we wound up hitting it off and talking a lot.\n\nIt quickly became pretty clear that he had a crush on me, and after a while he admitted as much. I was resistant to any sort of romantic relationship with him at first, both because he's so much older than me and because I didn't want to have to worry about that while I was still trying to figure my own shit out, but I continued texting him a lot because I was stuck at home and lonely and didn't feel like I had anyone else to talk to. After a while, though, I did start to develop feelings for him, and I was pretty open with him about them (which made him very happy).\n\nThen in March, he basically had a psychotic break. Lots of paranoid delusions and stuff like that. It was really scary. He felt like everyone was out to get him and it seemed like I was the only one he would trust enough to talk to about what was going on. After Skypeing with him for most of a weekend and watching him get worse and worse, I managed to convince him to go to the ER. After that, he was on medication, and it got better for a while.\n\nUntil it got worse again. He wasn't having paranoid thoughts again (or definitely not to the same extent), but around mid or late May he started having extreme insomnia, which is still an ongoing problem. He decided to stop seeing his psychologist because he didn't feel like therapy was doing anything for him. He wanted to stop taking his medication because he hated the side effects. In early July he was extremely suicidal and would spend hours Skypeing with me just talking about how much he wanted to die and all the ways he could think of to kill himself. After a particularly bad day, when I was actually convinced he was going to kill himself if something didn't intervene or if I stopped Skypeing with him, I managed to convince him to go to the ER again, and he was admitted, but he left again after a few days and wasn't really any better. They had tried a bunch of different medication on him in the hospital, but nothing really helped his anxiety or made it possible for him to sleep for more than 3 or 4 hours a night. (Edited to clarify: He is still seeing his psychiatrist and taking what's prescribed to him, but they haven't found anything that will really help, and I think all he's on now is gabapentin as needed for anxiety.) We went straight back into our usual routine of Skypeing for hours every night while I listened to him talk about everything that was fucked up in his brain.\n\nThis has all been really stressful for me. I was supposed to use this semester off to work on my issues, but I feel like I haven't addressed any of my problems at all and have instead spent the whole time (hours-long conversations almost every day) talking to him about his problems. Now I'm going back to school in a week, and I know that I can't handle this on top of the stress of transitioning back into school. I finally talked to him last week about how stressed it was making me feel, and he promised he'd back off, stop talking to me so much about how he wanted to kill himself, etc. \n\nBut then in the past couple days it's gotten worse again. I'm housesitting for a family friend this weekend, and I was hoping that having a weekend away would give me some time to myself to relax, but I've wound up having to Skype with him for hours every night because he's been having a hard time. Last night he was freaking out, banging his head against the wall again and again while all I could do was sit there and listen and cry, talking about how he wanted to kill himself and looking up the dosages of various drugs he would need to do it, insisting that he must have some sort of brain damage, etc. And I just know I won't be able to handle something like that while I'm at school, and I know I can't trust things to be any different when I go back.\n\nSo I don't know what to do. I want to be there for him, and I sincerely care about him. I feel like I can't cut off all contact with him because I'd be losing one of my best friends, and I'm so, so worried that that would push him over the edge and cause him to kill himself (especially because he keeps saying I'm the best thing in his life, he doesn't know what he'd do without me, etc). But if I keep talking to him, I know things won't be any different, and I won't be able to set boundaries because I'll feel like I need to be there for him to keep things from getting even worse for him. He also expects us to meet up in person for the first time when I get back to school, because we'll only be 3 hours apart instead of halfway across the country from each other, but I honestly don't know if that's what I want to do anymore. I just feel so trapped, like there's no decision I can make here that could possibly work out well for either me or him.\n\n---\n\n**TL;DR: Took a semester off to work on my issues, spent the whole time working on his issues instead, now going back to school. Don't feel like I can break things off without abandoning him (and possibly causing him to kill himself), but also feel like I can't continue things while trying to handle school again, so what can I do?**", "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "thumbnail": "self", "title": "Can't keep dealing with my [19F] kind-of boyfriend's [32M] mental illness and instability", "url": "http://www.reddit.com/r/relationships/comments/3h9mnv/cant_keep_dealing_with_my_19f_kindof_boyfriends/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1440683413, "domain": "self.MakeupAddiction", "edited": 1440683924, "full_link": "https://www.reddit.com/r/MakeupAddiction/comments/3iljtb/foundation_settling_in_pores_concealer_not/", "id": "3iljtb", "is_self": true, "num_comments": 16, "over_18": false, "permalink": "/r/MakeupAddiction/comments/3iljtb/foundation_settling_in_pores_concealer_not/", "post_hint": "self", "preview": {"images": [{"id": "xvjBaQ1e69m5op8MIHhzgMi5i6r2SHkF15U0wJdrKfI", "resolutions": [{"height": 144, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=471a4f5de66b3bb8b0ff66f084ade8e9", "width": 108}, {"height": 288, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=bf903ee4cb6c3be56850354dece7c05c", "width": 216}, {"height": 426, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=27e9a03c785fd0177ba727e688590541", "width": 320}, {"height": 853, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=b02e556b1aae1721d07d0585873e7346", "width": 640}, {"height": 1280, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=e8b9e2ad8e178fc3521fa0bc14aba443", "width": 960}], "source": {"height": 1280, "url": "https://i.redditmedia.com/Em0ttLNPc4iDF33Ytvx0F4CMrT3uHI1ovfL5J2TKMhI.jpg?s=83c88c91b78fe455a21368b81d409bc4", "width": 960}, "variants": {}}]}, "retrieved_on": 1443146122, "score": 3, "selftext": "[My dumb face](http://imgur.com/I9pccWv)\n\nSorry for the crap picture quality, but hopefully you can see my problem here. I put on primer (Smashbox Photo Finish Pore Minimizing), foundation (MUFE Mat Velvet) and concealer (Nars Radiant Creamy Concealer). The foundation and concealer all settles right into my pores and looks awful, and the concealer won't actually stay on my acne and cover it very much, no matter how much I cake onto it. I feel like putting so much concealer on is making the pores look worse, but there's no way to cover my acne otherwise. Does anyone have any advice on how I could make this work better? Thanks!\n\nEdited to add: [Here's](http://imgur.com/HFYOYHP) a better-quality picture showing more of my face. It looks like I have concealer caked into all of my pores, but my acne and scars are still highly visible.", "stickied": false, "subreddit": "MakeupAddiction", "subreddit_id": "t5_2rww2", "thumbnail": "self", "title": "Foundation settling in pores, concealer not covering acne - Help!", "url": "https://www.reddit.com/r/MakeupAddiction/comments/3iljtb/foundation_settling_in_pores_concealer_not/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1440907449, "domain": "self.depression", "edited": 1440908456, "full_link": "https://www.reddit.com/r/depression/comments/3ix7tk/i_feel_like_im_not_legit_because_ive_never_tried/", "id": "3ix7tk", "is_self": true, "num_comments": 51, "over_18": false, "permalink": "/r/depression/comments/3ix7tk/i_feel_like_im_not_legit_because_ive_never_tried/", "retrieved_on": 1443151630, "score": 61, "selftext": "Is it weird that I feel like a fake because I’ve never actually seriously tried to kill myself? Like, I’ve thought about it a lot (very much, very seriously, for years), but never actually gone through with it, and I feel like that kind of delegitimizes the whole thing, like obviously it couldn’t have been THAT bad if I never actually attempted. And people who actually do attempt to kill themselves (and are therefore objectively More Depressed than me) still manage to do better than I do, so I can’t really use my mental health as an excuse for my failure.\n\nBut on the other hand, I feel like maybe it’s just a personality thing rather than evidence that I'm not \"that depressed\", because I don’t do ANYTHING without excessively overthinking it first, so I feel like I would never be able to make such a huge decision as killing myself just because I’m constantly talking myself into it and then talking myself out of it again, no matter how much I actually want to do it, and the result is just inaction. So maybe I’m not actually any more mentally healthy objectively speaking, and the fact that I haven’t actually tried to kill myself is just an extension of my inability to allow myself to make any reckless decisions or take definitive action ever.\n\nBut I still feel like a fraud. Like I’m only pretending to be seriously mentally ill, and I don’t actually have any excuse at all for failing as much as I have.", "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "thumbnail": "self", "title": "I feel like I'm not \"legit\" because I've never tried to kill myself", "url": "https://www.reddit.com/r/depression/comments/3ix7tk/i_feel_like_im_not_legit_because_ive_never_tried/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1441507533, "domain": "self.misophonia", "edited": 1441508048, "full_link": "https://www.reddit.com/r/misophonia/comments/3jteu8/dorm_neighbor_constantly_watching_tv/", "id": "3jteu8", "is_self": true, "locked": false, "num_comments": 10, "over_18": false, "permalink": "/r/misophonia/comments/3jteu8/dorm_neighbor_constantly_watching_tv/", "retrieved_on": 1450816236, "score": 5, "selftext": "One of my major triggers is hearing muffled voices or music through walls. So naturally, living in dorms at college is torture for me. I hoped it would be a little better this year because I don't have a roommate and my floor only has 9 people on it and isn't super-loud. But unfortunately, it turns out the guy in the room next door watches TV or listens to shitty music for hours and hours every day. Of course I fucking wind up right next to the only person on the floor who feels the need to constantly have noise emanating from his room.\n\nI woke up today to the sound of TV through the wall. Still watching when I left earlier. Now he's fucking watching again. I'm trying to clean my room, but I just can't because the sound is driving me insane. It wouldn't be a problem if I lived anywhere other than right next to him, because it's not super-loud or anything, so I don't feel justified in going and asking him to turn it down. It's just a quiet, muffled stream of background noise coming through the wall, which is honestly more distracting and difficult to ignore than if someone was having a conversation right next to me. I just want to be able to have some peace and quiet in my own room. And even when he isn't making any noise, whenever I'm in my room I'm constantly on edge because I know it's bound to start again soon. I can't relax.\n\nJust ranting, I guess, but if anybody has any advice I'd love to hear it.", "stickied": false, "subreddit": "misophonia", "subreddit_id": "t5_2sd5e", "thumbnail": "self", "title": "Dorm neighbor constantly watching TV", "url": "https://www.reddit.com/r/misophonia/comments/3jteu8/dorm_neighbor_constantly_watching_tv/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1441511610, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/3jtlpc/i_dont_know_how_to_make_friends/", "id": "3jtlpc", "is_self": true, "locked": false, "num_comments": 17, "over_18": false, "permalink": "/r/depression/comments/3jtlpc/i_dont_know_how_to_make_friends/", "retrieved_on": 1450816148, "score": 1, "selftext": "I want to go to the all-campus party tonight. But I don't have anybody to go with. I'd probably see someone I know and maybe I could shove myself into their conversation and they'll put up with it for a few minutes until I go away because they're too polite to tell me to fuck off. But it's not like anybody will see me and think, \"Oh, I want to spend time with her.\" It's not like anybody ever invites me to do anything with them. Nobody has any interest in actually being my friend. So if I'd just be forcing myself on people who don't really have any interest in seeing me, maybe I should just sit alone in my room instead, like I do every night.\n\nI see people sitting around hanging out with their friends, talking, and I just don't know how they do it. How do you actually find people who will want to spend time with you on a regular basis? Am I just so unlikable to absolutely everybody that I just can't find anybody to spend any time with?", "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "thumbnail": "self", "title": "I don't know how to make friends.", "url": "https://www.reddit.com/r/depression/comments/3jtlpc/i_dont_know_how_to_make_friends/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1442188308, "domain": "self.MakeupAddiction", "full_link": "https://www.reddit.com/r/MakeupAddiction/comments/3kufrv/clear_lip_tar_vs_lip_tar_primer_same_thing/", "id": "3kufrv", "is_self": true, "locked": false, "num_comments": 2, "over_18": false, "permalink": "/r/MakeupAddiction/comments/3kufrv/clear_lip_tar_vs_lip_tar_primer_same_thing/", "post_hint": "self", "preview": {"images": [{"id": "7umsN1iuG38NVuExVwQvxWuFZcN2FDHhJjbjyWM-SZ8", "resolutions": [{"height": 247, "url": "https://i.redditmedia.com/duiWQ6t16ywOKe6OPqwsMwDaPfFxvCQPhvTmt17kFMs.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=b3cee33f6a97c4df4f6e278e62faacb6", "width": 108}], "source": {"height": 459, "url": "https://i.redditmedia.com/duiWQ6t16ywOKe6OPqwsMwDaPfFxvCQPhvTmt17kFMs.jpg?s=ffa4fc57784c9923adfe0c9376a9808c", "width": 200}, "variants": {}}]}, "retrieved_on": 1450798415, "score": 7, "selftext": "I have one bottle of clear lip tar (like the one [here](http://www.amazon.com/OCC-Lip-Tar-Primer-Clear/dp/B007NXZ3OU)), and one lip tar primer (like [here](http://occmakeup.com/products/lip-tar-clear)). They both came in separate sets of lip tars. Would one be better to use as a primer under my lip tar than the other, or are they the same product with updated packaging?", "stickied": false, "subreddit": "MakeupAddiction", "subreddit_id": "t5_2rww2", "thumbnail": "self", "title": "Clear Lip Tar vs. Lip Tar Primer -- Same thing?", "url": "https://www.reddit.com/r/MakeupAddiction/comments/3kufrv/clear_lip_tar_vs_lip_tar_primer_same_thing/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1444014202, "domain": "imgur.com", "full_link": "https://www.reddit.com/r/SkincareAddiction/comments/3nj3az/ba_pocketdermcurology_for_1_year_my_lack_of/", "id": "3nj3az", "is_self": false, "link_flair_css_class": "BA", "link_flair_text": "Selfie/B&amp;A", "locked": false, "media": {"oembed": {"description": "Acne was probably a little worse after a month than it was when I started, which wasn't entirely unexpected. Still optimistic about progress... This is when my prescription was changed to include tretinoin. Finally seeing progress! Still getting breakouts, but not as bad or as painful, better overall skin texture, less inflamed, and some of my scarring seems to be fading.", "height": 550, "html": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FZ5Ahu%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FZ5Ahu&amp;image=http%3A%2F%2Fi.imgur.com%2FBnYvqNk.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "Imgur", "provider_url": "http://imgur.com", "thumbnail_height": 270, "thumbnail_url": "http://i.imgur.com/BnYvqNk.jpg?fb", "thumbnail_width": 480, "title": "PocketDerm/Curology Progress", "type": "rich", "version": "1.0", "width": 550}, "type": "imgur.com"}, "media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"//cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FZ5Ahu%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FZ5Ahu&amp;image=http%3A%2F%2Fi.imgur.com%2FBnYvqNk.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 550, "scrolling": false, "width": 550}, "num_comments": 41, "over_18": false, "permalink": "/r/SkincareAddiction/comments/3nj3az/ba_pocketdermcurology_for_1_year_my_lack_of/", "post_hint": "link", "preview": {"images": [{"id": "N22_Dl9e5IKQqiOlrqZHXv84b27NYeEcd5s1rPflSlE", "resolutions": [{"height": 60, "url": "https://i.redditmedia.com/iUC8qUCxEwR7zDqU-xWTpG5m8cWpt9X_ksZlTslwkPc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=fc68ec86549667958e61ed12fecedd78", "width": 108}, {"height": 121, "url": "https://i.redditmedia.com/iUC8qUCxEwR7zDqU-xWTpG5m8cWpt9X_ksZlTslwkPc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=856789e7efd8ba3f6895d7411c01c838", "width": 216}, {"height": 180, "url": "https://i.redditmedia.com/iUC8qUCxEwR7zDqU-xWTpG5m8cWpt9X_ksZlTslwkPc.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=01935e2070c9336a85d7a72b726f7eb9", "width": 320}], "source": {"height": 270, "url": "https://i.redditmedia.com/iUC8qUCxEwR7zDqU-xWTpG5m8cWpt9X_ksZlTslwkPc.jpg?s=97e538715bb25f02c86dc2f563463b1d", "width": 480}, "variants": {}}]}, "retrieved_on": 1450752538, "score": 20, "secure_media": {"oembed": {"description": "Acne was probably a little worse after a month than it was when I started, which wasn't entirely unexpected. Still optimistic about progress... This is when my prescription was changed to include tretinoin. Finally seeing progress! Still getting breakouts, but not as bad or as painful, better overall skin texture, less inflamed, and some of my scarring seems to be fading.", "height": 550, "html": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FZ5Ahu%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FZ5Ahu&amp;image=http%3A%2F%2Fi.imgur.com%2FBnYvqNk.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "Imgur", "provider_url": "http://imgur.com", "thumbnail_height": 270, "thumbnail_url": "https://i.embed.ly/1/image?url=http%3A%2F%2Fi.imgur.com%2FBnYvqNk.jpg%3Ffb&amp;key=b1e305db91cf4aa5a86b732cc9fffceb", "thumbnail_width": 480, "title": "PocketDerm/Curology Progress", "type": "rich", "version": "1.0", "width": 550}, "type": "imgur.com"}, "secure_media_embed": {"content": "&lt;iframe class=\"embedly-embed\" src=\"https://cdn.embedly.com/widgets/media.html?src=%2F%2Fimgur.com%2Fa%2FZ5Ahu%2Fembed&amp;url=http%3A%2F%2Fimgur.com%2Fa%2FZ5Ahu&amp;image=http%3A%2F%2Fi.imgur.com%2FBnYvqNk.jpg%3Ffb&amp;key=2aa3c4d5f3de4f5b9120b660ad850dc9&amp;type=text%2Fhtml&amp;schema=imgur\" width=\"550\" height=\"550\" scrolling=\"no\" frameborder=\"0\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 550, "scrolling": false, "width": 550}, "stickied": false, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "thumbnail": "http://b.thumbs.redditmedia.com/5uGBfEZMpd-zeItDVau3ZsyUkTpjASLz9I--UlSpu1k.jpg", "title": "[B&A] PocketDerm/Curology for 1 year... My (lack of) progress", "url": "http://imgur.com/a/Z5Ahu"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1445544495, "domain": "self.AskReddit", "full_link": "https://www.reddit.com/r/AskReddit/comments/3ptdys/what_does_love_feel_like_to_you/", "id": "3ptdys", "is_self": true, "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/AskReddit/comments/3ptdys/what_does_love_feel_like_to_you/", "retrieved_on": 1450713295, "score": 2, "stickied": false, "subreddit": "AskReddit", "subreddit_id": "t5_2qh1i", "thumbnail": "self", "title": "What does love feel like to you?", "url": "https://www.reddit.com/r/AskReddit/comments/3ptdys/what_does_love_feel_like_to_you/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1447184953, "domain": "self.Trichsters", "full_link": "https://www.reddit.com/r/Trichsters/comments/3sba7o/this_is_getting_seriously_debilitating/", "id": "3sba7o", "is_self": true, "locked": false, "num_comments": 9, "over_18": false, "permalink": "/r/Trichsters/comments/3sba7o/this_is_getting_seriously_debilitating/", "retrieved_on": 1450670761, "score": 15, "selftext": "I'm pulling so much lately. I feel like I'm wasting my entire life doing nothing but pulling out my hair. I'm more than half-bald now, but I don't even care about the hair loss anymore (well, okay, I do, but not as much as the other impact it has on my life). \n\nLately I've had days where I start pulling and I just can't stop for hours, and I've missed so many of my classes because I just haven't been able to stop pulling for long enough to go to them. Or I'll stay up all night pulling out my hair, won't get any of my homework done, and then I'll be too exhausted to go to class in the morning. I take ADHD meds (previously Adderall, now trying Concerta) because I can't focus on my schoolwork otherwise, but they also exacerbate my pulling so much. It's like, either I can take a stimulant, focus enough to get a little work done, and then pull out my hair for hours, or I can take nothing, not be able to focus on anything, feel half-asleep all day, and still pull my hair, albeit a little less severely. At this point it seems likely that I'm going to have to drop out of school. \n\nTrich usually isn't presented as something this severe, and often it seems like it's more of a cosmetic concern than anything. But when I'm spending hours and hours every single day pulling out my hair and doing nothing else, completely unable to stop, it's so much worse than that. I don't know what to do.", "stickied": false, "subreddit": "Trichsters", "subreddit_id": "t5_2s7dh", "thumbnail": "self", "title": "This is getting seriously debilitating.", "url": "https://www.reddit.com/r/Trichsters/comments/3sba7o/this_is_getting_seriously_debilitating/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1447242440, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/3sea8k/switching_concerta_generics_who_do_i_go_to/", "id": "3sea8k", "is_self": true, "locked": false, "num_comments": 7, "over_18": false, "permalink": "/r/ADHD/comments/3sea8k/switching_concerta_generics_who_do_i_go_to/", "retrieved_on": 1450669291, "score": 1, "selftext": "I took Adderall XR for about 2.5 years, but recently switched to Concerta to see if that would exacerbate my anxiety and trichotillomania a little less than the Adderall did. I was on 18mg 2x/day for the first month, but that didn't feel like it was doing much, so my psychiatrist decided to increase the dose to 27mg 2x/day. For the first month, I got the Actavis generic. When I filled my new prescription for the higher dose, I wound up with the Mallinckrodt generic. I think the increased dose is good, but the effects aren't lasting nearly long enough, and even taking it twice a day, it still wears off too soon.\n\nMeanwhile, I've been reading up on Concerta generics, and found that the Mallinckrodt generic was [downgraded by the FDA](http://www.fda.gov/Drugs/DrugSafety/ucm422568.htm) and is no longer an approved substitution for a Concerta prescription. Relevant excerpt:\n>As a result, the FDA has changed the therapeutic equivalence (TE) rating for the Mallinckrodt and Kudco products from AB to BX. This means the Mallinckrodt and Kudco products are still approved and can be prescribed, but are no longer recommended as automatically substitutable at the pharmacy (or by a pharmacist) for Concerta.\n\nI'm kind of pissed that they substituted my Concerta with something that the FDA has specifically said should not be substituted for it. Like, \"Your doctor wrote you this prescription for Concerta, and the FDA has said that this isn't actually equivalent to Concerta, but we're gonna give it to you anyways because fuck you.\" How is that legal?\n\nSo anyways, I'd really like to try the approved generic again (which is what I was already on last month; I just needed a higher dose). If that's not possible, I'd be willing to have my psychiatrist specify that I need the brand instead of the generic (I had to do that for Adderall, too), but I would rather avoid having to pay twice as much a month for it if possible. \n\nSo my question is, how can I go about possibly getting switched to the other generic? Would it be possible for me to print out that FDA report, show it to the pharmacist, be like \"Fuck you, why'd you give me this crap, give me the real shit instead\" (more diplomatically than that, of course) and have them switch me over right then? Or would I need to make another appointment with my psychiatrist and get another prescription first? I'd really rather not have to go through the rest of the month on something that isn't as effective as it should be, especially with the amount of pressure I'm under to keep doing well in school right now.\n", "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "thumbnail": "self", "title": "Switching Concerta generics -- Who do I go to?", "url": "https://www.reddit.com/r/ADHD/comments/3sea8k/switching_concerta_generics_who_do_i_go_to/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1449713941, "domain": "self.NoStupidQuestions", "full_link": "https://www.reddit.com/r/NoStupidQuestions/comments/3w5u3t/should_an_opened_container_of_storebought/", "id": "3w5u3t", "is_self": true, "link_flair_css_class": "flair a", "link_flair_text": "Unanswered", "locked": false, "num_comments": 1, "over_18": false, "permalink": "/r/NoStupidQuestions/comments/3w5u3t/should_an_opened_container_of_storebought/", "retrieved_on": 1454917198, "score": 1, "selftext": "A friend of mine used some store-bought canned vanilla frosting for a cake for her friend's birthday a few days ago, and then left the rest of the frosting sitting out until today, when she gave it to me because she doesn't have any use for it. Given that the can says to refrigerate after opening, but it still looks and smells normal, should it still be okay to eat?", "stickied": false, "subreddit": "NoStupidQuestions", "subreddit_id": "t5_2w844", "thumbnail": "self", "title": "Should an opened container of store-bought frosting that's been sitting out unrefrigerated for a few days still be okay to eat?", "url": "https://www.reddit.com/r/NoStupidQuestions/comments/3w5u3t/should_an_opened_container_of_storebought/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1449956706, "domain": "self.SkincareAddiction", "full_link": "https://www.reddit.com/r/SkincareAddiction/comments/3wkdm9/acne_necessary_medication_possibly_causing_acne/", "id": "3wkdm9", "is_self": true, "link_flair_css_class": "Acne", "link_flair_text": "Acne", "locked": false, "num_comments": 7, "over_18": false, "permalink": "/r/SkincareAddiction/comments/3wkdm9/acne_necessary_medication_possibly_causing_acne/", "retrieved_on": 1454924122, "score": 8, "selftext": "I posted here a while back about my [progress on PocketDerm](https://www.reddit.com/r/SkincareAddiction/comments/3nj3az/ba_pocketdermcurology_for_1_year_my_lack_of/), and particularly lamented the fact that my skin had seemed to be improving in the spring/summer, and then got much worse again. I took some of the advice given in that thread and went back to the more simple routine I had been using in the spring, but I haven't seen much improvement.\n\nNow, I've been thinking about what might have been the difference back in the spring, given that changes in my routine don't seem to be making a difference at all, and now that I've realized what the problem might be it seems so obvious, I don't know how I missed it. \n\nI had already had acne for years in high school, but it seems like it got significantly worse around August 2013, heading into my first semester of college. In fact, while I felt like shit about my skin for most of high school, looking back on pictures from the end of high school/summer before college now, I'm kind of amazed by how good my skin looks compared to how it looks now. I was diagnosed with ADHD in February of my senior year of high school (2013) and went on Adderall XR. I took it fairly consistently from summer 2013 until December 2014 (when I had already been on PocketDerm for a few months, with little in the way of results). \n\nAt that point, I took a semester off from school. I was at home with no psychiatrist to prescribe me my ADHD meds, and not as much reason to take them anyways because I didn't have any schoolwork to worry about, and what do you know, that semester is when my skin was starting to look a little better. Then it got notably worse again when I came back to school and started taking my meds again (Concerta this time, not Adderall XR). I think the Concerta is making it even worse than the Adderall did, although it's better for me in other ways.\n\nObviously none of this is proof that it's my meds that are causing my acne, but it does seem suspicious that my acne got much worse around the time I started taking them, got a little better when I wasn't taking them, and now is worse again.\n\nSo my question is: Assuming it's my medication that's causing this exacerbation of my acne, what are my options? I can't stop taking my medication. I need it to succeed in school (and I'm barely managing that as it is). But I'd also like to not look like a freak and have my face feel constantly uncomfortable or in pain. Is there anything I can be doing to mitigate the effects of my meds?\n\nMy routine:\n\nAM:\n\n* Wash w/ Neutrogena Naturals Purifying Facial Cleanser (in shower)\n* CeraVe Moisturizing Lotion\n\n\nPM:\n\n* Wash face w/ Neutrogena Naturals Purifying Facial Cleanser\n* PocketDerm\n\nI also started taking birth control about a month ago to see if that would help with any hormonal aspects of my acne. It hasn't seemed to help at all yet, but I'm holding out hope that it still might help my skin a little (even if the majority of my acne is caused by my Concerta).\n\nNote: I know a ton of you are going to come in saying I need to be using sunscreen. I know. Stop. I'm asking about my acne, and unless you know a magical sunscreen that cures acne, I'm not interested. I will definitely invest in finding a sunscreen that won't break me out further once I get my current skin problems under control, but until then, it isn't my primary concern, and telling me about it is entirely non-helpful.", "stickied": false, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "thumbnail": "self", "title": "[Acne] Necessary medication possibly causing acne... What are my options?", "url": "https://www.reddit.com/r/SkincareAddiction/comments/3wkdm9/acne_necessary_medication_possibly_causing_acne/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1451253327, "domain": "self.stopsmoking", "full_link": "https://www.reddit.com/r/stopsmoking/comments/3yfynj/helping_my_boyfriend_quit_from_halfway_across_the/", "id": "3yfynj", "is_self": true, "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/stopsmoking/comments/3yfynj/helping_my_boyfriend_quit_from_halfway_across_the/", "retrieved_on": 1454956229, "score": 5, "selftext": "My boyfriend has smoked for years and is now trying to quit. It's a long-distance relationship, and while we're going to see each other for a bit in late January, right now I'm halfway across the country. We Skype and text a lot, though. Can you think of anything I could be doing for him to help encourage or distract him that I don't need to be there in person to do?", "stickied": false, "subreddit": "stopsmoking", "subreddit_id": "t5_2rbuf", "thumbnail": "self", "title": "Helping my boyfriend quit from halfway across the country?", "url": "https://www.reddit.com/r/stopsmoking/comments/3yfynj/helping_my_boyfriend_quit_from_halfway_across_the/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1451721957, "domain": "self.techtheatre", "full_link": "https://www.reddit.com/r/techtheatre/comments/3z4bjl/student_stage_manager_résumé/", "id": "3z4bjl", "is_self": true, "link_flair_css_class": "education", "link_flair_text": "EDUCATION", "locked": false, "num_comments": 6, "over_18": false, "permalink": "/r/techtheatre/comments/3z4bjl/student_stage_manager_résumé/", "retrieved_on": 1454967803, "score": 18, "selftext": "I'm a college student working on applying for stage management internships for this coming summer, and I'm trying to figure out how to format my résumé. Does anyone have a good template to use, or any general tips? \n\nAlso, is it worthwhile to include non-SM tech theatre experience on my résumé? For example, I work in the scene shop at my college, and I've previously done a scene shop/run crew internship. Considering that internship is my only professional theatre experience, I'd obviously like to include it, but how? Should that sort of stuff be in a separate section from my SM experience? Since I was there for a summer stock season of four shows, should I list each show separately?\n\nAlso, any additional general résumé advice would be very much appreciated.", "stickied": false, "subreddit": "techtheatre", "subreddit_id": "t5_2r2ne", "thumbnail": "self", "title": "Student stage manager résumé?", "url": "https://www.reddit.com/r/techtheatre/comments/3z4bjl/student_stage_manager_résumé/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1452342117, "domain": "self.hamiltonmusical", "full_link": "https://www.reddit.com/r/hamiltonmusical/comments/40644o/transferring_lottery_tickets/", "id": "40644o", "is_self": true, "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/hamiltonmusical/comments/40644o/transferring_lottery_tickets/", "retrieved_on": 1454988265, "score": 6, "selftext": "I'm going down to the city with my mom today. She has other plans for lunch and dinner, but I'm gonna try for Ham4Ham for both shows today. If we both stand in line for the lottery (I think it's still live today, yes?), could we both enter the lottery, and if she wins, could she give me her ticket? I know you need ID matching the lottery entry to get the ticket, but could she give it to me afterwards? I heard they give you a wristband if you win so you don't transfer the ticket to anyone else, but if I went up with her (if she wins, which is still a big if, obviously), could they just give me the wristband even if the entry is in her name? Or would that be cheating the system and not allowed?\n\nThanks!", "stickied": false, "subreddit": "hamiltonmusical", "subreddit_id": "t5_392ob", "thumbnail": "self", "title": "Transferring lottery tickets?", "url": "https://www.reddit.com/r/hamiltonmusical/comments/40644o/transferring_lottery_tickets/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1459583362, "domain": "self.starbucks", "edited": 1459585263, "full_link": "https://www.reddit.com/r/starbucks/comments/4d0o7q/forgot_about_a_conflict_when_agreeing_to_an_extra/", "id": "4d0o7q", "is_self": true, "locked": false, "num_comments": 3, "over_18": false, "permalink": "/r/starbucks/comments/4d0o7q/forgot_about_a_conflict_when_agreeing_to_an_extra/", "retrieved_on": 1463515295, "score": 1, "selftext": "I've only been working at Starbucks for about 2 weeks now. I wasn't originally supposed to work this Sunday, but when I got into work yesterday (Friday), my SM asked me if I could go cover a shift in another store Sunday morning. It was right after he confirmed my availability for Sundays (I can't work after 6pm that day due to another commitment), so I was preoccupied thinking about my availability on Sundays in general, and it completely slipped my mind that I already had a prior commitment for this coming Sunday in particular that would start right in the middle of the shift I agreed to. It's an event I'm signed up for that I've already paid for and can't get a refund. I could potentially skip it, but I'd be out money and I really don't want to miss this thing. On the other hand, I don't want to make myself look unreliable when I'm so new to this job, or inconvenience anybody too much.\n\nSo basically, my question is, how bad would it look if I went to my SM today and told him I can't cover that shift after all? If it would screw everyone over and make me look awful, I'll probably just suck it up and go to work and skip the event I was signed up for, but if you guys think it wouldn't be a huge deal, then I'd much rather not be out the money and skip this thing that I was really looking forward to.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Forgot about a conflict when agreeing to an extra shift?", "url": "https://www.reddit.com/r/starbucks/comments/4d0o7q/forgot_about_a_conflict_when_agreeing_to_an_extra/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1461211226, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4frauw/not_allowed_to_trade_ampm_shifts/", "id": "4frauw", "is_self": true, "locked": false, "num_comments": 8, "over_18": false, "permalink": "/r/starbucks/comments/4frauw/not_allowed_to_trade_ampm_shifts/", "retrieved_on": 1463562162, "score": 1, "selftext": "I'm a lowly green bean of 4 weeks, and another not-quite-as-green bean (I think she was hired 2 weeks before me?) asked two days ago if I could cover her 3 - 10:30pm closing shift next Friday, and offered to take my 6 - 10am shift next Tuesday in exchange (but said I could just take her Friday shift and keep my Tuesday shift too if I needed the hours). I both desperately need more hours (only 9 hours this week? I have bills to pay, damn it) and desperately don't want to have to work at 6 and then go to class all day, so I agreed readily and she said she would ask to make sure we could trade. Today she got back to me and said she was told that we couldn't trade because we'd be switching a.m. and p.m. shifts and that neither of us \"knows how to do the opposite of what we normally do,\" so we couldn't trade.\n\nI was just wondering if anyone could give me some insight into whether this is normal or not? Are you not allowed to trade an a.m. shift for a p.m. shift? I work mostly afternoons, and I've actually closed or pre-closed a few times, whereas I've never had to work at 6am before, so it wouldn't be \"the opposite of what I normally do\" at all. Even if they didn't want us to trade, why wouldn't I be allowed to just take the Friday shift and keep the Tuesday morning one too? Could anyone explain the thought process on this decision to me?", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Not allowed to trade a.m./p.m. shifts?", "url": "https://www.reddit.com/r/starbucks/comments/4frauw/not_allowed_to_trade_ampm_shifts/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1461981691, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4h2obx/taxes_on_tips/", "id": "4h2obx", "is_self": true, "locked": false, "num_comments": 16, "over_18": false, "permalink": "/r/starbucks/comments/4h2obx/taxes_on_tips/", "retrieved_on": 1463584687, "score": 2, "selftext": "I've only been working for Starbucks about 5.5 weeks, and I've never had a job where I've received tips before. So what I'm wondering is if tips are taxed, and I should be keeping track of my tip money each week? Is that something I'll have to disclose when doing taxes next year? I haven't been keeping track because I just didn't think of it, but I'll definitely start if it's something I could get in trouble for later.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Taxes on tips?", "url": "https://www.reddit.com/r/starbucks/comments/4h2obx/taxes_on_tips/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1462521253, "domain": "self.starbucks", "edited": 1462521555, "full_link": "https://www.reddit.com/r/starbucks/comments/4i45st/learning_other_roles/", "id": "4i45st", "is_self": true, "locked": false, "num_comments": 3, "over_18": false, "permalink": "/r/starbucks/comments/4i45st/learning_other_roles/", "retrieved_on": 1466431829, "score": 0, "selftext": "I've been working at Starbucks for about 6.5 weeks now, but I haven't made a single drink (other than the occasional refresher or iced tea) since my second week in during training. I am always on either R1 or DTO/DTR. I'm fine with doing those (I actually really like doing DT!), but I feel like my knowledge is really lacking in other areas, and as I get further removed from training I just feel like I'm forgetting more and more of the other roles rather than getting the hang of everything like I should be. It's not that I'm bad at other things, it's that I literally just haven't had a chance to learn them at all.\n\nThe thing is, I'm mostly working in the morning during peak, so I can understand just putting me where I'll be most efficient rather than putting me somewhere where I don't know what I'm doing and slowing things down. Looking at the schedule for the next two weeks, I'm literally only working during peak or Happy Hour, so no real slow time when I could take my time to get the hang of other things. I feel like if I was on bar during peak (for basically my first time on bar ever, aside from shadowing someone one day during training), I'd freak out or get overwhelmed, and I really don't want to slow everything down. Same goes for CS. The other day I came in for my shift at 7am and I was actually assigned to CS in the DCR, which I was excited to do for the first time ever, but I mentioned to the SS that I hadn't done it before and needed some guidance/to look at the sheet we have that lists all the CS tasks and sequence, and she just had me switch back to DTO instead.\n\nSo basically, my question is how I can try to get the hang of the roles I'm never assigned to without throwing off everyone else during busy times?", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Learning other roles?", "url": "https://www.reddit.com/r/starbucks/comments/4i45st/learning_other_roles/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "created_utc": 1463292122, "domain": "self.goodyearwelt", "edited": 1463331810, "full_link": "https://www.reddit.com/r/goodyearwelt/comments/4jexvf/cat_puke_on_boots/", "id": "4jexvf", "is_self": true, "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/goodyearwelt/comments/4jexvf/cat_puke_on_boots/", "retrieved_on": 1466460273, "score": 1, "selftext": "[removed]", "stickied": false, "subreddit": "goodyearwelt", "subreddit_id": "t5_2w64o", "thumbnail": "default", "title": "Cat puke on boots", "url": "https://www.reddit.com/r/goodyearwelt/comments/4jexvf/cat_puke_on_boots/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1463803327, "domain": "self.starbucks", "edited": 1463804048, "full_link": "https://www.reddit.com/r/starbucks/comments/4kc104/pay_discrepancy_between_tarbucks_and_corporate/", "id": "4kc104", "is_self": true, "locked": false, "num_comments": 12, "over_18": false, "permalink": "/r/starbucks/comments/4kc104/pay_discrepancy_between_tarbucks_and_corporate/", "retrieved_on": 1466475951, "score": 5, "selftext": "I was hired about two months ago, making $9.05/hr (minimum wage here is $9) plus tips at a corporate Starbucks. A friend of mine who's a few years younger than I am (still in high school, meaning less relevant work experience, etc.) just got hired at a Target Starbucks in the same area making $11/hr plus tips. Is it normal for Target to pay so much more? It seems strange to me that a 16-year-old still in high school with little experience would get paid so much more that minimum wage in the same area doing basically the same job. I also haven't heard of any other baristas starting out a whole $2/hr above minimum wage. I was under the impression that it was pretty much always a near-minimum-wage sort of job to start out.\n\nOn that note, if Tarbucks really do pay that much better, is there any possibility of transferring? Or is transferring between a corporate and licensed store not really a thing? Because if I had known that Target paid so much more to start with, I definitely would have applied there instead.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Pay discrepancy between Tarbucks and corporate stores?", "url": "https://www.reddit.com/r/starbucks/comments/4kc104/pay_discrepancy_between_tarbucks_and_corporate/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1464293834, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4l79vu/a_rant_about_hours_insurance_and_miscommunication/", "id": "4l79vu", "is_self": true, "locked": false, "num_comments": 2, "over_18": false, "permalink": "/r/starbucks/comments/4l79vu/a_rant_about_hours_insurance_and_miscommunication/", "retrieved_on": 1466490808, "score": 0, "selftext": "Last week, I talked to my ASM about needing more hours because my current health insurance is up in August and I'd like to be eligible for the Sbux health insurance, which requires averaging 20 hours a week. She said she'd work to try to schedule me for at least 20 hours a week, and pointed out a list of shifts that needed coverage at another store the next city over for this week (for which I was originally only scheduled 9.5 hours). I agreed to take two of them and she said she'd arrange it with the SM there. It was made clear that she'd arrange it and that I didn't need to call or anything.\n\nNext time I was in, I checked with her to make sure I was all set to cover those shifts, and she told me that I was definitely needed for the Thursday shift (today), but that the Saturday shift would possibly be covered by somebody else and that she'd get back to me on that. Fine, okay.\n\nSo today, I drove 20 freaking minutes to this other store, only to be told that there must have been some sort of miscommunication and that I wasn't needed today, only Saturday. So then I got to turn around and drive 20 minutes back (on a sunny day in 80 degree heat with the AC in my car broken, which isn't Starbucks' fault, but hey, if I could afford to get that fixed I also wouldn't need to be picking up extra shifts in another city). So that was a tremendous waste of gas and time because nobody can freaking communicate.\n\nAnd guess what? Without that shift, I'm still only at 17 hours for this week! I'm also only scheduled for 14 hours next week. And the week after that, the first schedule since I talked to my ASM about needing more hours because I need health insurance... I only have 13.5 hours.\n\nI think I need to find a new job.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "A rant about hours, insurance, and miscommunication.", "url": "https://www.reddit.com/r/starbucks/comments/4l79vu/a_rant_about_hours_insurance_and_miscommunication/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1466023162, "domain": "self.starbucks", "edited": 1466023662, "full_link": "https://www.reddit.com/r/starbucks/comments/4o9izn/working_with_that_one_person/", "id": "4o9izn", "is_self": true, "locked": false, "num_comments": 17, "over_18": false, "permalink": "/r/starbucks/comments/4o9izn/working_with_that_one_person/", "retrieved_on": 1472781311, "score": 14, "selftext": "Does anybody else have that one particular partner that they just dread working with?\n\nThere's this one shift who just makes me feel like shit. I get anxious even just thinking about working with them, or when I see that we're working together on the schedule. I know I'm still pretty new (3 months) and I sometimes do stupid shit, and I don't mind criticism, but I feel like with this one shift, I can't do anything right. I don't mind constructive criticism, and other shifts certainly let me know when I'm fucking something up, but with this one I'm just constantly on edge no matter what I'm doing because I just know they're gonna walk up behind me and tell me I'm doing something wrong, even if I'm just freaking stickering cups (which is apparently \"standing around,\" even if it's literally what the other shift told me I should be doing when I'm not busy).\n\nI had a great day yesterday, got complimented by two other more experienced partners for how on top of everything I was, and felt great about work. Then I got in this morning and was working with this one shift and immediately felt like I was in the way (they actually physically pushed me out of the way when I was trying to get a battery for my headset), and all day it seemed like I couldn't do anything right. I kinda get the feeling that they hate me, but I don't know why. I really am trying to do everything that they tell me to, but it's always wrong somehow (even when none of the other shifts seem to have a problem with me).\n\nIt's at the point where working with them genuinely makes me want to quit, and I don't know how I'm going to get through next week (when all of my shifts overlap with theirs almost completely) when just thinking about it sends my anxiety through the roof (when I already have a problem with anxiety). The only times I've ever cried at work have been because of feeling like I can't possibly meet their standards. But at the same time, I don't want to quit when I've genuinely been enjoying work and getting better whenever that one shift *isn't* there. In a way I kind of feel like I'm overreacting, like maybe this shift just has high standards for everyone and I should be able to handle it. But at the same time, they also seem a lot nicer to everyone else, even though they do have high standards. At the same time, though, they haven't said or done anything particularly heinous or mean to me, they just constantly nitpick everything I do... which I guess is kind of their job? But if it's to the point where I feel that I can't do anything right and I dread even seeing them... I don't know. I just feel like I try so hard and want so badly to do well (if I didn't care about working hard, why would I feel so anxious about it, y'know?), but it's never enough.\n\nSorry about the rant. I'm just feeling really frustrated and anxious. Has anybody else ever felt like shit about working with one particular partner? How did you deal with it?", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Working with that one person...", "url": "https://www.reddit.com/r/starbucks/comments/4o9izn/working_with_that_one_person/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1466559676, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4p886i/aprons/", "id": "4p886i", "is_self": true, "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/starbucks/comments/4p886i/aprons/", "retrieved_on": 1472799418, "score": 11, "selftext": "So I'm reading through the Partner Guide, and I noticed it says \"Upon hire, each partner will receive two or more aprons in good condition.\" I only got one (I think they only had one two-pack, so I got one and the guy I trained with, who has since quit, got the other). It'd be great to have a spare to switch out when I don't have time to do laundry. Is there a way I can get another? I know they have them on the Coffee Gear site, but I'd rather not have to pay $18 + shipping for something I should have been given in the first place. I don't think my store has any spares.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Aprons?", "url": "https://www.reddit.com/r/starbucks/comments/4p886i/aprons/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1466995943, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4q160r/leg_pain/", "id": "4q160r", "is_self": true, "locked": false, "num_comments": 11, "over_18": false, "permalink": "/r/starbucks/comments/4q160r/leg_pain/", "retrieved_on": 1472814085, "score": 6, "selftext": "Does anybody else experience significant (or even insignificant, really) leg pain after long shifts? Does anybody have any tips to alleviate it?", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Leg pain?", "url": "https://www.reddit.com/r/starbucks/comments/4q160r/leg_pain/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1468293103, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/4sex74/vent_bad_day_feeling_useless/", "id": "4sex74", "is_self": true, "locked": false, "num_comments": 23, "over_18": false, "permalink": "/r/starbucks/comments/4sex74/vent_bad_day_feeling_useless/", "retrieved_on": 1472947949, "score": 4, "selftext": "I was doing floors today, taking a little longer than usual because I kept having to jump on front to take care of customers, when my favorite shift insisted on taking over and finishing them himself, with no explanation. After I clocked out, I was sitting in the café (I don't think he noticed I was still there) and I overheard him gossiping to another partner about how long it took me to do floors (though the time he mentioned was significantly longer than it was actually taking me before he took over -- I checked the time right before I started floors because I wanted to know how long I had before the end of my shift, and then again right after he had me stop, so I don't know where he got the impression that it was taking me that long). Still, even though I know I didn't take nearly as long as he said I did, I feel shitty that I would be so slow as to make him that frustrated with me, and even shittier that he would gossip about it behind my back instead of coaching me on what I'm doing wrong or addressing it with me at all. \n\nNow I just feel kinda useless, and I'm dreading going back to work and closing with the same shift tomorrow, knowing that he'll just talk to everyone else about everything I fuck up once I'm gone. I already have pretty bad social anxiety and I always get the feeling that people are criticizing me behind my back, but it really hurts coming from the shift who's always given me the most constructive criticism and helped me the most.", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "[Vent] Bad day, feeling useless.", "url": "https://www.reddit.com/r/starbucks/comments/4sex74/vent_bad_day_feeling_useless/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "created_utc": 1472676544, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/50jfkx/jacket_to_wear_in_dt/", "id": "50jfkx", "is_self": true, "locked": false, "num_comments": 10, "over_18": false, "permalink": "/r/starbucks/comments/50jfkx/jacket_to_wear_in_dt/", "retrieved_on": 1473097903, "score": 1, "selftext": "It's not a problem yet, as it's still in the 80s here, but I'm already dreading winter, as I live in the midwest US where it gets cold as fuck and I'm on DTR all the time. I was hired in late March, so it was already warmer at that point, but one time on a cold day when I was still new-ish I threw on the hoodie I wore into work to wear at the window, only for my shift to tell me I had to take it off and freeze for the rest of my shift because of the hood. So what do you guys wear at the window in the winter? I'm looking for something that's breathable and I can move in (so not a heavy winter coat or anything), but that'll keep me from freezing, and of course, most importantly, something that's within a barista budget. Any suggestions? Thanks!", "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Jacket to wear in DT?", "url": "https://www.reddit.com/r/starbucks/comments/50jfkx/jacket_to_wear_in_dt/"}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "contest_mode": false, "created_utc": 1477120583, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/58s2r3/calling_in_sick_for_an_opening_shift/", "id": "58s2r3", "is_self": true, "locked": false, "num_comments": 28, "over_18": false, "permalink": "/r/starbucks/comments/58s2r3/calling_in_sick_for_an_opening_shift/", "retrieved_on": 1480259044, "score": 3, "selftext": "I agreed to cover a partner's opening shift this morning. But I have to be there in 2.75 hours, and I've been up all night with severe stomach pains that show no signs of going away. I hate calling in sick, and I'd especially never want to do so for an opening shift because that screws the whole place over, but I simply don't see how I can work like this. My question is, how can I call in sick when it's the middle of the night and nobody's going to be in the store until I'm supposed to be there? I'm not 100% sure which shift I'm supposed to be opening with, though I can make an educated guess. Should I call them? Call my SM? I don't want to wake anybody up in the middle of the night unnecessarily, but I also don't want to leave my store stranded with nobody to open.", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "thumbnail": "self", "title": "Calling in sick for an opening shift?", "url": "https://www.reddit.com/r/starbucks/comments/58s2r3/calling_in_sick_for_an_opening_shift/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "contest_mode": false, "created_utc": 1490143786, "domain": "self.birthcontrol", "full_link": "https://www.reddit.com/r/birthcontrol/comments/60rkf2/is_it_significantly_more_painful_to_get_an_iud/", "id": "60rkf2", "is_self": true, "link_flair_css_class": "how", "link_flair_text": "How to Use?", "locked": false, "num_comments": 12, "over_18": false, "permalink": "/r/birthcontrol/comments/60rkf2/is_it_significantly_more_painful_to_get_an_iud/", "retrieved_on": 1492435306, "score": 3, "selftext": "My period has been unpredictable lately (for example, my period just started today, this past cycle was 27 days long, but the one before that was 40 days, and the one before that was 34 days). I want an IUD, but the soonest the Planned Parenthood near me (where I could get one for free) is taking appointments for IUD insertion is the first week of April, so there's no chance of getting one during this period, and I can't predict when my next one will be with any degree of accuracy, so I can't reliably schedule an appointment for during my next period. \n\nPain during insertion is my biggest concern with getting an IUD, though, as I'm kind of a wuss, and I've heard that getting it inserted during your period makes it a little less painful. So my question is, how much of a difference does getting it inserted when you're not on your period make? Does anybody here have any experiences with insertion while not on their period to share? Considering that I'm so concerned about pain, should I make my best effort to schedule an appointment for during my next period, with the knowledge that I very well may misestimate my cycle length and won't have my period at that time anyways? Or should I just get it over with and get it done the first week of April, when I *know* I won't have my period? ", "spoiler": false, "stickied": false, "subreddit": "birthcontrol", "subreddit_id": "t5_2snsq", "suggested_sort": null, "thumbnail": "self", "title": "Is it significantly more painful to get an IUD inserted when you don't have your period?", "url": "https://www.reddit.com/r/birthcontrol/comments/60rkf2/is_it_significantly_more_painful_to_get_an_iud/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1490475140, "domain": "self.AbyssRium", "full_link": "https://www.reddit.com/r/AbyssRium/comments/61hs7r/erasing_saved_data/", "id": "61hs7r", "is_self": true, "locked": false, "num_comments": 3, "over_18": false, "permalink": "/r/AbyssRium/comments/61hs7r/erasing_saved_data/", "retrieved_on": 1492449569, "score": 3, "selftext": "I downloaded and started playing this game earlier today during a break at work... Now that I'm home from work, I'd kind of like to just start over from the beginning now that I can pay attention, but I can't seem to find a way to delete my saved data. Even deleting and re-installing the app results in it reloading my data. Does anybody know if this is possible?", "spoiler": false, "stickied": false, "subreddit": "AbyssRium", "subreddit_id": "t5_3fngo", "suggested_sort": null, "thumbnail": "self", "title": "Erasing saved data?", "url": "https://www.reddit.com/r/AbyssRium/comments/61hs7r/erasing_saved_data/"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "contest_mode": false, "created_utc": 1491065452, "domain": "self.birthcontrol", "full_link": "https://www.reddit.com/r/birthcontrol/comments/62tvz0/kyleenaskyla/", "id": "62tvz0", "is_self": true, "link_flair_css_class": "which", "link_flair_text": "Which Method? ", "locked": false, "num_comments": 2, "over_18": false, "permalink": "/r/birthcontrol/comments/62tvz0/kyleenaskyla/", "retrieved_on": 1494549909, "score": 1, "selftext": "How exactly do I go about finding a doctor who'll give me one of these? I contacted Planned Parenthood, but all they do is Liletta... I might go with that option just because I can get it for free through Planned Parenthood, but I'd really prefer Kyleena or Skyla, but I have no idea how to find someone in my city who actually provides them.", "spoiler": false, "stickied": false, "subreddit": "birthcontrol", "subreddit_id": "t5_2snsq", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Kyleena/Skyla?", "url": "https://www.reddit.com/r/birthcontrol/comments/62tvz0/kyleenaskyla/", "view_count": null}, {"author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "brand_safe": true, "contest_mode": false, "created_utc": 1491570045, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/6407z6/are_barista_trainers_still_supposed_to_get_a_bonus/", "id": "6407z6", "is_self": true, "locked": false, "num_comments": 15, "over_18": false, "permalink": "/r/starbucks/comments/6407z6/are_barista_trainers_still_supposed_to_get_a_bonus/", "retrieved_on": 1494571211, "score": 5, "selftext": "If so, where can I find an official policy to show my manager? Thanks!", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Are barista trainers still supposed to get a bonus?", "url": "https://www.reddit.com/r/starbucks/comments/6407z6/are_barista_trainers_still_supposed_to_get_a_bonus/", "view_count": null}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1493845509, "domain": "self.PuzzleAndDragons", "full_link": "https://www.reddit.com/r/PuzzleAndDragons/comments/6936ps/what_to_pull_to_maximize_mp/", "id": "6936ps", "is_self": true, "is_video": false, "locked": false, "num_comments": 23, "over_18": false, "permalink": "/r/PuzzleAndDragons/comments/6936ps/what_to_pull_to_maximize_mp/", "retrieved_on": 1497048109, "score": 3, "selftext": "If the goal is purely to sell everything for as much MP per stone as possible, what/when would be the best to pull? Heroine REM would be at least 15k/roll, but also 10 stones. So would that be better or worse than a normal REM pull during a Godfest? I'd suck it up and do the math myself, but I'm not sure what the probabilities are in the first place.", "spoiler": false, "stickied": false, "subreddit": "PuzzleAndDragons", "subreddit_id": "t5_2w23a", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "What to pull to maximize MP?", "url": "https://www.reddit.com/r/PuzzleAndDragons/comments/6936ps/what_to_pull_to_maximize_mp/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1500011657, "domain": "self.Banished", "edited": 1500043056, "full_link": "https://www.reddit.com/r/Banished/comments/6n76xh/villagers_wandering_to_the_corner_of_the_map_and/", "id": "6n76xh", "is_self": true, "is_video": false, "locked": false, "num_comments": 9, "over_18": false, "permalink": "/r/Banished/comments/6n76xh/villagers_wandering_to_the_corner_of_the_map_and/", "retrieved_on": 1502101788, "score": 3, "selftext": "A bunch of my villagers are wandering up to the far northwest corner of my map, far away from any portion of my town, and then freezing and starving on their way back. I have no resource removal or production of any kind going on up there, and had never even looked at that part of the map until looking to see why people were freezing. Villagers with a variety of jobs are doing this instead of working; it's not just laborers or unoccupied workers of other jobs. There are even a couple children wandering around that area. When I zoom in up in that corner, there's what appears to be clothing floating there. What's going on and how do I stop it?\n\nI'm using the Colonial Charter mod.\n\nEdit: I figured out the problem. I had built one of the Colonial Charter bridges (the Old Creek Bridge, I think) across one of the small streams and then set to clear a bunch of resources across the bridge, but for some reason they wouldn't use the bridge once it was built and were going around the corner of the map instead. I built a different bridge and deleted that one, no problem anymore.", "spoiler": false, "stickied": false, "subreddit": "Banished", "subreddit_id": "t5_2wp64", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Villagers wandering to the corner of the map and freezing?", "url": "https://www.reddit.com/r/Banished/comments/6n76xh/villagers_wandering_to_the_corner_of_the_map_and/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1500442977, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/6o6ioo/transfer_request_denied/", "id": "6o6ioo", "is_self": true, "is_video": false, "locked": false, "num_comments": 16, "over_18": false, "permalink": "/r/starbucks/comments/6o6ioo/transfer_request_denied/", "retrieved_on": 1502119600, "score": 1, "selftext": "I'm moving across the country in a month and was arranging with my SM to transfer. It pretty much sounded like a done deal, but then he told me yesterday that our DM denied the transfer request. I'm moving either way, I have no choice, but now I don't have a job. Am I basically being fired without *technically* being fired? My SM said he'd talk to the DM of the district I was hoping to transfer to to see if they'll approve it, but I don't know what the chances are of that happening. I'm kind of freaking out now, and if I'm going to lose my job, I need to know and find a new one ASAP. I'm moving for school, but I'll have to drop out of school if I don't have health insurance... never mind not being able to afford rent or anything else. It's too late to back out of moving, but I can't afford to move without a job. Back in the spring when I was first planning this it was made to sound like it would be no problem at all, and if I had been told it would be, I would have already made other arrangements, but now I'm pretty much just screwed.", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Transfer request denied...", "url": "https://www.reddit.com/r/starbucks/comments/6o6ioo/transfer_request_denied/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1500930411, "domain": "self.legaladvice", "edited": 1500931446, "full_link": "https://www.reddit.com/r/legaladvice/comments/6pbeek/being_denied_instate_tuition_i_think_in_violation/", "id": "6pbeek", "is_self": true, "is_video": false, "locked": false, "num_comments": 5, "over_18": false, "permalink": "/r/legaladvice/comments/6pbeek/being_denied_instate_tuition_i_think_in_violation/", "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "S-i9lyIQns7iglAdcV8EnBA0WWhYCFgbOObMm6smwjo", "resolutions": [{"height": 108, "url": "https://i.redditmedia.com/GaU3n2cfaiLoSBF1rkFTNgoNZJsjd4OGdLPLd5EF8hw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=96e06c82c142a5823ce592e17bb14b0d", "width": 108}, {"height": 216, "url": "https://i.redditmedia.com/GaU3n2cfaiLoSBF1rkFTNgoNZJsjd4OGdLPLd5EF8hw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=e0af633e7d8f0b9d2cca3d7f577e0213", "width": 216}, {"height": 320, "url": "https://i.redditmedia.com/GaU3n2cfaiLoSBF1rkFTNgoNZJsjd4OGdLPLd5EF8hw.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=062bc04b6b90589802f1d405f4295ad0", "width": 320}], "source": {"height": 600, "url": "https://i.redditmedia.com/GaU3n2cfaiLoSBF1rkFTNgoNZJsjd4OGdLPLd5EF8hw.jpg?s=dbac6abd87f3279ea781c1df3213af29", "width": 600}, "variants": {}}]}, "retrieved_on": 1502140311, "score": 1, "selftext": "I graduated from high school in New York State in 2013. I've lived in a different state for the past year and a half, but I'm going back to school in NY in the fall. I've been informed that I don't qualify for in-state tuition. This seems to be directly in contradiction with NY education law (see [here](http://codes.findlaw.com/ny/education-law/edn-sect-6206.html)). \n\nRelevant section: \"... the payment of tuition and fees by any student who is not a resident of New York state, other than a non-immigrant alien within the meaning of paragraph (15) of subsection (a) of section 1101 of title 8 of the United States Code, shall be paid at a rate or charge no greater than that imposed for students who are residents of the state if such student:\n\n(i) attended an approved New York high school for two or more years, graduated from an approved New York high school and applied for attendance at an institution or educational unit of the city university within five years of receiving a New York state high school diploma.\"\n\nThe way I'm reading this is that I ought to qualify for the resident tuition rate on the basis of having graduated from high school in NY less than five years ago, despite not currently being a resident of the state. Am I interpreting this correctly? If so, what are my options for challenging this?\n\nEdited to add: The school I will be attending is one of the CUNY senior colleges.", "spoiler": false, "stickied": false, "subreddit": "legaladvice", "subreddit_id": "t5_2rawz", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Being denied in-state tuition, I think in violation of NY education law", "url": "https://www.reddit.com/r/legaladvice/comments/6pbeek/being_denied_instate_tuition_i_think_in_violation/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1501218799, "domain": "self.SkincareAddiction", "full_link": "https://www.reddit.com/r/SkincareAddiction/comments/6q1pa1/product_question_how_much_stock_should_i_put_in/", "id": "6q1pa1", "is_self": true, "is_video": false, "link_flair_css_class": "PQ", "link_flair_text": "Product Question", "locked": false, "num_comments": 4, "over_18": false, "permalink": "/r/SkincareAddiction/comments/6q1pa1/product_question_how_much_stock_should_i_put_in/", "retrieved_on": 1502153489, "score": 8, "selftext": "So I started to develop a routine about two years ago, maybe a little less, and I kept it up for a few months, but got discouraged by the fact that my acne was getting significantly worse long after any purging should have been over with. But my skin still sucks, so now I'm wanting to get back into it... but I'm moving across the country in a month and as a result, I really can't afford any unnecessary expenditures right now. But I still have the Paula's Choice AHA and BHA gels that I bought two years ago. Would it be safe to try using them again now? Or should I just put off setting up a new regular skincare routine for a few months until I can justify spending the money on new products?", "spoiler": false, "stickied": false, "subreddit": "SkincareAddiction", "subreddit_id": "t5_2tbbg", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "[Product Question] How much stock should I put in the expiration dates for chemical exfoliants?", "url": "https://www.reddit.com/r/SkincareAddiction/comments/6q1pa1/product_question_how_much_stock_should_i_put_in/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1502038253, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/6rzewd/somebody_broke_into_my_car/", "id": "6rzewd", "is_self": true, "is_video": false, "locked": false, "num_comments": 14, "over_18": false, "permalink": "/r/starbucks/comments/6rzewd/somebody_broke_into_my_car/", "retrieved_on": 1502314900, "score": 25, "selftext": "...and stole all my aprons. What the fuck? Is that seriously worth breaking my window? A personalized apron with my name embroidered on it and a few generic ones? That embroidered apron was a gift from my SM, he gave us all personalized aprons after the holidays. Those were the only things visible from the outside that were taken and no other cars in the lot were broken into... so seriously, somebody just targeted my car specifically to steal a bunch of Starbucks aprons?", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Somebody broke into my car...", "url": "https://www.reddit.com/r/starbucks/comments/6rzewd/somebody_broke_into_my_car/", "view_count": null}, {"approved_at_utc": null, "author": "Soramke", "author_flair_css_class": "sbux", "author_flair_text": "Barista", "banned_at_utc": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1502634886, "domain": "self.starbucks", "edited": 1502638874, "full_link": "https://www.reddit.com/r/starbucks/comments/6tfe8a/transferring_away_from_a_store_i_love/", "id": "6tfe8a", "is_self": true, "is_video": false, "locked": false, "num_comments": 9, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/6tfe8a/transferring_away_from_a_store_i_love/", "retrieved_on": 1502722231, "score": 12, "selftext": "I love my store. I love most of my partners, I love most of our regulars, I love DT, I love bar... but I'm moving across the country and transferring. My last day here is Friday. I've visited the cafe-only store I'm transferring to, and it's dirty, they fucked up a lot of drinks as I was watching (including mine), and everybody on the floor just looks so unhappy. My partners all joke around all the time and have genuine camaraderie. Every shift here, I feel so heartbroken that I have to leave, it's like I'm grieving. Not really looking for advice, I guess, just vent(i)ing. I know I should give it a shot and not judge the new store just based on three visits without even working there... but I know I'm going to miss my store a lot.", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "Transferring away from a store I love.", "url": "https://www.reddit.com/r/starbucks/comments/6tfe8a/transferring_away_from_a_store_i_love/", "view_count": null, "whitelist_status": "all_ads"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1515877870, "domain": "self.LoveNikki", "edited": 1515892146, "full_link": "https://www.reddit.com/r/LoveNikki/comments/7q79qo/how_fashionable_are_you_in_real_life/", "id": "7q79qo", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_css_class": "discussion", "link_flair_text": "Discussion", "locked": false, "num_comments": 63, "num_crossposts": 0, "over_18": false, "permalink": "/r/LoveNikki/comments/7q79qo/how_fashionable_are_you_in_real_life/", "pinned": false, "retrieved_on": 1515947686, "score": 28, "selftext": "Are you a Nikki-level stylist in real life? Or do you put minimal effort into your real clothing and focus all your efforts into virtual clothes? I was just curious how other people here are, because I was just thinking that it's kind of funny that I spend so much time playing this game and then pretty much just wear t-shirts and yoga pants/long skirts/shorts when I go out.", "spoiler": false, "stickied": false, "subreddit": "LoveNikki", "subreddit_id": "t5_3l0ds", "subreddit_type": "public", "thumbnail": "self", "title": "How fashionable are you in real life?", "url": "https://www.reddit.com/r/LoveNikki/comments/7q79qo/how_fashionable_are_you_in_real_life/"}, {"author": "Soramke", "author_flair_background_color": "", "author_flair_css_class": "barista", "author_flair_richtext": [{"e": "text", "t": "Barista"}], "author_flair_text": "Barista", "author_flair_text_color": "dark", "author_flair_type": "richtext", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517620920, "domain": "self.starbucks", "edited": 1517621149, "full_link": "https://www.reddit.com/r/starbucks/comments/7uw8b1/number_of_writeups_before_youre_fired/", "id": "7uw8b1", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 26, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/7uw8b1/number_of_writeups_before_youre_fired/", "pinned": false, "retrieved_on": 1517689031, "rte_mode": "markdown", "score": 3, "selftext": "Is there a rule for number of write-ups you can get before you get fired? I got written up back in June or July for being late too often (usually just by a minute or two, but for too many shifts). I transferred stores in August, and our old manager at the new store was super chill, but he got fired a few weeks ago and our interim manager likes write-ups a *lot*. I clocked in 6 minutes late today (subway delay) and someone else from his other store said the manager wrote him up for being 7 minutes late, so I’m worried. I’ve also clocked in a minute or two late for some other shifts recently (half the time the computer’s being used when I need to clock in and I have to wait, or it just takes forever to load). \n\nBased on that, do you think I’m at risk of being fired without warning, or is it more likely I’ll be written up again? I’d like to think I’m otherwise pretty good at my job. Been working for Starbucks almost 2 years, and nobody’s really expressed any issues with my work. My supervisors like me because I’m often the only one working while everybody else is slacking off. I’m good on bar and register. Just have a little trouble getting here on time.", "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_type": "public", "thumbnail": "self", "title": "Number of write-ups before you’re fired?", "url": "https://www.reddit.com/r/starbucks/comments/7uw8b1/number_of_writeups_before_youre_fired/", "whitelist_status": "all_ads"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1520521085, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/trees/comments/82y2ij/its_tiny_and_nothing_too_fancy_but_i_love_my/", "id": "82y2ij", "is_crosspostable": true, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": false, "num_comments": 101, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "promo_adult", "permalink": "/r/trees/comments/82y2ij/its_tiny_and_nothing_too_fancy_but_i_love_my/", "pinned": false, "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "R2g7QhUUMgnSdBzJnRqLpJes2lHidz1AUkww0EkklFc", "resolutions": [{"height": 144, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;fm=jpg&amp;s=75dbd25c07cba96c2ab7a72e90cc22f7", "width": 108}, {"height": 288, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;fm=jpg&amp;s=5bfa3ab5be2575fa4980696bbe79a5c2", "width": 216}, {"height": 426, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;fm=jpg&amp;s=4976f70aa3a123e6dab31422b757d5bb", "width": 320}, {"height": 853, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;fm=jpg&amp;s=54aa1fbd5b0847d578e573088d2bd4d4", "width": 640}, {"height": 1280, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;fm=jpg&amp;s=2c7a9e5b1396a087d2dc83aea5f75072", "width": 960}, {"height": 1440, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;fm=jpg&amp;s=1db7a3a0a51d53b8cede58e4906c7b48", "width": 1080}], "source": {"height": 4032, "url": "https://i.redditmedia.com/I_aoXqu_jBEG9po8nrPTdXutDUXrqXzXx-ZfdvPCr8I.jpg?fm=jpg&amp;s=22a5844142a0710a910b1b557f333365", "width": 3024}, "variants": {}}]}, "retrieved_on": 1520565690, "rte_mode": "markdown", "score": 943, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/i1jnmBCknnBHvtlNFcSIA2XJwRqrAvQTENHy2Iqqy3U.jpg", "thumbnail_height": 140, "thumbnail_width": 140, "title": "It’s tiny and nothing too fancy, but I love my first bong!", "url": "https://i.redd.it/6c8ovewb0kk01.jpg", "whitelist_status": "promo_adult"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1524438904, "domain": "self.vaporents", "edited": 1524439134, "full_link": "https://www.reddit.com/r/vaporents/comments/8e716q/vaping_never_gets_me_as_high_as_smoking/", "id": "8e716q", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 43, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "promo_adult", "permalink": "/r/vaporents/comments/8e716q/vaping_never_gets_me_as_high_as_smoking/", "pinned": false, "retrieved_on": 1524442019, "rte_mode": "markdown", "score": 1, "selftext": "I recently got a FF2, and while I haven’t had any of the problems with it that I’ve seen some other people report (didn’t find there to be much of a learning curve at all, super easy to get good clouds of vapor right away), it never gets me as high as my bong can. I really hate smoking, I’m really a wimp about it and I can only take really small hits without significant discomfort. But I can pack a bowl in my bong, take two or three hits, and go straight up to a [6]-[7]. Then save the rest of the bowl for later, such that a bowl can last me 3 sessions of getting as high as I want to be. \n\nVaping does get me high, but usually to around a [3], never any higher than maybe a [4], and the high goes away quickly unless I keep hitting it. So I can wind up going through 3+ bowls in one sitting and never get as high as I’d like to be. Granted, a bowl in the FF2 is probably a little less than half the size of a bowl in my bong, but it’s still less efficient. It’s okay for just vaping a little if I have to go out afterwards or something, but I bought the FF2 after reading people saying it was super efficient and got them super high, and it’s disappointing that that’s not the case for me. Does anybody have any tips that don’t involve buying another vape?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "vaporents", "subreddit_id": "t5_2upjd", "subreddit_subscribers": 85503, "subreddit_type": "public", "thumbnail": "self", "title": "Vaping never gets me as high as smoking", "url": "https://www.reddit.com/r/vaporents/comments/8e716q/vaping_never_gets_me_as_high_as_smoking/", "whitelist_status": "promo_adult"}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1526778656, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/8kpiw1/whats_your_schedule_on_the_29th/", "id": "8kpiw1", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "no_follow": true, "num_comments": 31, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/8kpiw1/whats_your_schedule_on_the_29th/", "pinned": false, "pwls": 6, "retrieved_on": 1526778658, "rte_mode": "markdown", "score": 1, "selftext": "For the company-wide meeting. I’m scheduled from 7:30am-7pm, how about you?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 43890, "subreddit_type": "public", "thumbnail": "self", "title": "What’s your schedule on the 29th?", "url": "https://www.reddit.com/r/starbucks/comments/8kpiw1/whats_your_schedule_on_the_29th/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527049950, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/8lglv0/i_have_a_final_tomorrow_should_i_call_out_from/", "id": "8lglv0", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/ADHD/comments/8lglv0/i_have_a_final_tomorrow_should_i_call_out_from/", "pinned": false, "pwls": 6, "retrieved_on": 1527049951, "rte_mode": "markdown", "score": 1, "selftext": "It's finals week and procrastination means that I haven't started studying for my final tomorrow yet. But I also have work at 6:30 in the morning (work's 6:30-12, final is at 1). Should I call out of work to make time to study and maybe even get some sleep? I've already called out 3 or 4 times this year, but I also really need to do okay in my classes this semester... Alternative would be to either not study, go to bed now and get 4-5 hours of sleep before I have to get up for work, or to stay up studying and not sleep and rely on Concerta to get me through work and my final.\n\nI'm also realizing that I really NEED to seek academic accommodations at school. I was trying to arrange them at the beginning of this semester and then executive dysfunction got in the way and it just kind of fell through the cracks. But I'm struggling so much without them, not because I don't understand the material I'm learning or anything, but just because I can't get my shit together enough to do the work.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "subreddit_subscribers": 191686, "subreddit_type": "public", "thumbnail": "self", "title": "I have a final tomorrow, should I call out from work?", "url": "https://www.reddit.com/r/ADHD/comments/8lglv0/i_have_a_final_tomorrow_should_i_call_out_from/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527333974, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/8m9k2d/currently_alone_in_my_store/", "id": "8m9k2d", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 11, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/8m9k2d/currently_alone_in_my_store/", "pinned": false, "pwls": 6, "retrieved_on": 1527333975, "rte_mode": "markdown", "score": 1, "selftext": "...because my shift went to McDonald’s across the street. Didn’t even offer to get me anything.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 44303, "subreddit_type": "public", "thumbnail": "self", "title": "Currently alone in my store...", "url": "https://www.reddit.com/r/starbucks/comments/8m9k2d/currently_alone_in_my_store/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1527355058, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/8mbklt/policy_on_noice_drinks/", "id": "8mbklt", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 21, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/8mbklt/policy_on_noice_drinks/", "pinned": false, "pwls": 6, "retrieved_on": 1527355060, "rte_mode": "markdown", "score": 1, "selftext": "I was always under the impression that when somebody orders a drink with no ice, you fill it to the top. That’s what I’ve always seen my shifts do, too. But today our new shift told me that we’re supposed to leave room at the top. Is that really the policy? Mind you, this is the same shift who told a customer that passion tango has the most caffeine out of our iced teas and left me alone in the store this morning while she went to McDonald’s across the street, so I’m a little doubtful.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 44308, "subreddit_type": "public", "thumbnail": "self", "title": "Policy on no-ice drinks?", "url": "https://www.reddit.com/r/starbucks/comments/8mbklt/policy_on_noice_drinks/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1530729374, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/trees/comments/8w3x38/happy_4th_of_july/", "id": "8w3x38", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/trees/comments/8w3x38/happy_4th_of_july/", "pinned": false, "pwls": 1, "retrieved_on": 1530729375, "rte_mode": "markdown", "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_subscribers": 1158577, "subreddit_type": "public", "thumbnail": "default", "title": "Happy 4th of July!", "url": "https://i.redd.it/gk1sj94t6z711.jpg", "whitelist_status": "house_only", "wls": 1}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1530729953, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/trees/comments/8w3zla/happy_4th_of_july_some_purple_dream_to_celebrate/", "id": "8w3zla", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/trees/comments/8w3zla/happy_4th_of_july_some_purple_dream_to_celebrate/", "pinned": false, "pwls": 1, "retrieved_on": 1530729954, "rte_mode": "markdown", "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_subscribers": 1158583, "subreddit_type": "public", "thumbnail": "default", "title": "Happy 4th of July! Some Purple Dream to celebrate.", "url": "https://i.redd.it/90sol6cj8z711.jpg", "whitelist_status": "house_only", "wls": 1}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_id": "t2_kmys5", "can_mod_post": false, "contest_mode": false, "created_utc": 1531618495, "domain": "self.trees", "full_link": "https://www.reddit.com/r/trees/comments/8yy83k/should_i_eat_an_edible_right_now_4/", "id": "8yy83k", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 11, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/trees/comments/8yy83k/should_i_eat_an_edible_right_now_4/", "pinned": false, "pwls": 1, "retrieved_on": 1531618496, "rte_mode": "markdown", "score": 1, "selftext": "Relevant details affecting the decision:\n\nI've been up since 4:30 this morning. It's 9:30pm here now. I worked ~11 hours straight today (minus the 10-minute and 30-minute break I got at work in the morning). I have the day off tomorrow. I would like to stay up late-ish tonight given that it's my last night off for a long time. I would also like to get really fucking high given that it's my last night off for a long time.\n\nLol idk why I'm writing this. I'm sorry I subjected you to reading that. I'm just gonna go eat it.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "trees", "subreddit_id": "t5_2r9vp", "subreddit_subscribers": 1163807, "subreddit_type": "public", "thumbnail": "self", "title": "Should I eat an edible right now? [4}", "url": "https://www.reddit.com/r/trees/comments/8yy83k/should_i_eat_an_edible_right_now_4/", "whitelist_status": "house_only", "wls": 1}, {"author": "Soramke", "author_flair_background_color": "", "author_flair_css_class": "barista", "author_flair_richtext": [{"e": "text", "t": "Barista"}], "author_flair_template_id": "e8d984da-ab99-11e7-82d0-0e80538164da", "author_flair_text": "Barista", "author_flair_text_color": "dark", "author_flair_type": "richtext", "author_id": "t2_kmys5", "can_mod_post": false, "contest_mode": false, "created_utc": 1531850301, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/8znf7e/should_i_have_gotten_a_lunch_today_floor_and/", "id": "8znf7e", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 12, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/8znf7e/should_i_have_gotten_a_lunch_today_floor_and/", "pinned": false, "pwls": 6, "retrieved_on": 1531850302, "rte_mode": "markdown", "score": 1, "selftext": "I worked 7-1:30 today, and I was scheduled to do my barista trainer training from 12:30-1:30. I thought I’d get a lunch because of the 6.5-hour shift, but my shift said I didn’t because training hours were counted separately, so even though I was working 6.5 hours straight, I was only on the floor for 5.5 hours and therefore didn’t get a lunch. That doesn’t sound right to me, but the DCR agrees with her (not that my manager/supervisors ever follow the DCR anyways unless it suits them... otherwise we’d get second 10s). So is it true that training hours are counted separately for break purposes?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 47712, "subreddit_type": "public", "thumbnail": "self", "title": "Should I have gotten a lunch today? Floor and training hours", "url": "https://www.reddit.com/r/starbucks/comments/8znf7e/should_i_have_gotten_a_lunch_today_floor_and/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_background_color": "", "author_flair_css_class": "barista", "author_flair_richtext": [{"e": "text", "t": "Barista"}], "author_flair_template_id": "e8d984da-ab99-11e7-82d0-0e80538164da", "author_flair_text": "Barista", "author_flair_text_color": "dark", "author_flair_type": "richtext", "can_mod_post": false, "contest_mode": false, "created_utc": 1532026944, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/starbucks/comments/908q46/5_hours_later/", "id": "908q46", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/908q46/5_hours_later/", "pinned": false, "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "mUzAkxmWyZa2V0P8slX14wxdus4_HufkLJF9fBWcz7w", "resolutions": [{"height": 144, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=8c2d373e22f4bd2b745b97019024d46c", "width": 108}, {"height": 288, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=7a1e5e14c8e99d028f8e87e15d5aaab6", "width": 216}, {"height": 426, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=60cee0762c11324e1a9c2e6bfe2d88b0", "width": 320}, {"height": 853, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=df87e42153d893474020b993e6f57add", "width": 640}, {"height": 1280, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=1e107b920bd29ad6852f2716e3471d23", "width": 960}, {"height": 1440, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=4a4f7f30c1b7b3c02fe6993773cbc6bd", "width": 1080}], "source": {"height": 4032, "url": "https://i.redditmedia.com/HPcie57R_CDpEchVV87zOAaYt90qykrhPm-IQ3I6CKo.jpg?s=034608194e37da8000a2693c2f8dcc19", "width": 3024}, "variants": {}}]}, "pwls": 6, "retrieved_on": 1532026950, "rte_mode": "markdown", "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 47822, "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/1-AhB06BLloMH0jXA8mohIf957ftbW17EC7j9HCNbpU.jpg", "thumbnail_height": 140, "thumbnail_width": 140, "title": "5 hours later...", "url": "https://i.redd.it/rbu943d5dya11.jpg", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1532072483, "domain": "self.Trichsters", "full_link": "https://www.reddit.com/r/Trichsters/comments/90e0tg/tattooing_my_head_bad_idea_or_not/", "id": "90e0tg", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "permalink": "/r/Trichsters/comments/90e0tg/tattooing_my_head_bad_idea_or_not/", "pinned": false, "retrieved_on": 1532072484, "rte_mode": "markdown", "score": 1, "selftext": "I'm 22 years old, I've had trich for most of my life, I'd say, but it started significantly picking up when I was 18, to the point where I was at least 3/4 bald and I decided to shave my head completely. I shaved it every few days for a while, because I was still managing to pull enough for there to be very noticeable hair loss. I've been letting it grow on top since late 2015, but still shaving the sides and back every few weeks. My hair loss is a lot less extensive these days than it was when I was 18, but it's still very noticeable on the sides and crown, and I've covered my hair whenever I'm in public since probably December 2015 or so.\n\nAnyways, I might start shaving my hair again soon so I can more comfortably go out without was thinking of trying to think up a tattoo to cover the spots where I have persistent hair loss and can't seem to stop pulling enough to fully regrow no matter what. I have hope that I'll fully regrow hair there eventually, in which case the tattoo would be covered, but do you think that'd be a good idea, or would it look dumb?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Trichsters", "subreddit_id": "t5_2s7dh", "subreddit_subscribers": 5492, "subreddit_type": "public", "thumbnail": "self", "title": "Tattooing my head -- Bad idea or not?", "url": "https://www.reddit.com/r/Trichsters/comments/90e0tg/tattooing_my_head_bad_idea_or_not/"}, {"author": "Soramke", "author_flair_background_color": "", "author_flair_css_class": "barista", "author_flair_richtext": [{"e": "text", "t": "Barista"}], "author_flair_template_id": "e8d984da-ab99-11e7-82d0-0e80538164da", "author_flair_text": "Barista", "author_flair_text_color": "dark", "author_flair_type": "richtext", "can_mod_post": false, "contest_mode": false, "created_utc": 1532960339, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/934fy9/im_a_trainer_with_no_training/", "id": "934fy9", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/934fy9/im_a_trainer_with_no_training/", "pinned": false, "pwls": 6, "retrieved_on": 1532960340, "rte_mode": "markdown", "score": 1, "selftext": "I was supposed to do my barista trainer training a week ago, but when I went to do it it said I didn’t have permission to access it. My manager was on vacation. Now my manager’s back, I start training somebody in 40 minutes, and I still haven’t done the barista trainer training. Any sage words of advice for me before I’m just shoved into the deep end of training this guy?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 48439, "subreddit_type": "public", "thumbnail": "self", "title": "I’m a trainer with no training.", "url": "https://www.reddit.com/r/starbucks/comments/934fy9/im_a_trainer_with_no_training/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "can_mod_post": false, "contest_mode": false, "created_utc": 1536024537, "domain": "self.ADHD", "full_link": "https://www.reddit.com/r/ADHD/comments/9cr7d5/trouble_finding_motivation_for_things_you/", "id": "9cr7d5", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/ADHD/comments/9cr7d5/trouble_finding_motivation_for_things_you/", "pinned": false, "pwls": 6, "retrieved_on": 1536024537, "score": 1, "selftext": "I'm trying to do my first writing assignment for my Stage Management class right now and it's just such a useless assignment that I can't bring myself to do it. It's two pages single-spaced (it's also the first single-spaced assignment I've had since I started college five years ago, what's up with that?), which means it'll take me four hours to get through at a bare minimum, and it's basically just writing about events in my life I already know happened that prove I have traits I already know I have. It should be so fucking simple, but I just can't bring myself to even start it because I already know I'm not going to learn anything from it. It's just busywork. Which means I'm not going to be able to get it done by class tomorrow morning and I'm going to give up an \"easy\" 20 points. No late work accepted. Story of my college career.\n\nI also didn't take any meds today and it's too late now... kind of ready to give up and just play some video games or something if I'm not going to be able to hand this in tomorrow anyways. I'm already stage managing the mainstage production this semester because I'm *already a good stage manager!* But I'm going to fail this damn Stage Management class if I can't force myself to regurgitate four pages of bullshit onto the page unmedicated!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ADHD", "subreddit_id": "t5_2qnwb", "subreddit_subscribers": 266012, "subreddit_type": "public", "thumbnail": "self", "title": "Trouble finding motivation for things you consider pointless?", "url": "https://www.reddit.com/r/ADHD/comments/9cr7d5/trouble_finding_motivation_for_things_you/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "can_mod_post": false, "contest_mode": false, "created_utc": 1538172263, "domain": "self.gayjews", "full_link": "https://www.reddit.com/r/gayjews/comments/9jralh/birthright_trip_lgbt_or_classic_trip_as_a_bi_girl/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9jralh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "permalink": "/r/gayjews/comments/9jralh/birthright_trip_lgbt_or_classic_trip_as_a_bi_girl/", "pinned": false, "retrieved_on": 1538172263, "score": 1, "selftext": "I'm going to Israel in January! Super excited. Initially I was supposed to do the Israel by Foot trip through Israel Outdoors (yay, hiking), but that one was just cancelled due to lack of interest. There's an Israel Quest (their typical, classic trip) they can switch me to or an LGBT-themed one. Has anybody been on one of their LGBT trips? I think it'd be great to be surrounded by other queer people on my trip, but I'm worried that I might feel a little left out (or worse, be actively excluded) as a bi girl with a boyfriend at home. Also, I know there's generally a decent amount of hooking up on Birthright, but is there likely to be less of that or even more (or about the same) on an LGBT trip?\n\nThanks for any insight anybody could provide!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "gayjews", "subreddit_id": "t5_2uhrk", "subreddit_subscribers": 1106, "subreddit_type": "public", "thumbnail": "self", "title": "Birthright trip -- LGBT or Classic trip as a bi girl?", "url": "https://www.reddit.com/r/gayjews/comments/9jralh/birthright_trip_lgbt_or_classic_trip_as_a_bi_girl/"}, {"author": "Soramke", "author_flair_background_color": "", "author_flair_css_class": "barista", "author_flair_richtext": [{"e": "text", "t": "Barista"}], "author_flair_template_id": "e8d984da-ab99-11e7-82d0-0e80538164da", "author_flair_text": "Barista", "author_flair_text_color": "dark", "author_flair_type": "richtext", "author_fullname": "t2_kmys5", "can_mod_post": false, "contest_mode": false, "created_utc": 1539370295, "domain": "self.starbucks", "full_link": "https://www.reddit.com/r/starbucks/comments/9nmzgv/question_about_stocks/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9nmzgv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/starbucks/comments/9nmzgv/question_about_stocks/", "pinned": false, "pwls": 6, "retrieved_on": 1539370295, "score": 1, "selftext": "What day do we get our stocks this year? And is there a way to cash them out? Considering quitting, but don’t want to quit when that money’s just around the corner...", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "starbucks", "subreddit_id": "t5_2qwza", "subreddit_subscribers": 54052, "subreddit_type": "public", "thumbnail": "self", "title": "Question about stocks", "url": "https://www.reddit.com/r/starbucks/comments/9nmzgv/question_about_stocks/", "whitelist_status": "all_ads", "wls": 6}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541506364, "domain": "self.aspergirls", "full_link": "https://www.reddit.com/r/aspergirls/comments/9unsf0/help_me_not_dread_getting_dressed_in_the_morning/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9unsf0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 20, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/aspergirls/comments/9unsf0/help_me_not_dread_getting_dressed_in_the_morning/", "pinned": false, "pwls": 0, "retrieved_on": 1541506364, "score": 1, "selftext": "I have some major sensory issues around clothes, but I also like to look decent. I can't stand jeans at all, I forced myself to wear them in high school and would frequently cry getting dressed. Nowadays I mostly wear a lot of long skirts, and shorts for as long as I can get away with it. But when it's getting colder out, I do need to have some options to turn to for pants. I wear yoga pants a lot in the winter, but the form-fitting-ness is hard to stand sometimes.\n\nSo basically, I'm looking for advice. What pants do you wear? Bonus points if they're actually somewhat fashionable (not fashionable like cutting-edge and expensive, but fashionable in that I won't stand out too much on campus), but I'm mostly concerned with comfort.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "aspergirls", "subreddit_id": "t5_31zba", "subreddit_subscribers": 10917, "subreddit_type": "public", "thumbnail": "self", "title": "Help me not dread getting dressed in the morning...", "url": "https://www.reddit.com/r/aspergirls/comments/9unsf0/help_me_not_dread_getting_dressed_in_the_morning/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541977139, "domain": "self.Anxiety", "full_link": "https://www.reddit.com/r/Anxiety/comments/9w8ee3/probably_getting_fired_tomorrow/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9w8ee3", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "schoolflair", "link_flair_richtext": [], "link_flair_text": "Work/School", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/Anxiety/comments/9w8ee3/probably_getting_fired_tomorrow/", "pinned": false, "pwls": 1, "retrieved_on": 1541977140, "score": 1, "selftext": "I've been experiencing significant anxiety around my job lately, to the point where I just didn't show up twice last week. I'm pretty sure I'm going to be fired when I go in tomorrow. I'm already in a lot of financial trouble. I can't help but beat myself up over it and feel like I didn't have any valid reason to miss work and I'm just a big failure.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Anxiety", "subreddit_id": "t5_2qmij", "subreddit_subscribers": 206999, "subreddit_type": "public", "thumbnail": "self", "title": "Probably getting fired tomorrow.", "url": "https://www.reddit.com/r/Anxiety/comments/9w8ee3/probably_getting_fired_tomorrow/", "whitelist_status": "house_only", "wls": 1}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541992772, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wabwb/im_probably_getting_fired_tomorrow/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wabwb", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wabwb/im_probably_getting_fired_tomorrow/", "pinned": false, "pwls": 0, "retrieved_on": 1541992773, "score": 1, "selftext": "(I posted this already in r/anxiety, but I'm still feeling really shitty about it so I figured I'd post here too.)\n\nI've been experiencing depression and significant anxiety around my job lately, to the point where I just didn't show up twice last week. I'm pretty sure I'm going to be fired when I go in tomorrow. I'm already in a lot of financial trouble. I can't help but beat myself up over it and feel like I didn't have any valid reason to miss work and I'm just a big failure. Just need to vent about it and get some reassurance.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 404715, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm probably getting fired tomorrow.", "url": "https://www.reddit.com/r/depression/comments/9wabwb/im_probably_getting_fired_tomorrow/", "whitelist_status": "no_ads", "wls": 0}, {"author": "Soramke", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_kmys5", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542696224, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ypnir/is_this_email_appropriate_to_send_to_my_professor/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ypnir", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9ypnir/is_this_email_appropriate_to_send_to_my_professor/", "pinned": false, "pwls": 0, "retrieved_on": 1542696225, "score": 1, "selftext": "I'm way behind in this class. My professor is asking about missing assignments that I had promised I'd get done by today but that I haven't been able to work on at all. I like and respect this professor a lot and this class is basically the most important class with regards to my career interests. This email may be oversharing, but I kind of need to share this with somebody and I want to assure my professor that I really do care about the class and I'm not just slacking off.\n\nHere's the email:\n\n\"I have diagnosed depression, generalized anxiety disorder, ADHD, and trichotillomania. I always experience at least some low-level underlying depression at all times, but for the past couple of weeks I’ve been in the middle of a more severe major depressive episode. One symptom of this episode has been extremely low energy. Given that this episode has coincided with, as you know, a major project in the exact area of study of this class, I’ve kind of been forced to devote all of my very limited energy to that. I’ve missed all of my scheduled shifts at work for the past two weeks because I’ve been too anxious to go. I’ve skipped all my classes except this one for the past two weeks for the same reason. I was recently prescribed an SSRI to try to control my anxiety. The last time I was on an SSRI 4 years ago, it made my depression so much worse that I failed all my classes that semester and led to failing out of my old school entirely, and I don’t know yet if the same side effects are happening again.  I think about suicide multiple times every day (I mention that because it’s a fact and it provides context about just how bad I’m feeling lately, but please don’t worry too much about it. I’ve wished I was dead since I was maybe 10 years old, it’s just the status quo, it doesn’t mean anything). Uncle Vanya was the only positive thing in my life and now I don’t know what to do. \n\nI’m sorry, I shouldn’t unload all this on you, you’re not my therapist (I don’t have a therapist… probably a major oversight, hahaha). I don’t want to make excuses and I wish I didn’t have anything to make excuses for, but I just wanted to explain why I’ve been so flaky. I just want you to know that I really care about this class and this subject and I promise I’m trying.\"\n\nWell... even if this is too whiny to share with my professor, at least I can vent here? Thanks if anybody reads this.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 407581, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is this email appropriate to send to my professor?", "url": "https://www.reddit.com/r/depression/comments/9ypnir/is_this_email_appropriate_to_send_to_my_professor/", "whitelist_status": "no_ads", "wls": 0}]}