{"data": [{"author": "Spicyps3controller69", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_28a73lca", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541763907, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9vjrgf/i_just_sit_and_wait_to_see_what_i_fuck_up_next/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9vjrgf", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9vjrgf/i_just_sit_and_wait_to_see_what_i_fuck_up_next/", "pinned": false, "pwls": 0, "retrieved_on": 1541763908, "score": 1, "selftext": "Sorry in advance for rambling and making it unbelievably long\n\nRelationships, friendships, family, and many aspects of my life are all things I've managed to mess up. I was diagnosed with clinical depression 4 years ago but that just seemed to confirm what I already knew. My forgetfulness and crudely logical approach to everything has pushed everyone who (I assume) cared for me away and now I get to sit here alone on my bed, sleep deprived, thinking about possible ways that I could piece things together or how I wish I could go back and fix things but through all the searching, I've found no answer. While I do have hobbies like playing music (euphonium and tuba) which started great but eventually as most things I touch do, it fell apart. I foolishly lied my band teacher that I no longer wanted to be apart of the band but in all reality, I told myself that I couldn't handle the expectations put on me so I just gave up. I regret it but I can't bring myself to talk to him again. Another hobby of mine is working on cars but when I fuck something up no matter how small, I beat myself up about it in an effort to stop myself from doing it again but, that just digs deeper into the hole I'm in. To add to that, I distanced myself from my parents and we only talk about very surface level stuff, talking about serious things like this just ends with a \"you'll be fine\", \"just deal with it, everybody has been depressed at one point or another\" and best of all \"stop acting, its just a phase\".\n\nMy older brother and I share the fact that we never really had someone to talk to about shit like this but the difference between him and I is that he found his way out by socializing which is something I constantly try to do and he tries to help me with but, I always fail. On top of everything, I also have severe social anxiety and I have prescribed medication but stopped taking them after they only seemed to make my thoughts even darker. It used to be easy to distract myself from being depressed but now its constant and I can't get away from it. I can remember years ago where I had this drive to keep going with the hope of reaching my goal of being happy but, that drive is completely gone. I'm sick of this. Hell, I've never been able to put on a smile without great effort. Every single relationship I somehow \"magician-ed\" myself into always ended with me remembering to be logical and realizing that all I'm really doing is employing them to fix my problems for me and since I'm writing this, I can assure you that it doesn't work.\n\nI feel alone and as if no one cares about me but, when it seems someone comes around and starts to care, I panic and push them away because I'm afraid that I'll unintentionally hurt them and I'm really trying to not do that. My brain is an expert at reminding me constantly about all the shit I fucked up but seems to shut down when trying to solve even one of many issues. When I did have friends who I would talk to regularly, I would kinda observe that they sometimes felt down and in a slump but, unlike me, after waiting a bit of time, they always return to how they were previously. Who knows, they could've been in the same situation as I was, putting up a facade to deter people away from knowing what you're going through but I guess I'll never know. Don't really know what drove me to write this, maybe I'm going insane. But, at the very least this will pose as a reminder to me to see if, in the future, anything changes. I sometimes catch myself trying to blame my anxiety or other people for my depression and situation but, I realize the common denominator is me. I'm the one who is fucking everything up, and making this post entirely too long.\n\n&amp;#x200B;\n\ntl;dr: I'm a habitual fuck up, I do it constantly. So much so that people think I do it on purpose. I'm just tired of this. This is all my fault but I don't know if I'm able to fix it.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 403677, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I just sit and wait to see what I fuck up next", "url": "https://www.reddit.com/r/depression/comments/9vjrgf/i_just_sit_and_wait_to_see_what_i_fuck_up_next/", "whitelist_status": "no_ads", "wls": 0}]}