{"data": [{"author": "t_h_r_o_w_a_w_a_y_15", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2govltqj", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541927522, "domain": "/r/nsfw_gifcum/comments/9w2gvt/need_source_for_sasha_rose_thewhiteboxxx_plz/", "full_link": "https://www.reddit.com/r/nsfw_gifcum/comments/9w2gvt/need_source_for_sasha_rose_thewhiteboxxx_plz/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9w2gvt", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": false, "is_video": true, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "permalink": "/r/nsfw_gifcum/comments/9w2gvt/need_source_for_sasha_rose_thewhiteboxxx_plz/", "pinned": false, "post_hint": "hosted:video", "preview": {"enabled": false, "images": [{"id": "H2RPg5yyAKqY3pQoWJfFukpSIPkGxCdKUkCdYUMOAaw", "resolutions": [{"height": 60, "url": "https://external-preview.redd.it/k2tAIjFyEazogNRFuDSPaOQ05EFvSMLJLLBlSY70O2I.png?width=108&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=339636ab3d6ffbd2367b79bd289963ed0caa33fd", "width": 108}, {"height": 121, "url": "https://external-preview.redd.it/k2tAIjFyEazogNRFuDSPaOQ05EFvSMLJLLBlSY70O2I.png?width=216&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=4a64417c7141da23f613f2b5049dec5aed968d21", "width": 216}, {"height": 179, "url": "https://external-preview.redd.it/k2tAIjFyEazogNRFuDSPaOQ05EFvSMLJLLBlSY70O2I.png?width=320&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=8e58775cf5d19ef1095b6cae7af2c699ecdc477e", "width": 320}, {"height": 359, "url": "https://external-preview.redd.it/k2tAIjFyEazogNRFuDSPaOQ05EFvSMLJLLBlSY70O2I.png?width=640&amp;crop=smart&amp;format=pjpg&amp;auto=webp&amp;s=a77819b4f573565bf5690e08ace04f8242df62a5", "width": 640}], "source": {"height": 404, "url": "https://external-preview.redd.it/k2tAIjFyEazogNRFuDSPaOQ05EFvSMLJLLBlSY70O2I.png?format=pjpg&amp;auto=webp&amp;s=95475c0a4cab647cfaefdccad11eb0ba6dfd9451", "width": 720}, "variants": {}}]}, "retrieved_on": 1541927523, "score": 1, "selftext": "", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "nsfw_gifcum", "subreddit_id": "t5_30ky8", "subreddit_subscribers": 973, "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/zSNYkBo46k2DHHJSFxcc01LmEWDxGuQPgQH1K1Uhnfw.jpg", "thumbnail_height": 78, "thumbnail_width": 140, "title": "Need Source for Sasha Rose TheWhiteBoxxx plz!!", "url": "https://v.redd.it/s2p37wrj4ox11"}, {"author": "t_h_r_o_w_a_w_a_y_15", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2govltqj", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540467873, "domain": "self.tifu", "full_link": "https://www.reddit.com/r/tifu/comments/9r9iok/tifu_by_putting_porn_on_my_universitys_server/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9r9iok", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/tifu/comments/9r9iok/tifu_by_putting_porn_on_my_universitys_server/", "pinned": false, "pwls": 1, "retrieved_on": 1540467873, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "tifu", "subreddit_id": "t5_2to41", "subreddit_subscribers": 13753604, "subreddit_type": "public", "thumbnail": "self", "title": "TIFU by putting porn on my university's server", "url": "https://www.reddit.com/r/tifu/comments/9r9iok/tifu_by_putting_porn_on_my_universitys_server/", "whitelist_status": "house_only", "wls": 1}, {"author": "t_h_r_o_w_a_w_a_y_15", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2govltqj", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540326417, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qss1r/stuck_in_a_rut_dont_see_a_point_in_getting_out/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qss1r", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qss1r/stuck_in_a_rut_dont_see_a_point_in_getting_out/", "pinned": false, "pwls": 6, "retrieved_on": 1540326419, "score": 1, "selftext": "So there's a lot of complications, but I guess I'll start with a little background. Youngest child of first generation college graduate parents who went on to get advanced degrees. Older siblings are very successful, and it's always been hard to keep from comparing myself to them. I always felt like I slowed down family time by needing things explained. Always felt like I was playing catch up. Regardless, I worked hard and did well in school. However, I always prided myself most on athletics (this will come in to play later). \n\nI was usually very optimistic about the future. I felt like I could do anything. My pride would sometimes grow to self-detrimental hubris; I would boast about grades or athletics, only to feel bad because not everyone was able to achieve those things. I would also at times be a jokester and prankster to try to entertain myself and others. I had a big ego, and didn't like being told what to do. But all that, I think, was just normal childhood immaturity expected of middle-class kids.\n\nAs I neared adulthood, I kept feeling anxious about choosing a path in life. I would try to pin down a career path, but then feel like I would be excluding other opportunities that I also found interesting. My psyche knew I could do anything, but wanted to do everything. I had a hard time making decisions and sticking to them. The indecision would give me anxiety at times, as I always felt pressure from my parents to plan ahead and stick to my decisions (which I think was fair for them to do). \n\nI would use video games and porn as an outlet to escape the real world. I would put things off and just zone out, which didn't help things much. I rationalized it as spending time on an enjoyable hobby, although they started to become an addiction. This caused some arguing with my parents, but I figured once I went to college, I would be on my own, become more independent, I would figure things out, and things would get better. Summer after high school was a very anxious period, as I didn't particularly use it to plan ahead, rather as a time to enjoy the freedom of finally being an adult.\n\nI only applied to one college, which accepted me and I attended. For 1 quarter. I was doing pretty well up until the last few weeks. But it was a big school, in the middle of a big city. I am from a pretty small town, where everybody knew each other, and had a hard time adapting to being around strangers all the time. I tried to make as many friends as I could, but the problem was I didn't really stay close to any particular friend or group of friends. I started experiencing insomnia early on, partly due to the culture clash and partly due to breaking up with my high school girlfriend of 2 years. She was 2 years younger than me, and I was very indecisive about whether to continue dating her in college. \n\nShe was my first true love, but I was very paranoid about being cheated on. Not that she gave me a reason to, but I generally believe people will tend to do things they think they can get away with. Maybe I didn't know what I had till it was gone, but I also have a pretty cynical view of the world at times. Anyways, there were a few other girls that I also kind of liked (though I obviously wouldn't tell her that) that I wanted to see what it would be like to date. I also saw college as a potential opportunity to experience the freedom of casual sex (college, oh the opportunities!), which I wouldn't have felt comfortable with following through on if I stayed with her. I perceived cynicism, but didn't want to contribute to it in that manner. But if I broke up with her to try it out, I felt like it would be wrong to ever go back to her for breaking up with her for a selfish reason like that. It felt like I would be passing up on the opportunity of a possible lifetime romance with my first true love (I know, call Disney, right?). We ended up breaking it off, though we still talked. Even though she started dating someone new. And she would tell me he would be a jerk to her. But I didn't take the opportunity to move on; I was stuck in indecision. \n\nI finally tried getting with a girl at college, even though she wasn't my type at all. I spent a drunken night with her once. Even though we didn't even hoop up, it felt wrong because the girl's boyfriend called, and I still had feelings for my ex. I was very hesitant in trying to try starting something with someone new, because I was afraid I would just eventually find myself in a similar situation of being paranoid about cheating and doubting if she's the right one. I kept a lot of this inside, and kept trying to stay focused on school work and trying to fill the emotional void with porn. I tried to finish out strong in my classes, but my TA wouldn't accept 2 late lab reports, and I got 2 Ds instead of Bs. 1.4 GPA and my parents insisted I come home. They got me professional help. I started seeing a psychologist and began taking antidepressants.\n\nI started classes the next term at the local community college, and started talking to a girl in one of my classes who went to my high school. She was a knockout, and I started getting pretty close to her. At this point I had also gotten a job and having no-strings attached sex with a girl from work. Since I had money coming in, I took the opportunity to move into an apartment with a couple of high school buddies. One day one of my roommates asked me if I liked the girl from class (which I did), but I said no, once again due to the same indecision and worry. I was also very indecisive due to hooking up with the girl from work, who I got along with great but didn't feel like I actually liked all that much. I guess it just came to be out of convenience. But since I moved into the apartment, I transferred stores since there was one closer to where I was living. I kind of just stopped talking to the girl I was hooking up with, because I have never really been that good at breaking up with girls. \n\nLiving in the apartment gave me the freedom I was expecting to have when I first went to college, but without the culture clash and overpopulated dorm living. It started out feeling awesome to have the liberation to finally get to spend most of my time the way I wanted, and make my own decisions. This freedom led to experimenting with drugs, mostly smoking cigarettes, weed, and synthetic weed. I would also drink a lot at times. I had only tried these things a few times in high school, and I felt like it was kind of a reward for waiting until I was older. Most of the times I felt like it was just to have fun. Recreational smoking, experimenting with mental states to have fun with friends. Competitive drinking, having people over for parties. Living the social life I always aspired to have once I was in college.\n\nI realized I hadn't really talked much to my parents in awhile, but I honestly didn't feel like I had much to talk to them about. They wouldn't be impressed to hear about how much I drank, or how high I got and how awesome it felt, things that my roommates and I would get excited to talk about. I was living my own life, and didn't feel like I needed much guidance at that point, as I was doing pretty well in school and was working. But one day I woke up and realized I hadn't lived a sober day in like 3 months, I got tired of the almost daily cycle of \"wake up, get high, go to work, come home, take pre-workout, get pumped up to go to the gym, work out, shower, get drunk, smoke some more...\" But I still felt a bit ashamed, as my mom was very strict about not smoking. I started getting anxious about whether I was going to have withdrawal if I stopped, and also about still being uncertain about my future. \n\nIt was winter time, which brings seasonal depression for me. One night I thought it would be fun to go drifting with my friends. I tried to drift around a curbed semi-circle at the apartment complex, took it way to fast and broke the axle on my car, which was a loaner from my parents. This catalyzed the depression for me, as I realized I was living a pretty carefree lifestyle. I was focusing on having as much fun as I could, and doing the things I promised my parents I would never do. Also I hadn't saved any money, which I needed now for the car repair. When I was younger, I would mask any depression with humor and denial, but at this point I felt so mixed up and confused. I knew I had put myself deep in a rut, but couldn't possibly see how I could get myself out. The fun had come to an end, and the future seemed bleak.\n\nI knew I needed help, and told my roommate/best friend at the time I was tired of the lifestyle. He was a psychology major, but wasn't the most driven academically (he ended up dropping out of the program). He was a very prideful jock, and he seemed angry in his response that \"we were self-medicating.\" I kind of agreed with that, as I believe weed lowers anxiety. But I still didn't know what to do. I told my parents about my lifestyle and how my pessimism had grown to an all time high. About how I was worried about how people would treat me, after I \"gave into addiction.\" I was embarrassed to come to them for help, as I felt like I should always know what to do, and living on my own should have built my responsibility. I felt like a complete failure. \n\nMy parents were understandably upset. I tried defending myself, recalling that addiction runs in the family and telling them I knew they had smoked weed when they were younger. Although those are factual, this kind of felt like a flimsy excuse because my parents always stressed personal responsibility. They were somewhat conservative, as they both had good jobs and were in favor of low taxes. I agreed with them when I was younger, but I felt I had grown away from them since I had been studying liberal social science classes at the community college downtown. Negative emotions that I had been numb to for months, such as anger, guilt, shame, and self-contempt started boiling out.\n\nI kept re-questioning everything they taught me when I was younger, and kept questioning my decisions and my motives. Is weed good or bad? It helped me be more social and interactive, but affected my memory. It made me feel good physiologically, but makes my mind wonder. It made me better at sports and video games, but I couldn't read or do math on it. It took away anxiety, but I also worried about getting caught with it and getting arrested. Was it curbing my depression, or contributing to it? These thoughts and many more including questions involving my past love interests and my ability to commit (or lack thereof) kept racing through my head. \n\nI was completely indecisive about it all, and I just pretty much gave up on life and shut down mentally. When my parents would ask me questions I would usually say \"I don't know,\" or \"who cares.\" I would talk about suicide, more than I ever had. When I was younger and would talk about it, my mom (a nurse) would ask me if I planned on hurting myself. I always said no. But this time, I didn't really care. I guess a part of me was just curious as to what would happen if I kept pushing it.\n\nI spent 12 days inpatient at a psychiatric facility out of town where they medicated me for drug induced psychosis. I was afraid to come home because I was still very pessimistic, even though I was going through the steps to get better. I got diagnosed with ADD, and prescribed adderall. I transferred to the closest university, studying biology as I figured maybe it could help me sort some things out. Still was unsure of a career path, but at least I was doing something. When I was younger, I always thought it would be awesome to pursue athletics and go professional, but if I did that I felt I would be limiting my ability to go far in school and be well-educated. But I still didn't want to give up athletics, so I continued sports in college. This was difficult to balance; one semester I would spend 15 hours on sports and 25 hours working on campus while taking full-time pre-medical biology classes (organic chem, cell bio, A+P). During that semester, my dad committed suicide.\n\nI ended up finishing out that semester, but had a breakdown once it finished. I felt like I was finally getting things together and balancing things the best I could. I felt like I should have spent more time with him, but also felt like I was investing the time in my future. I felt I had lost his trust and no longer made him proud. I felt like I was getting over the hard times and would eventually \"find myself,\" and that I would eventually get back on his good side. I tried going back to school again, but dropped out a time or two. Started getting pessimistic and not caring again. Started being reclusive, getting locked into video games, browsing the web, trying to keep my mind focused on something other than self dread. \n\nMy mom sent me to a therapist, who I mostly just stared at for the first couple months. During the solitude I kept trying to figure out why I am the way I am; so pessimistic and cynical and un-trusting. I eventually started talking to her, and brought up some memories from the long past of how my family mistreated me. I didn't want to bring this up, as I am usually prideful and didn't want to feel like I was just using it as an excuse. But that's where my mind had gone. She though I should invite my family and read to them the experiences I had written down. I was very apprehensive, but went along with it. Began hyperventilating as I read through it.\n\nI convinced my mom that it wasn't doing me any good living with her by myself. I moved out to the rental property that she owned, where my brother had been living for a few years. I agreed to pay rent. Finished my BS, was still unsure of what to do, but decided to continue to grad school. Got back into athletics. Got back in to smoking weed, but told myself I'd use it more medicinally than recreationally. Started feeling very optimistic. Got 2 part time jobs. Joined another sports program at school during my 2nd semester of grad school. Was very stressful trying to manage that with school, as they added 2 practices a week (during my days off from classes) near the end of the semester.\n\nOnce the semester ended it was tax time and my mom was stressing about finances, as I wasn't able to save much money with keeping up on school and athletics. I decided to quit one of my part time jobs and spent more time on the other job. I spent my first 40 hour week, and made some pretty good money to start paying my mom back. But I was really anxious, as the more time I spent working, the less time I had to spend on research and trying to plan out grad school. I was worried about relying too much on adderall, smoking every day again, and realizing I was in too deep with multiple commitments (grad school, 2 sports programs, 2 jobs which didn't pay enough for me to pay rent). Had a mental breakdown while driving, and pulled into the cemetery where my dad is buried. My heart kind of felt like it might explode, and electricity was tingling down my arms. I sent my mom all the money in my account, but since I hand't been paying monthly rent and didn't find anybody to move in, she sold the rental house and I moved back home.\n\nThis, along with having to give up some of the things I loved, made me depressed again and I went back to being introverted. I was left with helping my mom fix up the house (not my brother who had been living there for 7 years). Also had to help my mom clean out her mom's house, as she passed away a few years ago. This took a lot of time, as it is a large house that is an hour away and she was a hoarder. Most of the stuff was junk, but my mom insisted there are a lot of valuable antiques and that we bring it to our house so we can go through it item by item. That made our basement full of boxes for the winter. \n\nTried taking a class that winter that I was pretty excited about the previous year, but didn't have time for at the time. Ended up taking it during the winter as the only class I had, but my heart wasn't in it. Decided to go back to the self-employed business that I had done during summers in the past, as I would work on my own schedule and would be in charge. Was also smoking weed again, because at this point I felt dependent on it. Was able to retake the class I failed, but was still smoking weed everyday, which didn't help. I also didn't get along with one of the teachers, so I was very unmotivated to do the work. Ended up barely passing, but didn't go back the next semester because I wasn't happy with myself about how I did.\n\nThe next summer my mom decides she'll call an antique dealer for the hoarded inheritance and have them come to grandmas house to look at the stuff. So we take a lot of the stuff back to the house. Then she calls antique dealers, who are not interested in any of it. When I would suggest just ordering a takeaway dumpster for the junk at least, she didn't want to spend the money, insisting rather to take multiple trips over the summer to take the junk to good will. All the while paying taxes and insurance on the house. It's hard at times for me to get along with my mom, because if I ask questions about her plans or make suggestions she sometimes gets mad and emotional. This usually puts me in a bad mood, and I don't feel like doing much.\n\nSo I've been laying relatively low lately, forgoing school, social life, and employment. I started off the summer spending a lot of times playing video games. Also been mowing, landscaping, gardening, and doing maintenance around the house (about 10 hours a week) this summer. I haven't been very emotional lately, but I also haven't been very motivated to doing much. There's something new my mom want's me to fix every week, but it can be very hard for me to communicate with her, as I'm very sensitive to her tone of voice and attitude. She can be very stubborn, and I sometimes respond with defiance.\n\nNow, I have arthritis from breaking most of my fingers, and had 2 concussions from college sports (which my mom warned me about, but I felt like I couldn't live without). I have an Adderall dependency for ADD, as well as prescriptions for 3 antidepressants, terrible allergies that I've had since I was a kid (which actually doesn't bother me when I go into full depression mode and stay inside all day for most of the summer), optic nerve pain due to neovascularization from wearing my contacts for months on end when I was younger (which I admit is completely my fault), porn addiction, hypersensitive hearing, and an old computer that freezes on occasion, slowing me down from doing research.\n\nAlso the inability to commit to a career due to pessimism (not being able to trust myself to stay committed). I do recognize a pattern of getting on track, feeling confident, becoming social, and letting my ego grow, but I end up over committing to multiple interests and not being able to feel satisfied with life. All of the responsibilities I get involved with require maintained effort, and usually demand spending more time and energy commitments. All of the hobbies and interests I get involved with tempt me with more enjoyment. I get to a point where I know I have to sacrifice doing things I enjoy, but end up feeling salty that I don't have the time for them. So I end up just giving up on everything, since it's impossible to balance it all and be perfect. I want to make everybody happy, and want everyone to think the best of me, so I put a bunch of effort into doing what I think people want. But when I reach the breaking point, I don't really care what people think about me and think to myself that they can just all shove it.\n\nI enjoy reading science literature and learning about advances in medical research, but it always seems that the more I read, the more I realize just how complicated things are. I never feel like I know enough, since I am not able to know everything. But once I feel like I'm starting to figure things out, I start getting confident and prideful, but then start to worry that people think I'm narcissistic. My personality and self-worth change a lot depending on the time of year and my state of mind, so it can be hard for me to describe myself and how I feel. Sometimes I feel like a lot of what we perceive is subjective, and that there is no absolute, objective truth in the world. I also get distracted by seemingly unanswerable questions, such as whether or not a supernatural deity exists, where our existence came from, and whether there is an afterlife. These questions have frustrated me at times in the past, because I know there are strong arguments for each side, and it ultimately comes down to belief.\n\nI've always been very hesitant to ask for help because of how complicated my situation is, as I have spent the last 7 hours writing this all out. I usually don't get too far with trying to explain it before I feel like I'm being whiny an wasting their time. Everyone wants to try to give a quick, easy answer, but life is very complicated and I really have a hard time seeing a point in it all sometimes. \n\nI feel like everyone is ultimately more or less out for themselves. Life really is a competition, after all. A competition for limited resources, recognition, and status. A continuous effort to either stay ahead, keep up, or get ahead. Even though we all end up dying in the end. Sometimes it just seems like life is kind of a pointless game with no particular purpose, and I get tired of feeling like I have to play along.\n\nSorry this ended up being so long. I didn't mean to go so much in depth, but this is the first time I have really put things out there with this much detail and consideration. Thanks if you have read to the end here, I'd like to hear some thoughts.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398508, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Stuck in a rut, don't see a point in getting out. Maybe getting things off my chest might help.", "url": "https://www.reddit.com/r/depression/comments/9qss1r/stuck_in_a_rut_dont_see_a_point_in_getting_out/", "whitelist_status": "all_ads", "wls": 6}]}