{"data": [{"author": "the-throwaway-girl", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2hem3c17", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540572269, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9rme1i/depression_helped_me_ruin_my_teeth/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9rme1i", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9rme1i/depression_helped_me_ruin_my_teeth/", "pinned": false, "pwls": 0, "retrieved_on": 1540572272, "score": 1, "selftext": "I am so embarrassed and ashamed of myself over this that I had to create a throwaway account just to talk about it. I would also like to apologize in advance for any grammatical errors that this post may have, or if my thoughts may seem a bit scattered, as I'm pretty emotional at the moment, and I'm just trying to provide context for the predicament that I currently find myself in.\n\nI'm in my mid 20's, on disability, and still live at home with my parents. I rely heavily on them due to being unemployed and not being financially (and most of the time mentally) stable enough to live on my own. I was diagnosed with bipolar disorder at age 14. Then borderline personality disorder at 19. And finally, a few months ago I was told at a doctor's appointment that I could possibly have schizoaffective disorder as well. My physical health isn't always so great either due to a chronic illness that I have called ulcerative colitis. My mental and physical health has been on the steady decline for years now. Most days I feel so depressed that I can't even get out of my bed no matter how hard I try. But here is the truly sickening and pathetic part of it all: My personal hygiene has become affected by this as well. My teeth are in terrible condition. The various types of medications that I been on for my medical problems (as well as the added combination of ocassionally not brushing them on days that I'm extremely down and out admittedly) resulted in this. One front tooth is noticeably chipped, and three others have massive cavities. I feel so disgusted and ashamed of my appearance. I no longer talk to others or even smile out of fear of people seeing my teeth. My self-esteem is pretty much non-existent, and I've resigned myself to the fact that I may never be in a relationship due to how I look. What guy would want girl with teeth as fucked up as mine? I've gotten to the point where I can't even bare to look at myself in the mirror anymore. I haven't even reached 30 yet, but my mouth resembles that of an old woman, or some type of drug addict. I'm far too afraid to confide in anyone about this, or to see a dentist out of fear of them thinking I'm gross, or calling me a slob. Plus, even if I did go to consult a dentist about my teeth, I highly doubt that my insurance would be able to help me pay for the extensive work that will inevitably need to be done. I'm at such a loss and don't know what to even do anymore. I know that all of this is my own fault and it only makes me hate myself even more.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 399381, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Depression Helped Me Ruin My Teeth", "url": "https://www.reddit.com/r/depression/comments/9rme1i/depression_helped_me_ruin_my_teeth/", "whitelist_status": "no_ads", "wls": 0}]}