{"data": [{"author": "TheStefen", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_139sol", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541989771, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9w9yuv/looking_for_an_outlet/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9w9yuv", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9w9yuv/looking_for_an_outlet/", "pinned": false, "pwls": 0, "retrieved_on": 1541989772, "score": 1, "selftext": "I don’t know where to start. Today, I realized that if I don’t do anything, I am going to lose my family. I can tell my wife is tired of dealing with me. She says I look miserable all the time, and I am, but not with her. I just have such a poor outlook on life. I’m extremely pessimistic about my future, finances, and the false sense of the pursuit of happiness. I am so critical of myself and am never satisfied. I attempt to fill voids of happiness with destructive spending.\n\nI’m considering speaking to a therapist, but my wife thinks this is something simple to solve. The issue is, it isn’t. I spoke to a therapist before years ago, who referred me to a psychologist who diagnosed me as clinically depressed.\n\nI fear I cannot talk to anyone about how I feel. I feel stupid for feeling this way. I feel like I literally suck the happiness from the area around me. Some days are okay, but today just really sucked. I feel so horrible that my wife has to deal with someone like me on a constant basis. I feel everyday I’m pushing her further and further away.\n\nI feel like I could be better. Way better.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 404688, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Looking for an outlet", "url": "https://www.reddit.com/r/depression/comments/9w9yuv/looking_for_an_outlet/", "whitelist_status": "no_ads", "wls": 0}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_139sol", "can_mod_post": false, "contest_mode": false, "created_utc": 1538525987, "domain": "self.forhire", "full_link": "https://www.reddit.com/r/forhire/comments/9kw6yo/hiring_seeking_magento_1_magento_2_wordpress/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9kw6yo", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "fh-hiring", "link_flair_richtext": [], "link_flair_text": "Hiring", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/forhire/comments/9kw6yo/hiring_seeking_magento_1_magento_2_wordpress/", "pinned": false, "pwls": 6, "retrieved_on": 1538525988, "score": 1, "selftext": "Hello /r/forhire,\n\nI run a primarily e-commerce consultant agency and we have a few projects in flight, with others coming down the pipeline.\n\nI am currently looking to interview a few candidates with frontend and backend experience in Magento 1 and Magento 2. I also have a few WordPress sites using a page builder called Elementor Pro or Divi as well.\n\nThe perfect candidate(s) would have experience with:\n\n* Install/customize/extend themes in Magento 1, Magento 2, WordPress, Shopify, and BigCommerce\n* Junior-Mid level experience installing/configuring/creating Magento 2 modules\n* Experience using page builders on WordPress using Elementor Pro or Divi\n* Experience migrating from Magento 1 to Magento 2.\n\nIn your DM to me, make sure to include the name of your favorite cereal so I know you read this.\n\nBonus points if you are confirmed certified from Magento U in your respective area of expertise.\n\nOther notes:\n\n* I am looking for assistance on a long-term Magento 1 to Magento 2 project. I'm not looking to pay someone $8/hour or to try to get the best deal. I am a developer advocate since that's my background, and if you bring value and you can fit the bid, I will happily pay for professional work.\n* While my skillset is frontend Magento development, I know my way around for backend. I enjoy huddling together to come up with a solution. I embrace a challenge, and you should be able to as well.\n\nThanks, and I look forward to meeting some great people.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "forhire", "subreddit_id": "t5_2qzbh", "subreddit_subscribers": 99573, "subreddit_type": "public", "suggested_sort": "new", "thumbnail": "self", "title": "[Hiring] Seeking Magento 1, Magento 2, WordPress, Shopify, BigCommerce developers FE and BE", "url": "https://www.reddit.com/r/forhire/comments/9kw6yo/hiring_seeking_magento_1_magento_2_wordpress/", "whitelist_status": "all_ads", "wls": 6}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_139sol", "can_mod_post": false, "contest_mode": false, "created_utc": 1536690585, "domain": "self.personalfinance", "full_link": "https://www.reddit.com/r/personalfinance/comments/9f03nb/is_the_503020_budget_realistic_in_my_location/", "id": "9f03nb", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "Budgeting", "link_flair_richtext": [], "link_flair_text": "Budgeting", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/personalfinance/comments/9f03nb/is_the_503020_budget_realistic_in_my_location/", "pinned": false, "pwls": 6, "retrieved_on": 1536690586, "score": 1, "selftext": "Hi,\n\nSouth Floridian here looking for some insight on how to properly budget for our first home purchase. While doing some mock budgets using this framework, our combined income would have to be $11,500/month net. This gets us into a $300,000 house with ~$2,100 FHA with MIP, not including HOA if applicable.\n\nI arrived at the monthly needs requirement (50%) by literally stripping our needs down to basics: mortgage, car note, health insurance, utilities, and groceries. This obviously grew the needs budget and the wants and savings budget followed. Now, don’t get me wrong, I’d love to spend around $3,000 on wants, but I honestly feel like we’d need that much. My hobbies are for the most part cost-effective, and I’m pretty set with big purchase for now. The same goes with savings, I’d love to save ~$1,800 to help catch up with not properly maintaining a 401K for my wife and I, college savings for our child, and also student loan payments.\n\nNow I can definitely kick it up a notch and attain the income with my wife (we are self employed), but I’m wondering if it’s even all that necessary. With that mortgage and income, we’re way less than the limit of what an FHA loan would consider a risk.\n\nIs there something I’m missing here? I know we’re in a high COL area, which can be changed, but for the most part we do have to stay in South Florida for personal reasons. I’m trying to convince my wife to go more West, but just enough to keep us close to our personal obligations.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "personalfinance", "subreddit_id": "t5_2qstm", "subreddit_subscribers": 13220339, "subreddit_type": "public", "thumbnail": "self", "title": "Is the 50/30/20 budget realistic in my location?", "url": "https://www.reddit.com/r/personalfinance/comments/9f03nb/is_the_503020_budget_realistic_in_my_location/", "whitelist_status": "all_ads", "wls": 6}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1518378934, "domain": "self.learnprogramming", "full_link": "https://www.reddit.com/r/learnprogramming/comments/7wv3d6/a_story_about_faking_it_until_you_make_it_and/", "id": "7wv3d6", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 42, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/learnprogramming/comments/7wv3d6/a_story_about_faking_it_until_you_make_it_and/", "pinned": false, "retrieved_on": 1518441413, "rte_mode": "markdown", "score": 173, "selftext": "Hi. I’ve waited awhile to post this because I spent a whole lot of time reflecting on the events that happened in the past few days. I’m trying to remain unbiased so I can understand what happened, and take away as much from the experience so that I can learn from it. Sharing it is the final part of my reflection as I’m exposing myself and how I truly feel about my skill set, current situation, and future plans.\n\nAs a young kid, I’ve always loved computers. At first it was games like The Sims, and Diablo 2 (some range, huh?), as well as being introduced to the internet. After playing these games daily, I began to dig deeper into what makes them tick. I began modding in The Sims, and learning about D2jsp for botting in Diablo 2. I never wrote the scripts, but I was always interested in how they work. I began to modify some of the code to tune the scripts to perform much better (I wanted faster Pindleskin runs) and little did I know that’s where I would get my first taste of programming.\n\nMoving onto high school, I took a few computer electives, one of them being a webmaster class. I immediately became hooked and made my first website, which was a clan site for Diablo 2. I created tables for each class, and listed each of my clan members manually in tables (I had no idea how backend programming worked at the time). After some time, I finally finished it.\n\nUnfortunately during the later years of high school, I became less interested and more busy with work since I helped my single mom take care of the house. I never pursued web development for some reason, and took manual labor, retail, or waiter jobs for quick money.\n\nSkipping a few years, I finally get an opportunity to work at an online retailer of blank guns. It was customer service, but I got to learn about email marketing and managing our newsletters. I did a horrible job at it in retrospect, because I was taught to slice the images and place them in table cells and link the sliced images to their respecting products on the website. The HTML was poorly written, but I had no idea at the time. It was more about getting the newsletters out quickly than correct. The owner had no idea what you had to do to avoid spam filters, so our conversion rates were extremely low. I honestly wished I had more time to learn about writing quality emails for the newsletter subscribers to increase our conversion. After 2 years, I left because it became such a toxic place to work. I started at $7.00/hour, and left at $13.50/hour.\n\nAfterwards, I get a job as a web developer for a school uniform company. I was hired purely because of my experience with ecommerce and entry level skills with HTML. I worked with another developer who was consulting for the company at the time, and he showed me the custom PHP/MySQL site he created for the uniform company. It was based on the Zend Framework and I had no idea what I was getting myself into. I essentially kept the site together by frantically researching MySQL commands and trying to learn PHP as I go. With this, the owner felt it was necessary to have me as a manager of the sales associates, and tech for the embroidery machine. As I became more and more involved in the business side of things, I got to work with the website less and less. I was extremely burnt out, and quit so I can go to school and focus on learning in class. I started at $13.50/hour, and left at $17.00/hour.\n\nI couldn’t go to school full time because my wife and I were already living on our own and had bills and such, so I took another job at an internet marketing agency. I became a Magento developer because when I was looking for solutions for a rebuild for the uniform site, the consultant set up Magento for us and I got to play around in the admin to learn. This experience alone got me the job and I had no idea what I was getting myself into. A developer at the time took me under his wing to learn Magento from him as I was assigned my first project. It was a Magento multisite with a B2C store and B2B store. The CTO at the time felt it was a good way to get my acclimated with Magento. A 120 hour estimate became 250 hours, and to this day, I do not know how I got to keep my job. Most days I cried on the way home from work from sheer frustration of not understanding what I was doing and worried that I was going to get fired. My wife was pregnant at the time, so that was all that was on my mind. I had to keep my job no matter what. I began to deeply learn Magento almost 16+ hours a day. I dropped out do school because I couldn’t balance it all as well. I became more proficient in Magento, but there were two things that still bothered me. I didn’t have proficient enough knowledge in PHP and MySQL, and to this day, I still do not. Skipping over these foundation technologies and going straight into Magento deeply is what pigeon-holed me for Magento for the next few years. I was always motivated by the money the professionals were making on the market, and I felt if I learned Magento enough, I would be there with them. My initial offer was $25/hour here.\n\nAs I learned, I became more full of myself and foolishly driven by income. As soon as I put Magento on my LinkedIn, I was contacted almost daily for opportunities. The offers became higher and higher until I finally was sought out from a local furniture company that offered my a starting salary of $80,000/year. They were on Magento 1 EE, and I would be working with a team dedicated to one site. To me, this was a godsend because I was tired of working as a qualified brick layer of templated sites that we created the same thing over and over again, with no innovation on performance, new technology, or continued education. As I went to leave, my boss offered me $73,000/year to stay. I obviously left because $7,000 means more, right?\n\nSo I started at the furniture company, and the ecommerce team was an extension of the marketing team. There was less of a focus on technology, and more of a focus on the customer journey experience as an omnichannel solution. Our team was also assisted by a consulting firm that to this day, boils my blood when I think of them. They had no experience with Magento, and honestly just burned the clock when they were in the building. The director of ecommerce was a friend of the head consultant, so I’m sure there was some kickbacks going on. That with the bureaucracy of the corporation ate away at my passion for developing at all. I performed poorly not only because of this, but my lack of skills to offer specific solutions for the company. It wasn’t just adding extensions and modifying them to work with the business logic. Motivated by fear, I continued to fake it until I made it and look for another job. I didn’t even last a year here before I went back to the agency that offered me $85,000/year to come back.\n\nBack at the agency, I was tasked with my first Magento 2 site. Again, another multisite solution that needed 4 stores. Luckily I paired up with a Frontend developer on this one and took care of the backend, which was essentially performing a migration from Magento 1 to Magento 2 and installing 15+ extensions. Due to a lack of skill and motivation (who wants to go back to their old job?) the project was over-budget, and late. I don’t even last long enough to get it out the door because during that time there was an acquisition taking place and people got scared and started leaving left and right. I end up finding another job as a senior Magento Frontend developer for a remote company.\n\nThey offered my a starting salary of $95,000/year. I finally made it, I’m $5,000 away from six-figures. I literally make more than my parent combined. My wife is happy, we’re safe and finally starting to work on our financial issues such as maxed out credit cards, hospital bills from the baby, and collections.\n\nAs work progresses, I notice the same pattern again. My lack of foundational skills prevents me from offering solutions much quicker than other developers. I get outed immediately after 3 months. 3 weeks ago, my boss has a one on one with me and tells me that was my last day working with them.\n\nAfter the phone call, I’m floored. I began to look back on every opportunity I should’ve taken to learn the foundational skills needed to actually be a developer. I didn’t even know how to send form data to a backend, or proper object oriented programming. I just copied what worked in some parts of the site, and tweaked it a bit. I had no idea what I was doing. I immediately start doubting myself and skills as a developer.\n\nThroughout these last few weeks, I become dangerously depressed. As a sole provider of my family, I constantly give myself grief for what happened. I lay in bed for days, unmotivated to do anything. I don’t even look at my phone. I’ve lost weight, I feel sickly.\n\nWe live with my mother in law now, in an attached studio. Our room is small, and now we co-sleep with my daughter in the bed. I feel the distance between my wife and I grow daily. The added stress does not help us out. With almost no money (poor spending habits), no insurance, and down to our last $1,000... something has to change.\n\nWith all of this new time, I’ve been focusing on building my business up and improving my development skills. I have a few clients to help me float by a bit, but without marketing the well will run dry quickly. I’m only taking on work I’m capable of doing now, and unfortunately the jobs are cheap since we need the money.\n\nMy main focus for income right now is quick WordPress sites using page builders. I also have a client that sends me Magento work from time to time as well. For learning, I’ve decided to learn JavaScript deeply, and focus on React and it’s ecosystem since it seems fairly popular. I also figured becoming an educator on a platform like Udemy could help me sell courses which allow me to teach others as I learn. I’ve always had an interest in educating, which is why I wanted to start a business for consulting. I just ended up doing the development work as well, lol.\n\nAfter all of this, my biggest take away is that this time around, I don’t want to chase the money. I honestly want to make enough to manage my expenses and buy a house for my family. I can’t stand seeing my daughter cooped up in a room like this. I also feel that I might not have enough business coming in to sustain a livable income for my family and I, so I will probably end up having to get a job again until I can guarantee income from my business.\n\nTake my experience, and learn from it. Learn your fundamentals, know what you’re doing, and don’t go too fast. You might crash and burn just like I did. I chased something I didn’t deserve and earn at the time, and paid dearly for it in the end. Now my family suffers from my selfishness.\n\nTL;DR: Moved through jobs way too fast, didn’t learn fundamentals of the programming languages I worked through daily. Made too much money, got used to it, and got fired from lack of skills from my $95,000/year job after three months. Got sad, mooped a bit, and now reinvesting in my education by learning JavaScript the right way with all the foundations before moving on. Motivated by creating a better life for my family. Learn from my mistakes.\n\n", "spoiler": false, "stickied": false, "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd", "subreddit_type": "public", "thumbnail": "self", "title": "A story about “faking it until you make it” and shooting too high, fizzling out, and doing at all over again", "url": "https://www.reddit.com/r/learnprogramming/comments/7wv3d6/a_story_about_faking_it_until_you_make_it_and/", "whitelist_status": "all_ads"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1513610345, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/whatisthisthing/comments/7kltho/these_black_pepper_looking_things_keep_showing_up/", "id": "7kltho", "is_crosspostable": true, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "locked": false, "num_comments": 8, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/whatisthisthing/comments/7kltho/these_black_pepper_looking_things_keep_showing_up/", "pinned": false, "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "WEn8aX2CAOxU9c4aDrF3c32bGmuH8tiGOUPwMP4mnMI", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=695d302bbb82418a5055577d86e34b7b", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=8afde214ae2cb3b0d425fe3b8c2e6076", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=4c7f528fd3c9e667e5afd62e594c2822", "width": 320}, {"height": 480, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=c200603f79e9f91ff14bdd19715ea36e", "width": 640}, {"height": 720, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=2546fb077e3ac91c5bcd056f44f03915", "width": 960}, {"height": 810, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=3c12bac0d4bcbd63308c47cebcc10f34", "width": 1080}], "source": {"height": 3024, "url": "https://i.redditmedia.com/zSoe0bXvurRt5N-Jq6ODSXnfzej5pubSSMV7PCmOp5I.jpg?s=671b80c0823afdefc3281a5476d5b627", "width": 4032}, "variants": {}}]}, "retrieved_on": 1513663365, "score": 3, "selftext": "", "spoiler": false, "stickied": false, "subreddit": "whatisthisthing", "subreddit_id": "t5_2s3kh", "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/nPSo1w44me8ymZpiFSId3jnplZWGiBq6KoPPTBdzvrI.jpg", "thumbnail_height": 105, "thumbnail_width": 140, "title": "These black pepper looking things keep showing up near my computer monitor and my bathroom sink drawer. We clean the area daily and they keep showing up. What are these things?", "url": "https://i.redd.it/0i7y01e57p401.jpg", "whitelist_status": "all_ads"}, {"author": "TheStefen", "author_flair_css_class": "default", "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1509244380, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/daddit/comments/79e7al/one_of_the_first_important_decisions_ive_ever/", "id": "79e7al", "is_crosspostable": true, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_css_class": "kidpicture", "link_flair_text": "Kid Picture/Video", "locked": false, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/daddit/comments/79e7al/one_of_the_first_important_decisions_ive_ever/", "pinned": false, "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "LPRV7kDRre4hsg5spRgacjV_wN5nD8Z9IckFMhVXl6o", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=16457b7bc3181dae5a0350fb13a15c89", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=5502705d5625e736850be1a7ab9c549a", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=acecfd70874b7c85697072834a3fb823", "width": 320}, {"height": 480, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=640&amp;s=1a0919c1c20d607e4f681d455f58d391", "width": 640}, {"height": 720, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=960&amp;s=9a12530f95441f73230834c59d4a1b0f", "width": 960}, {"height": 810, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=1080&amp;s=63f3c2c8422b5028933eca82d8dcfa51", "width": 1080}], "source": {"height": 3024, "url": "https://i.redditmedia.com/nLTxDVGi5cQDst-PAkdnHva-nztMnUiCcEW-k2gspSE.jpg?s=ef6273bccd5c12cedb38566879dbcea4", "width": 4032}, "variants": {}}]}, "retrieved_on": 1509340226, "score": 28, "selftext": "", "spoiler": false, "stickied": false, "subreddit": "daddit", "subreddit_id": "t5_2rxue", "thumbnail": "https://b.thumbs.redditmedia.com/xhCFJVbd5KdOZVDFOxaA-1FBcI0NXbUJFDlcpQ-uoyI.jpg", "thumbnail_height": 105, "thumbnail_width": 140, "title": "One of the first important decisions I’ve ever made as a kid, now in my daughter’s hands.", "url": "https://i.redd.it/oos9km9wkouz.jpg", "whitelist_status": "all_ads"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1505010977, "domain": "self.Jokes", "full_link": "https://www.reddit.com/r/Jokes/comments/6z5wb8/if_at_first_you_dont_succeed/", "id": "6z5wb8", "is_crosspostable": true, "is_self": true, "is_video": false, "locked": false, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Jokes/comments/6z5wb8/if_at_first_you_dont_succeed/", "retrieved_on": 1505106726, "score": 125, "selftext": "Then perhaps skydiving isn’t for you.", "spoiler": false, "stickied": false, "subreddit": "Jokes", "subreddit_id": "t5_2qh72", "thumbnail": "self", "title": "If at first you don’t succeed...", "url": "https://www.reddit.com/r/Jokes/comments/6z5wb8/if_at_first_you_dont_succeed/", "whitelist_status": "all_ads"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1493748849, "domain": "self.learnprogramming", "full_link": "https://www.reddit.com/r/learnprogramming/comments/68uuj2/this_guy_speaks_truth_in_his_first_of_the_series/", "id": "68uuj2", "is_self": true, "locked": false, "num_comments": 1, "over_18": false, "permalink": "/r/learnprogramming/comments/68uuj2/this_guy_speaks_truth_in_his_first_of_the_series/", "post_hint": "self", "preview": {"enabled": false, "images": [{"id": "2TpzvbQJDGhKodOfDa_G_-EF8XrqO44RIEFKUL_DMrQ", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/k3th3CQhysff1Fyiiwao1VT2kXmv2LbMNACKl6rx3qQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=4af70f8a494ac5b5b361d0d77ea8073c", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/k3th3CQhysff1Fyiiwao1VT2kXmv2LbMNACKl6rx3qQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=868f6f6fd7297452782b8b7d895f971e", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/k3th3CQhysff1Fyiiwao1VT2kXmv2LbMNACKl6rx3qQ.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=6e39fa6892aaaa3e241ef5db4650db56", "width": 320}], "source": {"height": 360, "url": "https://i.redditmedia.com/k3th3CQhysff1Fyiiwao1VT2kXmv2LbMNACKl6rx3qQ.jpg?s=1855b6956425a280b5632014a55b776a", "width": 480}, "variants": {}}]}, "retrieved_on": 1494658123, "score": 0, "selftext": "I've been watching MPJ for quite sometime and this is my most favorite video of him yet. He speaks truth about the evolution of human being's perseverance vs. the cognitive requirements of the work we do. This really validates on how you approach working and learning, and leaning in on the problem, rather than beating yourself up because you can't fix it.\n\n https://youtu.be/DwQ7psiU23I\n\nI really can't wait for the other 7 videos in this series.", "spoiler": false, "stickied": false, "subreddit": "learnprogramming", "subreddit_id": "t5_2r7yd", "suggested_sort": null, "thumbnail": "self", "thumbnail_height": null, "thumbnail_width": null, "title": "This guy speaks truth in his first of the series on developer characteristics (perseverance). This is a truly must watch.", "url": "https://www.reddit.com/r/learnprogramming/comments/68uuj2/this_guy_speaks_truth_in_his_first_of_the_series/", "view_count": null}, {"author": "TheStefen", "author_flair_css_class": "default", "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1486361589, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/daddit/comments/5scmz8/my_wife_and_i_meeting_our_first_child_yesterday/", "id": "5scmz8", "is_self": false, "link_flair_css_class": "admissionpicture", "link_flair_text": "Admission Picture", "locked": false, "num_comments": 13, "over_18": false, "permalink": "/r/daddit/comments/5scmz8/my_wife_and_i_meeting_our_first_child_yesterday/", "post_hint": "image", "preview": {"enabled": true, "images": [{"id": "UX6MLxe5QdtlnkcX3TgauXojdSKwwyb0imswUAcQeF4", "resolutions": [{"height": 108, "url": "https://i.redditmedia.com/mqepOrBxXe8xDDRK_BKbtd9uSFgdb2UMtGgRsUCVjok.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=f9913424a8a88970c6b41336ea7111c1", "width": 108}, {"height": 216, "url": "https://i.redditmedia.com/mqepOrBxXe8xDDRK_BKbtd9uSFgdb2UMtGgRsUCVjok.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=c44daecdd2c5a63c093d3bffc3a7a3c2", "width": 216}, {"height": 320, "url": "https://i.redditmedia.com/mqepOrBxXe8xDDRK_BKbtd9uSFgdb2UMtGgRsUCVjok.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=bf3e2361e078a03dec5882e73e75e101", "width": 320}], "source": {"height": 639, "url": "https://i.redditmedia.com/mqepOrBxXe8xDDRK_BKbtd9uSFgdb2UMtGgRsUCVjok.jpg?s=ed0dd59cea750ef6577c8ef02afb60e6", "width": 639}, "variants": {}}]}, "retrieved_on": 1489513369, "score": 145, "spoiler": false, "stickied": false, "subreddit": "daddit", "subreddit_id": "t5_2rxue", "suggested_sort": null, "thumbnail": "https://b.thumbs.redditmedia.com/Cv8JTDPa3djjJ7mqxUtk6xofnigv28NVuAAmL2BFcbk.jpg", "title": "My wife and I meeting our first child yesterday. Please say hello to Penelope Lane", "url": "https://i.redd.it/03pfgv4fi6ey.jpg"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1484939354, "domain": "self.GameSale", "full_link": "https://www.reddit.com/r/GameSale/comments/5p5wwz/usa_h_overwatch_origin_edition_x1_35_w_paypal/", "id": "5p5wwz", "is_self": true, "locked": false, "num_comments": 1, "over_18": false, "permalink": "/r/GameSale/comments/5p5wwz/usa_h_overwatch_origin_edition_x1_35_w_paypal/", "retrieved_on": 1489456196, "score": 1, "selftext": "Hi,\n\nI have an open, dlc-redeemed copy of Overwatch: Origin Edition on the X1. Got it for the PS4 since majority of my friends play there. The price is $35 shipped in the cont' US.", "spoiler": false, "stickied": false, "subreddit": "GameSale", "subreddit_id": "t5_2zavr", "suggested_sort": null, "thumbnail": "self", "title": "[USA] [H] Overwatch: Origin Edition X1 $35 [W] PayPal", "url": "https://www.reddit.com/r/GameSale/comments/5p5wwz/usa_h_overwatch_origin_edition_x1_35_w_paypal/"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "contest_mode": false, "created_utc": 1483408172, "domain": "self.swdestiny", "edited": 1483543141, "full_link": "https://www.reddit.com/r/swdestiny/comments/5lp4v9/online_league_play/", "id": "5lp4v9", "is_self": true, "locked": false, "num_comments": 25, "over_18": false, "permalink": "/r/swdestiny/comments/5lp4v9/online_league_play/", "retrieved_on": 1489394539, "score": 6, "selftext": "Would any of you be interested in playing in an online league? I purchased Tabletop Simulator and the SW:Destiny module seems perfect for this. I've never run a league myself, but I wouldn't mind learning how organize and set it up.\n\nI really enjoy the game, but with the cost and availability, I'd like to play a bit more here before I spend more money. I'm sure I'm not the only one in the same boat here.\n\nShoot me a message or reply if you're interested.\n\nEDIT: Due to the overwhelming popularity, I'm going to organize another league event. I'd like to start a pre-season so we can all get accustomed to the game and format while I look for a sponsor for prize support. Once I have the prize support in place, I'll start organizing those interested and look for additional help to help with management if necessary. I'll keep all of you updated in the process.", "spoiler": false, "stickied": false, "subreddit": "swdestiny", "subreddit_id": "t5_3fo27", "suggested_sort": null, "thumbnail": "self", "title": "Online League Play", "url": "https://www.reddit.com/r/swdestiny/comments/5lp4v9/online_league_play/"}, {"author": "TheStefen", "author_flair_css_class": null, "author_flair_text": null, "contest_mode": false, "created_utc": 1480812232, "domain": "hellobonsai.com", "full_link": "https://www.reddit.com/r/freelance/comments/5gct2g/bonsai_the_tool_i_use_for_managing_contracts_its/", "id": "5gct2g", "is_self": false, "locked": true, "num_comments": 0, "over_18": false, "permalink": "/r/freelance/comments/5gct2g/bonsai_the_tool_i_use_for_managing_contracts_its/", "retrieved_on": 1484301814, "score": 1, "spoiler": false, "stickied": false, "subreddit": "freelance", "subreddit_id": "t5_2qhs9", "thumbnail": "default", "title": "Bonsai - The tool I use for managing contracts. It's free for contracts, and charges a small fee to manage invoices as well. I couldn't recommend this enough.", "url": "https://www.hellobonsai.com/"}]}