{"data": [{"author": "thisusernameisbaaad", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2mpgf267", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542653338, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9yjmkp/i_know_what_to_do_but_i_cant_do_it/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yjmkp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9yjmkp/i_know_what_to_do_but_i_cant_do_it/", "pinned": false, "pwls": 0, "retrieved_on": 1542653338, "score": 1, "selftext": "I’ve had a pretty rocky time with my depression. I grew up being told my depression was situational, which hindsight being 20/20 is probably true. I was an angry female high schooler. \n\nI’m 25 now. 4 years ago my mother died from chronic illness and while she was in hospice all of my hair on my body fell out and I was diagnosed with Alopecia universalis. Now I’m bald. \n\nI’ve been combatting the inevitable depression associated with this trauma through diet and exercise. I go to the gym 4-5 times a week and I meal prep so I don’t eat out. That lifestyle has helped immensely. I’m in the midst of an unhappy 5 year relationship where neither of us know what we want and we now work together. I had a bit of a hard time with alcohol for a few years but I’ve been cutting that out and I feel ok not drinking. \n\nSo to the point, I’m depressed. It’s the type of depressed I can physically feel now. It feels like a weighted blanket on my head and I can’t shake it. I cry e v e r y d a y. I don’t sleep well, very lucid dreaming and sleepwalking. I have suicidal thoughts almost everyday but the kicker is that I have no intention of doing that! I don’t want to hurt myself, I love my family and would never want to do that to them. I guess the only way I can put it into words is like, the chemical imbalance in my brain has gotten so bad that these thoughts are secondary to that. \n\nI’ve researched different therapists in my area and I’ve seen a few in the past and it just never goes well. I always feel like it’s just an hour of me talking about the same crap over and over without any input. I’m missing that motherly advice. \n\nAnyway..I moved out of my apartment this morning with my boyfriend because he wants to take a “break” and I’m at a pretty low point and looking for some advice here. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 407345, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I know what to do but I can’t do it", "url": "https://www.reddit.com/r/depression/comments/9yjmkp/i_know_what_to_do_but_i_cant_do_it/", "whitelist_status": "no_ads", "wls": 0}]}