{"data": [{"author": "throwaway_account334", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2i7uhwau", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540875077, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9skuxm/crumbling/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9skuxm", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9skuxm/crumbling/", "pinned": false, "pwls": 0, "retrieved_on": 1540875079, "score": 1, "selftext": "Throwaway account obviously.\n\nA little about me, I'm 33M and I live in LA. I work in digital marketing/audience development (basically helping videos and articles get views and engagement). I was diagnosed in college with depression, but I never really did anything about it except self-medicate with alcohol. I've kept doing it into my 30's because I guess it sort of worked. Anyways, the reason I'm writing this is that I've had some deaths in my family, experienced some discouraging work issues, and suffered extreme disillusionment about my future in the past year. I'm not sure who to turn to. I just wake up every morning wishing I hadn't. \n\nDuring the first half of this year, my grandmother and grandfather passed away. I wasn't exceptionally close to either of them but they left letters addressed to me wishing that had been different and that they really loved me. Their messages of love really fucked me because I have never really had felt such selfless love coming from people who didn't know me. In fact, with my immediate family they know me and we aren't close at all.\n\nWork wise, 2018 started off great, I got a promotion at a job that I really wanted and suddenly had a team of really great people as direct reports under me. However, right after I got promoted (about 2 weeks later) they fired everyone off my team and kept me promising they would rebuild the team for about 4 months and then they demoted to a very junior position as a part-time hourly employee. It hit me pretty hard since I had worked really hard for over 2 years to get this position and to get it and then immediately lose it really broke me. My bosses said it wasn't performance-based but because of the fact, they were running out of money (start-up) and didn't forsee re-hiring anyone for my team. So I'm now getting 1/2 my previous paycheck and working from home which is keeping me afloat financially for now but also feeding into my loneliness and my depression. Drinking has helped make the days go faster so I don't spend to much time feeling down but it's becoming a problem.\n\nIt's a struggle to get out of bed, eat right, hang out with friends or even spend time with my girlfriend now. I've realized I hate the line of work I am in and what I want to get paid to do just doesn't seem possible at my age (TV writer). In fact, I don't even want to watch movies or television because it just reminds of a dream I wanted but will probably never have. I've tried reaching out to my family to fix and create strong bonds but they aren't really interested. My friends and girlfriend have been really supportive but I don't think I have been able to tell them truly how deeply I feel myself just crumbling inside. Usually, I only hint at this stuff after 10-12 beers and they have their own problems, I honestly don't want to burden them with mine. \n\nI overall don't see much hope in my future. I see the problems and obstacles I face but they look overwhelming and I don't trust myself to understand how to tackle them or strong enough to even do it.  I feel defeated.\n\nThanks for reading if you made it this far.\n\n\n\n\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 400442, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Crumbling.", "url": "https://www.reddit.com/r/depression/comments/9skuxm/crumbling/", "whitelist_status": "no_ads", "wls": 0}]}