{"data": [{"author": "throwaway123456cat", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2milstn8", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542581784, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9yaqwr/i_have_a_full_life_but_i_am_still_depressed/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yaqwr", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9yaqwr/i_have_a_full_life_but_i_am_still_depressed/", "pinned": false, "pwls": 0, "retrieved_on": 1542581785, "score": 1, "selftext": "I have been diagnosed with depression since I was 16 and since then it is usually only brought on by stressors in my life. I have also been on various medications since I was 18 and now at 25 I feel that these work for me for the most part. I am also a female. \n\nI am currently in college and live at home. I graduate in two years with plans to get my Masters. I have a part-time job that I enjoy and some friends. My friend situation is slightly weird. I have a best friend who is about an hour away and we see each other and do something about once a month. I also have a friend at school who I thought was a real friend but this past summer I realized I was not really. Her boyfriend came to live with her this past summer and it was like I no longer existed. I would have been okay with this but it seemed like I was always reaching out to her and she was always busy. Then on social media she would constantly post pictures with this other girl she had said she was no longer close to. Before all this we would literally talk on the phone every day and I was over her apartment at least once a week. When school started this semester I noticed she would text me more and it started to get similar to where it was and it was then I realized our friendship was basically for convenience for her to have someone at school. \n\nIn my free time I do volunteer or spend time with friends but I am also constantly upset about being single. I feel like this is where a lot of my depression comes from. I have not had a serious relationship in two years and it has started to make me feel lonely and unfulfilled. I have had shorter term relationships in that time but it always seemed like none of them made me feel anything. I also have an issue where I really do not like to go a long time without sex. I am able to separate sex and feelings for the most part but at the end of the day I am still single and feel alone. \n\nI guess to end my rambling whenever I am single I try and have hobbies and my school life is going well but I still feel there is something missing. I will have days where I just lay in bed all day wishing and wanting to have the happiness that I see in couples around me. I know everyone looks perfect from the outside and nobody is actually perfect. I am currently trying online dating and actually have a date set up but I am scared that my mindset is in desperate mode and I will not make the right decisions. I am not sure if I am asking for advice I think I just want to get my feelings out there.  ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 407033, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I have a full life but I am still depressed", "url": "https://www.reddit.com/r/depression/comments/9yaqwr/i_have_a_full_life_but_i_am_still_depressed/", "whitelist_status": "no_ads", "wls": 0}]}