{"data": [{"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542727975, "domain": "self.love", "full_link": "https://www.reddit.com/r/love/comments/9yt694/am_i_allowed_to_love/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yt694", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/love/comments/9yt694/am_i_allowed_to_love/", "pinned": false, "retrieved_on": 1542727976, "score": 1, "selftext": "Prior to two years ago I avoided all romantic relationships. I didn’t think it was fair to other people knowing I was basically leading them on. Two years ago I thought I was in the clear and so I got into a relationship. I ended up breaking her heart when my cancer returned. I ended our relationship because I started imagining how badly I’d hurt her when I die. I’ve had cancer since I was a kid and it was the furthest amount of time that had passed without me having cancer, 7 years. I’m in my mid 20s. I’ve felt like the shittiest person since I let her go. I loved her. I knew all along chances were the cancer would return and I still put her through all of it, I loved her and I still did that to her. \n\nRealistically speaking, I won’t make it to 30. I’ve never tried to withhold my situation and I’m honest about it from the get go, but it feels like I’m forcing emotional trauma on those I interact with. I feel terrible for forcing it on my friends and family. I try to not interact with too many new people as I know I’ll inevitably end up hurting them, when it’s romantic it’s even worse. Am I allowed to love and can I let people love me with a clear conscience? I don’t know anymore. Maybe this just isn’t for me.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "love", "subreddit_id": "t5_2qhnh", "subreddit_subscribers": 25465, "subreddit_type": "public", "thumbnail": "self", "title": "Am I allowed to love", "url": "https://www.reddit.com/r/love/comments/9yt694/am_i_allowed_to_love/"}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542703673, "domain": "self.confessions", "full_link": "https://www.reddit.com/r/confessions/comments/9yqew8/everybody_thinks_im_happy_but_im_not/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yqew8", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/confessions/comments/9yqew8/everybody_thinks_im_happy_but_im_not/", "pinned": false, "pwls": 1, "retrieved_on": 1542703674, "score": 1, "selftext": "I’ve been a liar for most of my life now. What started as a defense mechanism has evolved into something a lot more destructive. I started experiencing pain before my teens, I saw countless doctors and nobody could figure out what was wrong. I told people I was in pain but I was met with disbelief. I had to quit football and running because the pain got too intense. I was branded a liar and got bullied relentlessly. In order to protect myself I felt like I had to start lying, I got really good at hiding the pain. \n\nWhen the doctors found the tumor in my foot it was estimated to have been growing for 5 years. It explained the pain I’d been feeling. It turned out to be cancerous. I did 2 years of chemo, 2 months of radiation therapy and 15+ surgeries. 7 years later, my cancer returned and my leg had to be amputated. I’ve spent more than half of my life with cancer and pain. I don’t remember what it feels like to not be in pain. \n\nEverybody thinks I’m happy but I’m not. I’m insanely good at lying. I brush it off, tell everyone I’m alright, act happy and strong and they have no clue. I’m called an inspiration and a motivation multiple times each week, because they have no idea how broken I feel inside. Every part of me wishes I died before the pain started. I’ve spent most of my life purposefully suppressing my emotions. I wish I never had to see so much pain and agony. My life has touched too many other lives and I know in my heart that I can never come clean about this. They’ve been through enough pain already. If they knew I cried myself to sleep every single night over what I’ve lost, they’d never look at me the same again. I wish it didn’t have to be like this. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "confessions", "subreddit_id": "t5_2qq6g", "subreddit_subscribers": 261363, "subreddit_type": "public", "thumbnail": "self", "title": "Everybody thinks I’m happy but I’m not", "url": "https://www.reddit.com/r/confessions/comments/9yqew8/everybody_thinks_im_happy_but_im_not/", "whitelist_status": "house_only", "wls": 1}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542702663, "domain": "self.vegetarian", "full_link": "https://www.reddit.com/r/vegetarian/comments/9yqbfp/i_generally_dont_really_care_about_animals/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9yqbfp", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/vegetarian/comments/9yqbfp/i_generally_dont_really_care_about_animals/", "pinned": false, "pwls": 6, "retrieved_on": 1542702664, "score": 1, "selftext": "Hey. This is probably a pretty unpopular opinion here but I don’t know man, I don’t really care about animals and I thought I’d check if someone else was like me. I think it’s unfortunate that so many species are going extinct but I don’t really care about it further than that. The reason why I’m a vegetarian is because I think the biggest problems humanity are facing are all related to our environment. \n\nI know that I’m very inconsistent with my compassion for animals. I dislike dogs and don’t really care for them, but I love cats. I don’t care for cows but I feel sorry for chickens. The first meat I stopped eating was chicken, it’s easy to see that chicken has in fact been an animal so I think that’s how that started. Meatballs / steak etc: you know it’s meat, but it doesn’t look like it’s an animal if you understand what I mean? Like I said, I know I’m inconsistent, I can only speculate as to why I feel this way. I kept eating beef for many more years until I learned more about the environmental impacts it has and I’ve been vegetarian for almost 1 year now. \n\nI think one of the big reasons why I don’t care about cows is because I think we’ve effectively created them. If everyone stopped eating beef / using products made from cows today, realistically speaking every single cow would die. They won’t make it in the wilderness. They’d probably survive as a zoo attraction or something down the line, but I don’t see them staying at the insane numbers they have right now. For me, I really couldn’t care less if they went extinct. Those who want to stop consuming everything from cows, I wonder if they realize that 50 years from now cows would most likely be extinct if everyone stopped using cow related products. \n\nThis (combined with laziness) is why I’m a vegetarian instead of a vegan. For the most part I don’t really care about animals. I think it’s utterly disgusting how we breed chickens. If they’re not killed for their meat then they die within months either way as their organs can’t keep up with their bodies. I think it’s disgusting how humans are OK with that...but I don’t really feel sorry for the chickens. The disgusting part is how we’ve changed species so far beyond recognition. I feel sorry for their species, but I don’t really have empathy for the individual chicken. \n\nIf I had to speculate, I think it could be because I’ve never actually seen an animal die. I’ve seen them in neat boxes at the supermarket, but I’ve never actually seen them go through the process of dying. I think gore is really hard to watch so I’ve never tried to see it. I might have more empathy for animals if I had to see it with my own eyes, I don’t really know. The death of my first cat when I was a kid really affected me, which could be why I love cats more than any other animal.\n\nAm I completely alone in these mindsets? Not trying to offend anyone so I’m sorry if anyones offended by anything! Not a native english speaker so I might come off as blunt or whatever, but that’s really not my intention :) ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "vegetarian", "subreddit_id": "t5_2qm7x", "subreddit_subscribers": 123341, "subreddit_type": "public", "thumbnail": "self", "title": "I generally don’t really care about animals.", "url": "https://www.reddit.com/r/vegetarian/comments/9yqbfp/i_generally_dont_really_care_about_animals/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542283842, "domain": "self.AskDocs", "full_link": "https://www.reddit.com/r/AskDocs/comments/9xamyd/pain_in_my_lower_leg/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9xamyd", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/AskDocs/comments/9xamyd/pain_in_my_lower_leg/", "pinned": false, "pwls": 6, "retrieved_on": 1542283843, "score": 1, "selftext": "Hi! I’m 22/M, 6’1, 155lbs. Living in the UK.\n\nI’ve had the pain for around 3 weeks now. The pain is at the front of my lower leg. I didn’t want to risk further injury so I didn’t run for 2 weeks after the initial pain, during these 2 weeks I felt mostly fine. I ran again two days ago and yesterday, only short distances like 2-3 miles or so. I felt a small amount of pain two days ago, the pain got really intense yesterday, it hurt really badly long after I ran. I’m using a good running shoe with all sorts of things specifically made for running. Besides the pain in my lower leg I feel no pain related to physical activity.\n\nI’ve had cancer since I was young so I haven’t been able to run for the past decade. The cancer returned last year and my right leg was amputated, my left leg is the leg with the pain. Sometimes I’m too lazy to put my prosthetic leg on so I do a fair amount of jumping on one leg every day.\n\nCurrent medications: gabapentin for the phantom limb pain.\n\nI’ll meet with my doctor early in next week so I’ll go through the issue with him and see what he thinks about it. Until I see my doctor: should I wait with running or will the pain just go away after a while? Is this a normal issue or could it actually be dangerous? Thank you for your time.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "AskDocs", "subreddit_id": "t5_2xtuc", "subreddit_subscribers": 75743, "subreddit_type": "public", "thumbnail": "self", "title": "Pain in my lower leg", "url": "https://www.reddit.com/r/AskDocs/comments/9xamyd/pain_in_my_lower_leg/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542157443, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wv659/im_not_sure_if_im_depressed_anymore/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wv659", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wv659/im_not_sure_if_im_depressed_anymore/", "pinned": false, "pwls": 0, "retrieved_on": 1542157444, "score": 1, "selftext": "I’ve been feeling weird for a while. Like, I don’t even know if I feel. I feel pain all of the time, but besides that I don’t really feel anything. I used to be so full of hatred but now there’s just nothing. I was happy sometimes, sad sometimes, but now I’m just numb. For a while I felt a sort of hopelessness, I don’t even have that anymore. \n\nI spent years angry, more than a decade. I remember feeling the weight of the world on my shoulders. I can barely remember sadness. I haven’t cried for 7-8 years now. Sometimes I try to force myself to cry just so that I can feel something. I’m never upset.\n\nI spent so many years doing everything in my power to hide the pain. I threw parties, I always got high or drunk, I went clubbing all the time. Me and my boys got into so many fights. As I was losing feelings I started craving the feeling of feeling something. Pain has always been with me so I think I got addicted to it. Love, anger and sadness are feelings you need to work for, pain is easy. I’ve found a lot of comfort in pain. \n\nI was introduced to pain pretty early, I wasn’t even 10 years old. I sometimes wonder who I would’ve been if the pain had never come for me. Would I have been a happy person? Would I achieve something? I used to be so angry about what I lost, but now I’m not even angry. I used to be frustrated that I couldn’t get angry, but now I can’t even get frustrated. \n\nI started lying as a defense mechanism, see nobody believed me when I said I was in pain. I didn’t know how to explain it, I was just a kid. I was ridiculed and branded a liar. I lied and told people I was alright. I got pretty good at lying. \n\nI got the cancer diagnosis at 14, the tumor had been growing for 5 years based on tissue samplings. \n\nI’m 23 now. I’ve spent most of my life in pain. My kidneys are close to failing. It feels like my body is shutting down. Cancer returned last year and my leg was amputated. I wish I was angry, sad or even just upset. I want to feel something. I spent so many years trying to hide the pain, I did so many drugs, I drank so much, I wanted to run away from the pain: but pain is all I have left now. I’ve known pain longer than I’ve known most of my friends. Most of all I wish that cancer would kill me already. I’ve been here long enough. I can’t kill myself, most of my life it’s felt like my sole purpose was to hide my feelings and to act strong, if I killed myself then I’ve failed my entire purpose. I wish I hadn’t seen what I’ve seen. Maybe then I wouldn’t be this way? Maybe I’d be able to be angry or sad? I don’t know. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 405508, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I’m not sure if I’m depressed anymore.", "url": "https://www.reddit.com/r/depression/comments/9wv659/im_not_sure_if_im_depressed_anymore/", "whitelist_status": "no_ads", "wls": 0}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541898551, "domain": "self.cancer", "full_link": "https://www.reddit.com/r/cancer/comments/9vzpsn/why_did_it_have_to_be_so_hard/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9vzpsn", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/cancer/comments/9vzpsn/why_did_it_have_to_be_so_hard/", "pinned": false, "pwls": 6, "retrieved_on": 1541898551, "score": 1, "selftext": "10 yrs old when my foot started hurting, I stopped complaining because I was \"being a bitch and a liar\". \n\n12 yrs old when I finished 4th (out of ~9000) in a 5K run, I quit running out of disappointment and \"you're nothing unless you're #1\". \n\n13 yrs old when I quit football because I couldn't run anymore, I put more time into video games, the pain was getting worse, \"fucking nerd, fucking liar\". \n\n14 yrs old when I broke down in school because I could barely walk anymore. I got laughed at because \"you're a fake, stop going on about your foot\". \n\n15 yrs old when a doctor finally found something wrong with me. A tumor the size of a tennis ball was located in my right foot. It was estimated to have been growing for 5 years. Synovial sarcoma, cancer. \"Why didn't you tell anyone how much pain you were in?\"...\n\n20 yrs old when I had a decent job. Finished school with good grades. I surrounded myself with people I love and I hung out in multiple large groups of tight friends. Arrogant but still easy going. Never a downer and always the life of a party. Always joking but still easy to talk to. Live quick die young attitude. Have been in pain every single moment since I was ten, nobody knew about that part of me. \n\n23 yrs old now. Cancer returned 10 months ago and it resulted in the amputation of my leg. I’m trying to learn how to walk. I’m on plenty of drugs to help me deal with the phantom limb pains. I was fired from my job because I can’t work. \n\n\n\"Why are you so cold?\", \"Why don't you open up?\", \"Why are you deflecting?\", \"Why do you never show a weak side of yourself?\", \"Why do you always try so hard at everything?\", \"Why is your guard always up?\", \"PLEASE...just let me in!\".....But this what you taught me, what you made me into? You used to shut me down when I tried to tell you. I desperately needed you, but you neglected me, you ignored me. YOU did this to me. That's what YOU forced me into. That's what you fucking wanted. Never be weak. Never cry. Never be emotional. Never complain. Never lose. Be the best at everything. Always be strong. Because that's what men do, and don't you ever forget it.\n\nWhen the pain won’t stop. When the misery won’t end. What do you do? I post here every now and again, I keep removing the posts because I’m too fucking ashamed. I didn’t do it, I couldn’t control it, but my weakness is shining through in every word. I could’ve been stronger. I don’t know why all of them love me so badly. I met my ex a year before recurrence, I’d been free of cancer for 6 years, I thought I was safe. I’ve heard her cry a few times, I didn’t know why she was crying. My heart was completely shattered when I realized it was because of what I’ve had to go through. Because of me. She cried for a solid 2 hrs when my cancer returned. Why did I do this to her? Why did I force my misery on her? Without me, she wouldn’t have had to see all of this. I broke up with her and ignored all contact. It isn’t fair. I wish I died when I was 15, when I got the initial diagnosis. I wouldn’t have had to endure so much pain, and I wouldn’t have been the cause of so much grief. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "cancer", "subreddit_id": "t5_2qixx", "subreddit_subscribers": 18761, "subreddit_type": "public", "thumbnail": "self", "title": "Why did it have to be so hard", "url": "https://www.reddit.com/r/cancer/comments/9vzpsn/why_did_it_have_to_be_so_hard/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1541631309, "domain": "self.cancer", "full_link": "https://www.reddit.com/r/cancer/comments/9v4cwe/how_do_i_survive/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9v4cwe", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "chat", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/cancer/comments/9v4cwe/how_do_i_survive/", "pinned": false, "pwls": 6, "retrieved_on": 1541631310, "score": 1, "selftext": "Sometimes I have the feeling that I’ve made it through. For a couple of years I was doing good, since then there’s only been the briefest moments of happiness. I’m quickly reminded of everything and I fall back into a pit of despair, I find myself unable to even begin the climb back. I have memories of hope, I cling to those memories, wishing I’ll some day make it back to being happy and hopeful. It’s becoming increasingly hard to remember what happiness feels like.\n\nMy friends have told me time and time again that I’m an inspiration. I’m so happy, so smart, so wise, at such a young age with so much misery in my past. I barely remember happiness, it’s easy to fake a smile and to fake feeling alright. I don’t really want to show them my true face, I don’t want to be a let down. I’d rather be miserable knowing my friends think highly of me than to drag them down with me. \n\nThe cancer hit me early. I was only 10 years old. The pain came out of nowhere. Years of disbelief, years of uncertainty, years of agonizing pain followed. Everyone thought I was lying. The tumor was found when I was 14 which explained the pain. Years of chemo, months of radiation therapy, too many surgeries to count. My friends had their first drinks, got in their first relationships, lost their virginities. I had my first experience with agony, was introduced to death, lost my childhood and in many ways my chances of a happy life. \n\nTreatment left me broken and bruised. With scars all over my body and what I initially thought was a fortified mind, I thought I had been saved. I didn’t know that the pain had only just begun. I’ve experienced so many late side effects, I’m not as clever as before, I can’t think as fast. I couldn’t run anymore, my foot was maimed. Each step more painful than the last, I was shattering bones by walking. \n\nI’ve seen a lot of misery in my life, but I’ve tried to be happy. I surround myself with good people. I try to be a good person, I want to inspire and motivate people. If they knew how I really felt, they’d look at me differently. I’ve seen it in peoples eyes so many times: there’s sorrow and pity, but for the most part they’re simply relieved that they haven’t had to see what I’ve seen. I need to show them that I can be happy, because then their eyes light up. I love it when their eyes light up, I’m reminded that happiness is possible. I need to show them that I can be happy after what I’ve seen because then their problems pale in comparison. If I could overcome a mountain, then they can overcome their hills. \n\nI met a beautiful woman. I didn’t have cancer for many years. We planned our future together. I didn’t think I was allowed to be happy. Everything I’ve ever loved, everything I’ve ever been good at has been ruthlessly stolen from me. I was good at sports, my foot was destroyed. I was smart, my mind was distorted. I was happy, and turned into a cynic. But she loved me, and I loved her. Life was bearable again. \n\nLike a dagger through my heart, ice throughout my body. Forever frozen. Everything I touch turn to stone. Hearing her cry for me. Because of me. Without me, they wouldn’t have to experience so much devastation. I have too many people that count on me. But her cry was the worst, my heart viciously destroyed, shattered into a million pieces. Because of me. My cancer returned and my leg was amputated. I’ve seen so much pain and misery, nothing compares with the devastation in knowing that I’m the reason that she cried. It was because of me. Next time it comes back, maybe I die? I broke up with her. I gave her some bullshit excuse. I love her more than I thought was possible. I miss her every day. I wish it didn’t have to be like this. I’d rather make her sad by breaking up with her than to start a life with her only to die before 30, leaving her behind.\n\nIt’s been 13 years of pain, but nobody prepared me for this. I’ve been close to death so many times, it still doesn’t compare. I’m 23 and I coped with dying 9 years ago. In many ways I wish I’d died back then, the grief wouldn’t have had to touch so many peoples lives if I’d died back then. I’m sorry for what I’m putting everyone through. \n\nI don’t know how coherent this is, english isn’t my first language. I just needed to get some things off my chest I think.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "cancer", "subreddit_id": "t5_2qixx", "subreddit_subscribers": 18695, "subreddit_type": "public", "thumbnail": "self", "title": "How do I survive", "url": "https://www.reddit.com/r/cancer/comments/9v4cwe/how_do_i_survive/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540934368, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ss712/dont_know_where_to_turn/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ss712", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9ss712/dont_know_where_to_turn/", "pinned": false, "pwls": 0, "retrieved_on": 1540934368, "score": 1, "selftext": "I’ve talked with many psychologists and therapists, but I don’t know, I don’t think it’s helping. I feel worse now. When I was repressing everything I didn’t feel this bad. But now I find it increasingly hard to feel good.\n\nI’m ruining relationships left and right, both romantic relationships and friendships. I struggle to trust people, I’m a compulsive liar, sometimes I manipulate people without even realizing I’m doing it. I don’t know how to become a better person.\n\nThe damage to me happened mainly when I was younger. It started when I was 10 years old when an unexplainable pain started growing in my foot. I went and saw a crazy amount of doctors but none of them could find anything wrong with me. The pain got worse and I started telling my friends and teachers that I was in too much pain to go outside and play, but I was met with disbelief, as if I was too lazy to go out and just wanted to stay inside. The doctors had said I was perfectly fine, and so the idea that I’d be in pain seemed very foreign to those around me. I was called a liar so many times. A couple years later I had to quit playing football as I was unable to run, which only made things worse. I was basically branded a liar by the entire football team. I suffered through ridicule and being called a liar, while being in constant, agonizing pain. In order to stop being called a liar, I became a liar. I started lying about the pain, I started hiding it to the best of my ability. I became very good at lying, and I realized that by not being honest, I could make my situation a lot better. And so I kept lying and got better at it each time I told a lie. Eventually I started lying about the most pointless things. I got so good at lying that I started to believe my own lies, was I really in pain? Had I been lying? Everyone else thought I was lying so maybe I was? Meanwhile the pain kept getting worse, but I couldn’t understand it.\n\nA couple of months before my 15th birthday a tumor was located in my foot. Based on tissue samples and size it was estimated that it had been growing for 5 years. I was diagnosed with cancer. I’ve lost count of how many times I’ve been close to death. I did a year of chemo, 6 weeks of radiation therapy and I’ve gone through 15+ surgeries. I was done with all of the treatment when I was 17. My foot was basically broken. I was breaking bones from walking. After a while we stopped xraying it, nothing could be done about the bones and I’d already been exposed to too much radiation.\n\nI was still good at lying. I did anything and everything to hide my disease, because what if people didn’t believe me? I started drinking to numb the pain. I pretended for so many years that everything was fine. The cancer returned last year and my leg had to be amputated.\n\nI’ve experienced chronic pain for 13 years now. My kidneys are close to failing. I’m only 23 man. I’ve spent so much time being afraid. Afraid of death, afraid of pain but mostly I’m afraid of disbelief. I don’t know how to open up to someone. I don’t know how to stop lying. I sometimes don’t even realize when I’m lying, the line between honesty and lies has been so incredibly blurred. I have no idea what to do to fix this.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 400667, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Don’t know where to turn", "url": "https://www.reddit.com/r/depression/comments/9ss712/dont_know_where_to_turn/", "whitelist_status": "no_ads", "wls": 0}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540829861, "domain": "self.cancer", "full_link": "https://www.reddit.com/r/cancer/comments/9seign/life_is_beautiful/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9seign", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/cancer/comments/9seign/life_is_beautiful/", "pinned": false, "pwls": 6, "retrieved_on": 1540829863, "score": 1, "selftext": "My cancer returned last year, when I was 22, I’m 23 now. I got the initial diagnosis when I was 14, I had symtoms since I was 10. The first symtom was pain, the tumor was located in my foot. Each step hurt worse than the last. My cancer is very hard to detect, and grows very slowly until it becomes aggressive. The aggressiveness is triggered by bones breaking or something like that near the tumor. I’ve done almost 20 surgeries and a couple years of treatment. Chemo, radiation therapy. When the cancer returned my leg had to be amputated (luckily no other treatment).\n\nInitially we didn’t really know my chances. As my cancer is hard to detect, it was virtually impossible to know whether it has spread or not. That’s probably why I had to do so much chemo and radiation therapy, but it feels like it happened a lifetime ago and I was only a kid so I don’t remember it all that well. The parts I remembered I’ve long since repressed. It took 4-5 years for the first tumor to be found, it took 7 years to find the new tumors, there could be many tumors throughout my body right now; no way to know for sure.\n\nI have been close to dying so many times now. Blood infections, normal infections, blood transfusions not working properly, during surgeries, from the chemo, and more reasons. I’ve been in pain for as long as I can remember. \n\nI’ve experienced so much misery. I still find it difficult to walk, and I’ve been unable to run for most of my life. My kidneys are shot. Most of the side-effects happened during chemo, the biggest late side-effect is PTSD. I was too young. My hair and my teeth still haven’t recovered. I’ve got chemo-brain and my mind has become terrible, I can’t remember things I most definitely should remember, and I can’t focus good at all. \n\nOne thing I’ve learned from this whole cancer thing is that your state of mind does matter. I’m not one of those hocus-pocus faith healing believers that’s going to try and tell you that positivity = being cured, but I firmly believe that positivity = a better life. \n\nI came to grips with the fact that I may not turn 15, and then 16, and then 17 etc. I came to grips with all that I lost, all of my hopes and dreams that were ruined, but that doesn’t mean I forgot to be positive. I came to grips with what I was dealing with, I acknowledged the problems, and then I put them to the side and made the most of what I had. It doesn’t matter if we have 100 years, 10 years, 1 year or 1 day left. We will all die eventually, the only thing that matters is what we do with whatever time we have left. \n\nNow, like I mentioned with the hocus-pocus faith healing, my positivity isn’t the reason why I’m still here today. My doctors, modern medicine and pure dumb luck is why I survived. But my positivity is most definitely why I’ve been able to enjoy life, through the surgeries, through the treatments, through the side-effects, and through the pain. Life is the only thing we really have, and I didn’t want to waste the only chance I’ll ever get at it.\n\nI was at a party two days ago, I went there with my best friend. There were pretty much only people from his college there so I didn’t know anyone at all. I wore jeans that revealed my ankles, so pretty much everyone saw that I had an amputated leg. Usually people don’t really know what to say/do, so at first it’s usually just an avoided subject. At 11pm my friend was passed out drunk (lightweight), and so I was pretty much alone. I proceeded to party with these people I had only just met. A drinking game was being played. The game is that a statement is made and people point their fingers to whoever they think the statement is the most true for, and you drink as many sips as there are fingers pointing at you. A statement was ”who has the smelliest feet”; to which I loudly and proudly proclaimed that ”It sure as hell can’t be me, I’ve got 50% less feet than all of you”, to which pretty much the entire room burst out laughing. My point with this story is that cancer, and pretty much all problems, don’t have to be sad. This horrible disease that has stolen so much from me doesn’t have to be what defines me. People will automatically put other people in boxes, that’s not something that’s bad, that’s just how it is. Cancer / other diseases / amputees will usually be put in the ”sad/pity” box, but it doesn’t have to be like that. You can make it alright, and you can even make it funny. You can choose to make the most out of it. \n\nI don’t know if this is any help to any of you, or if it just seems like ramblings. Either way, I hope everyone’s doing as good as possible. No matter what you’re going through right now, I wish you nothing but the best. Life with cancer doesn’t have to be a constant stream of sadness and anger, there’s a little bit of beauty in everything around us. Cancer has made what’s important a lot more obvious to me, and through it I’ve realized that even the briefest of moments can be filled with beauty. I’ve spent a lot of time and energy being angry at the world, it took me many years before I reached this mindset, I only wish I’d figured it out sooner. Everything in life isn’t beautiful, but a lot of it can be if you just want it to be. We’re only given one chance in this, don’t waste it!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "cancer", "subreddit_id": "t5_2qixx", "subreddit_subscribers": 18502, "subreddit_type": "public", "thumbnail": "self", "title": "Life is beautiful", "url": "https://www.reddit.com/r/cancer/comments/9seign/life_is_beautiful/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540343587, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qv5if/this_neverending_anger_is_consuming_me/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qv5if", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qv5if/this_neverending_anger_is_consuming_me/", "pinned": false, "pwls": 6, "retrieved_on": 1540343588, "score": 1, "selftext": "Hey. I don’t really know what to do. The situation I’ve found myself in is completely ridiculous. For many years it’s been getting worse each day. I’ve been sad a lot, but for the most part I’m just so incredibly angry. There’s no end to the sadness, the heartbreak, the pain and the anger. I never get to breathe, it always keeps accelerating. I’m angry with what I’ve had to go through, I’m angry with myself and I’m angry with the world.\n\nThe main feeling I’ve experienced in my life is pain. There’s been so much of it. I feel very numb because of it, physically aswell as mentally. The pain has been eating away at me with no mercy. Lately I’ve been getting fed up with it and honestly I have no idea what to do to get past it.\n\nThe pain started when I was very young, I hadn’t even turned 10 yet. It started in my foot. It grew constant within a couple of years. I’ve spent more than half of my life in agonizing pain, I can’t even remember a moment in which I wasn’t in pain. \n\nI slowly started to lose myself. I was a very active kid, but the pain wouldn’t allow me to stay that way. I lost the ability to run, even walking became struggle. After school and work I’d only sleep, I’m always tired because the pain completely drains me of all my energy.\n\nI saw so many doctors. They didn’t have an explanation for me until I was 14, when the tumor was found. It had been growing inside my right foot for more than 5 years. It turned out to be cancer. I went through chemo, radiation therapy and multiple surgeries, and at age 16 I was a cancer survivor. I was completely cured, the problem was that I was worse off because of it.\n\nMy problems and the pain intensified due to the extreme treatment I went through. My hair barely grows anymore. Most of my organs are permanentally damaged. My right leg was 5 inches shorter than my left leg. My right foot was 3 shoe sizes smaller than my left foot. My right foot was as stiff as a brick, I haven’t been able to move my toes at all since before the treatment. I was in a wheel chair for about a year, and then I had to learn how to walk again. It felt as if I was breaking bones just from walking, it turned out that I was. After about a year of constantly going to the doctor to see if yet another bone was broken there just wasn’t any point in getting more xrays. I’d already been exposed to so much radiation that the xrays were doing more harm than good. Nothing could be done about the broken bones either way, so I stopped getting xrays and I continued shattering bones in my foot.\n\nThroughout my life I’ve had to endure excruciating pain. It never stops. I don’t know why I’ve had to go through this. I was robbed of my childhood and I was stripped of any chances of a normal life. I try to cope with the situation, but it’s hard. The pain doesn’t stop. It’s just getting worse.\n\nI worked at my last job for almost 3 years. The pay was alright, but I was working myself to death. During the weekends all I did was get drunk so that I could make the pain go away. During the weekdays all I did was work, I didn’t have any strength left in my body after work so all I did was sleep. Most of the time I slept for 13-14 hours, the longest I’ve slept is 18 hours. I didn’t have a full time job, I didn’t have a week to week schedule at all, I only worked when I was called in to work. I was pretty solid at what I did so they needed me pretty often, I worked 5/6 days every week, so despite not having a permanent position I was working full time hours. When my cancer came back last year I was let go from work. As my position wasn’t permanent they had no obligations to keep me around. My leg had to be amputated.\n\nI’ve been lucky in that I’ve had some girlfriends, I have no idea what they saw in me though. I guess that could be why it didn’t work out with any of them, I’m probably very depressing to be around. I can’t really show any emotions, I haven’t cried since I was 15. When I was 14 and I got the news that I had cancer, it was me, my mom and the doctor in the room. I had to watch as my mom cried, I comforted her. It hurt like hell to watch her like that. In that moment I swore to never again be the cause of her sadness. I had a girl when my cancer came back, hearing her cry like she did is the worst thing I’ve gone through in my entire life. I had to break up with her. My life isn’t normal, and around every corner there’s a new heartbreak. I didn’t think it was fair to put her through it all. I still love her, and I still miss her. It took my cancer 7 years to return. What if I start a life with her. I could be 30 when the cancer returns and claims my life, it’s not fair to force her to see that. Fuck man. \n\nI’m 23 years old with a high school degree. I haven’t gone to university / college because I’ve got problems focusing because of my chemo-brain. I was let go because of cancer, but even if I had kept the job I wouldn’t have been able to do it because I’m down a leg. I don’t have a job, I’m always in pain, I can’t focus and I have absolutely no idea what I’m going to do. I don’t know why I have to go through this, I really don’t. I don’t know why it has to be so hard. I don’t care about being rich / poor. I don’t care about having few / many friends. I don’t care about liking / disliking a job. I don’t really care about anything. I just don’t want to be in pain anymore. I wish I never had cancer. I want to have a normal life. I miss sports so fucking much. Why does it have to be like this.\n\nI can’t run. My kidneys are close to failing. The phantom limb pains are very intense, which means loads of pills. Loads of pills mean no alcohol, and no alcohol means I can’t make myself numb. I’ve been close to death more times than I can count. I struggle with feeling unattractive. I’m unable to have kids. I feel disconnected from the world, like nobody understand me. I’ve lost a leg. I’m always, always in pain. Every single problem I have in life came out of cancer. Some probelms didn’t come directly out of cancer, but they’re all side-effects of it. Cancer has shaped me into the person that I am today. I’m not suicidal, I wouldn’t put my family through something like that. My family and my friends are the only reason why I’m still here, I would’ve offed myself many years ago if it weren’t for them. I wish that the cancer had killed me instead. I hate myself and I hate my life, and there’s nothing I can do to fix it. I wish it didn’t have to be like this.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398575, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "This neverending anger is consuming me", "url": "https://www.reddit.com/r/depression/comments/9qv5if/this_neverending_anger_is_consuming_me/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "can_mod_post": false, "contest_mode": false, "created_utc": 1539595390, "domain": "self.addiction", "full_link": "https://www.reddit.com/r/addiction/comments/9ob4ar/oxycontin/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ob4ar", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 6, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/addiction/comments/9ob4ar/oxycontin/", "pinned": false, "pwls": 6, "retrieved_on": 1539595390, "score": 1, "selftext": "Hey. I’m only 23 and I’ve been battling with addiction since I was 14. I’ve been experiencing chronic pain since I was around 10. I got the cancer diagnosis at 14. After the first surgery is when I had my first experience with drugs, and it was Oxy. Oxy let me breathe for the first time in many years, and so I was pretty much instantly hooked. \n\nThe cancer treatment lasted for about 2 years, I had Oxy the entire time so I grew pretty attached to it, as you can probably imagine. I was weened off it and I thought I was doing alright. \n\nI didn’t do Oxy for many years, instead I searched for other ways to get closer to that feeling. Weed, cocaine, alcohol, nicotine, anything and everything to try and get there. The pain never stopped, the tumor had been in my foot so I was even worse off after treatment. It was always pain. After a couple years I was put on citodone, which I took plenty of. It never helped with the pain, and I couldn’t really get any sensations from it, so I just quit after a while.\n\nI think my main addiction has been Oxy, despite of the fact that I’ve mainly been getting drunk. Oxy is harder to get. Atleast, that’s until last year. My cancer returned and my leg was amputated. An endless stream of Oxy followed. It’s been half a year since the amputation, I’m still very much hooked on it. I also take an anti-depressant and gabapentin, both to deal with the phantom limb pains. I’ve been trying to get off Oxy but I’m struggling with the withdrawals. It feels like the craziest flu. Can’t sleep at night, despite being so incredibly tired. When I do get to sleep I always have constant nightmares, I’m pretty sure I’ve got PTSD from being so young with cancer, although the nightmares and the PTSD is like that when I’m on Oxy aswell so I guess that’s besides the point. \n\nI don’t know man. I need to get off Oxy and get back into my life. The withdrawals are killing me, I’m scared I’ll do more. How do you stay off it when it feels like it’s the only way for you to rest? How do you stay off it when it’s the only happy place you have, as the rest of your life’s a horrible mess? I don’t know. In many ways it feels like Oxy has been my only friend through this. It lets me get away for a few. When I’m sober I don’t really have any feelings. I don’t feel sad, I don’t feel depressed, I just don’t really feel anything. It’s like I’m numb. Like now, it doesn’t even feel like I’m talking about myself. These things don’t even seem like reality. It feels like I’m describing somebody else. With Oxy I can be happy/sad/angry and even feel love. It’s hard. Advice would be much appreciated.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "addiction", "subreddit_id": "t5_2qwvc", "subreddit_subscribers": 13369, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Oxycontin", "url": "https://www.reddit.com/r/addiction/comments/9ob4ar/oxycontin/", "whitelist_status": "all_ads", "wls": 6}, {"author": "throwaway72108", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2eo7v8rc", "can_mod_post": false, "contest_mode": false, "created_utc": 1539585244, "domain": "self.sad", "full_link": "https://www.reddit.com/r/sad/comments/9oa9x0/its_gone_too_far/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9oa9x0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/sad/comments/9oa9x0/its_gone_too_far/", "pinned": false, "retrieved_on": 1539585244, "score": 1, "selftext": "When I ran around the playground as a kid, I was happy. \n\nWhen the pain started, I was happy. \n\nWhen I couldn’t run anymore, I was happy. \n\nAfter many years of pain, after not being able to walk; I still found happiness.\n\nI’ve always been surrounded by friends and family. I’ve been able to find happiness despite the pain, because I’ve always had people that love and support me.\n\nWhen the pain was explained, when the answer was cancer, I was happy.\n\nWhen the chemo started, when the world changed, I was happy. \n\nWhen I lost my hair, when I couldn’t hold down any food, I was happy. \n\nWhen I was 15 and battling cancer, when I had spent one third of my life in pain; I still found happiness.\n\nMy friends would play video games with me online as I was miles and miles apart from them. My family would stay with me. I’ve always had them. I still found happiness, because my mindset has always been ”it’s better me, than anyone of them”. \n\nWhen the radiation therapy started, when the surgeries became too many to count, I was still happy. \n\nWhen I spent months in a wheelchair, when I’d lost 50% of my weight, I was still happy. \n\nWhen I was 16 and had finished treatment, when the pain still hadn’t left, I was happy. \n\nWhen I was 18 and as recovered as I’d be able to get, when I realized I’d never be able to run or play sports again...I cried. But the next day I found happiness once more.\n\nI didn’t have to see my friends go through this horrible disease. I didn’t have to see my family go through it either. I was the one that for some reason was chosen, and for this I was always happy.\n\nWhen one of my distant relatives was diagnosed, I was still happy.\n\nWhen one of my closest friends sister was diagnosed, I was still happy.\n\nWhen one of my closest friends mother was diagnosed, I was still happy.\n\nI had survived, and I thought that they could aswell. When I was 20 and I’d spent half my life in pain. One after the other, they all died. When the pain of dealing with their loss was infinitely worse than the physical pain I’d experienced...but I somehow still found happiness.\n\nI turned to alcohol and drugs to cloud the pain, I was somehow happy again.\n\nMy friends and family pulled me through, I was somehow happy again. \n\nThe loss wouldn’t be forgotten, but I was somehow happy again. \n\nThe physical pain, the mental strain. I don’t know how; but I found happiness. \n\nWhen I met the girl of my dreams, I was happy. \n\nWhen I got a good job, I was happy.\n\nWhen I wanted to go back to school and had figured out what I wanted to study, I was happy.\n\nThe pain was always there, the memories would never be forgotten, but my life had to continue and I had found happiness.\n\nI had to watch as my friends and family dealt with losing their loved ones. It was the hardest thing I’d done in my life, despite not really knowing the other people battling cancer. I had a hard time dealing with it, but after everything I was still happy.\n\nWhen the cancer returned, and I broke up with my girl to prevent her from watching me deteriorate, I was hurt but still happy.\n\nWhen my mother and father couldn’t hold back their tears, I was hurt but still happy.\n\nWhen my leg was amputated to prevent the cancer from spreading, I was hurt but still happy. \n\nIt still wasn’t my friends, it still wasn’t my family. They didn’t have to die. I was happy to be the chosen one once more, because I was sure that they wouldn’t die. \n\nWhen I figured out how to walk again, I was happy.\n\nWhen the pain was disappearing, I was happy. \n\nWhen the phantom limb pains grew less frequent, I was happy.\n\nWhen I figured out I was able to run again, something I hadn’t done for 13 long years, I found happiness like I’d never experienced it  before. \n\nMy story was over. It had finally come to an end. I run, I walk, I know what I want to do in the future. I’ve had happiness along the way, but nothing like this. For the first time in 13 years, it was over, and my life could return to normal. \n\nBut when my best friend got diagnosed. There was nothing but pain and sadness.\n\nWhen the cancer was in his lounges, in his throat, in his groin and surrounding his spine. There was nothing but pain and sadness.\n\nHe’s growing weak and frail, like I did. He’s still got hope but I can see it slipping away from him. His diagnosis is more similar to those who die than to those who survive, and there is NOTHING but pain and sadness. \n\nHe’s done with the first cycles of chemo, he’s already done so many surgeries. If I lose him, I don’t know if I’ll survive the heartbreak. I don’t know why my life has to look like this. Why my entire life has to be surrounded by this disease. When it was me, I could be happy. I’d go through my treatment, and I’d die for my friend thousands of times, if that meant that he wouldn’t have to do this. I can’t take it anymore. There is no way out. I was too young to go through pain. I was too young to go through cancer. I was too young to watch all of them go. He’s too young to get cancer. We’re all too young. Fuck this horrible, horrible disease. There will never be happiness again, there’s only sadness. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "sad", "subreddit_id": "t5_2qhja", "subreddit_subscribers": 18729, "subreddit_type": "public", "thumbnail": "self", "title": "It’s gone too far.", "url": "https://www.reddit.com/r/sad/comments/9oa9x0/its_gone_too_far/"}]}