{"data": [{"author": "tiktaalik-", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2gi8958w", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540331486, "domain": "self.bipolar", "full_link": "https://www.reddit.com/r/bipolar/comments/9qtj1z/i_need_someone_or_give_me_advice_to_calm_me_down/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qtj1z", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_template_id": "4a177c88-9c24-11e1-bcb4-12313b08a441", "link_flair_text": "Discussion Starter", "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/bipolar/comments/9qtj1z/i_need_someone_or_give_me_advice_to_calm_me_down/", "pinned": false, "pwls": 6, "retrieved_on": 1540331488, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "bipolar", "subreddit_id": "t5_2qnv4", "subreddit_subscribers": 53727, "subreddit_type": "public", "thumbnail": "self", "title": "I need someone or give me advice to calm me down because I’m pissed", "url": "https://www.reddit.com/r/bipolar/comments/9qtj1z/i_need_someone_or_give_me_advice_to_calm_me_down/", "whitelist_status": "all_ads", "wls": 6}, {"author": "tiktaalik-", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2gi8958w", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540226961, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9qfm8z/hey_i_dont_frequent_this_subreddit_or_reddit_in/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qfm8z", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9qfm8z/hey_i_dont_frequent_this_subreddit_or_reddit_in/", "pinned": false, "pwls": 6, "retrieved_on": 1540226963, "score": 1, "selftext": "I’m only including my story as a way to set the tone and environment to maybe relate to some of you guys. My story can honestly be skipped over if you don’t have an interest. Really, my main goal here is to read your guys’ replies and see if I could maybe help in even the slightest way. I have been in an incredibly dark place, and I want to see if (now that it’s become more manageable) I could do anything to help the community I’ve been a part of for a few years.\n\nMy story:\nI’m 21 now, and I had suffered from what I believed to be major depression for the past three years or so. I had tried many SSRIs over that time to no avail. I’m in college and, in those three years, I fucked up and had to withdraw from two semesters and I took one off thinking that it would give me the time I needed to get better. I was very suicidal and had made two attempts at it. I have always had close friends and a good family, but I constantly felt alone. I lacked the motivation to get out of bed and do work, I slept more than 12 hours every day, I lost 15lb (and I was and am a pretty thin guy) in that time, and I’d isolate myself only seeing my roommate for weeks at a time. My family and friends saw just how bad things were getting, and they tried their best to give me help. Therapy proved to be utterly useless (as I’m sure it is to many of you). I even managed to weasel my way out of being hospitalized many times because I thought that forced isolation from those I knew would only exacerbate everything.\n\nI guess my family had repressed their mental illness for years until they got naturally kind of better after decades — my father still refuses to tell me about his life from his early twenties to his mid-thirties. It turns out that my paternal side of the family has a long history of undiagnosed bipolar. It wasn’t until early this year did my mania start to develop. Only once that started to evolve and show its face as a genuine tell to my problem did I start getting useful help. I’ve been receiving effective medication as of midway through this summer. I have my depression well-managed as of right now, and I haven’t suffered from a debilitating episode in months. I still get days where I feel unmotivated to do anything, but they pass in a day or so. While my mania isn’t properly treated, living through long periods of a lightened mood, being overly energetic (in a bad way), and many sleepless nights, I have not felt this in-control with my mind in years. I am diagnosed with bipolar I (meaning that my manic episodes are more intense than those with BP1) and I may have been up for more than two days straight at this point, but I’d take this any day over the depression.\n\nI really don’t want to give off that cliché of “it gets better” like it’s curable, but it can get manageable and that’s why I’m here. I’m not here as a “success story” because it’s really not. I never triumphed — and never will — over it; I still get deeply disheartened and feel like garbage when I think too deeply about how, without my medication, I would have likely killed myself by this point: I decided in January that I would if I didn’t get better this semester, and I know that I would have. I’m a chemist who works in a research lab with too many options for an easy-way out. To elaborate further on why I get disheartened, it’s comes during those sobering moments when I contemplate how I would be hopeless in overcoming this without psychiatric help by any way of personal means (exercising, “going out in the world,” introspection, eating healthy, etc.). But, like I said, my story isn’t one of success; I see it more aptly described as a survival story as I’m sure you would if (once) you get in a better place. Okay, that’s all I really wanted to say about myself.\n\nWhy I’m actually here:\nI want to hear your story. Whether you’re hitting rock-bottom and at your wit’s end, you’re surely and quickly declining, you’re on the path to getting effective treatment, or if you’ve overcome the odds and temptations and are in a better place; what matters to me is you at this point. I hope that you feel comfortable enough to open up to me. I’ll try to reply as soon as I can to each and every one of you, that’s a promise. I will be putting down my phone and taking my antipsychotic to force myself to sleep in a minute, so I won’t be replying for some time though. I only have mad love for you guys.\n\nAll the best from ya boy,\nTiktaalik-", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 398337, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Hey. I don’t frequent this subreddit (or reddit in general), but I wanted to share my story briefly and — more importantly — see how you guys are doing", "url": "https://www.reddit.com/r/depression/comments/9qfm8z/hey_i_dont_frequent_this_subreddit_or_reddit_in/", "whitelist_status": "all_ads", "wls": 6}]}