{"data": [{"author": "traveller3999", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2fih4286", "can_mod_post": false, "contest_mode": false, "created_utc": 1539816849, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9p3j2r/i_am_borderline_and_i_recently_found_out_that_my/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9p3j2r", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9p3j2r/i_am_borderline_and_i_recently_found_out_that_my/", "pinned": false, "pwls": 6, "retrieved_on": 1539816850, "score": 1, "selftext": "So I was diagnosed with borderline personality disorder in my 21+ as after I got dumped by a girl I was with for over 2 years, and very close friend of mine of almost 10 years and the same time I was probably in lowest and weakest state of mind in my enitre life. \n\nAfter I decided on checking with professionalist what's up with me during aforementioned low I got dagnosied with borderline and found that my abandonment issues comes from my childhood relation with my parents (which is really good right now, thanks god) and impacted my in the ways I didn't even imagined.\n\nBut all of it happened long after I already lost the only person I ever truly trusted and which made me feel secure for the only time in my life. And I never really got over it as it was my fault that actually managed to fuck it up even though she was the only person my life that actually tried and endured inconceivable amount of all sort of shit coming from me. But everyone has their limits and I went passed her. After I was told that lot of my behaviour was triggered by borderline it made just a little easier for me to accept that mayby I wasn't just so terrible person afterall. Because that's how I felt directly loosing her - I couldn't comprehend how much extremely terrible things I did to someone I truly loved and cared about and yet still did anyways. And even though I was always pretty self-conscious of that evene during my relationship with her I didn't really changed it.\n\nJumping forward few years later I am where I am, still feeling about her way I did when we started dating 6 years ago. And even though I tried to convince myself that letting myself get close to someone new I never really managed to trust anyone else. And I definitely have at least few people in my life that know about me and how I feel and would like to help me I know that they just can't. That no one really can. Everyone seems to think that time and occupying your mind is everything that person need to feel better after some traumatic event/s but that's not my own expierence at all. I feel they way I feel for most of my life as I am 24 and time was never really a healer. Because how is time suppose to help me If what I feel is constant anxiety and fear of abandoment that comes from my mind and my past. I feel like \"normal\" people live day by day while I am stuck in the same place in my mind for past a decade and with short exceptions like those few years spent with her and short episodes of general improvement I amjust bouncing between feeling fear, anger and overwhelming sadness over and over again.\n\nAnd now, just few days earlier I found out that she is getting married. And even though I lost her long time ago and she cut all her ties with me like I never existed, I truly tried to accept it as I tried to convince myself that is a choice that everyone should be able to make. But it got worse. So much worse. I don't think I ever was so violatile with my feelings. I can cry I can laugh and I can be on the verge of punching someone that's just looking at my slightly wrong, all of it in 5 minutes span. I had my fourth panic attack just today during a lecture. I can barely focus at work. Being almost complete nosmoker my entire life I am finishing my second pack of ciggaretes in 4 days and worst part is that it actually makes me calmer just for this minute or two so I am going to this.\n\nAnd worst part is - all of it is iniated by something that should not matter to me. I shouldn't be so concerned about someone from my life getting their life together and yet I am. I am afraid that this is how I am going to be my entire life. And I long for someone to just look in me in the eye and hold me when I'm feeling like this but I can't. I can't go past the feeling that it's all just going to end up the same way and that it is safer for me to just go continue on my own and not depend on someone that might let me down.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 397217, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I am borderline and I recently found out that my ex-girlfriend, whom I never stopped loving after almost 4 years is getting married.", "url": "https://www.reddit.com/r/depression/comments/9p3j2r/i_am_borderline_and_i_recently_found_out_that_my/", "whitelist_status": "all_ads", "wls": 6}]}