{"data": [{"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1542089535, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9wmi8i/i_cant_bear_it_anymore/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9wmi8i", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/depression/comments/9wmi8i/i_cant_bear_it_anymore/", "pinned": false, "pwls": 0, "retrieved_on": 1542089536, "score": 1, "selftext": "Ever since my girlfriend broke up with me 5 months ago my life has been a living hell. I plunged into a severe depression so I quickly looked for professional help. So far I have been diagnosed with acute and dysthymic depression, anxiety disorder and a personality disorder, probably an attachment disorder.\n\nI tried everything to become better. I reached out to friends and family, got my own place, tried picking up new hobbies. I'm also in therapy and got meds. Despite all that, nothing helps. I miss my ex so much. I have nothing but love to give her. I'm probably obsessed over her, but I can't change how I feel. I even tried to be rational about it and tried dating. I had succes with it... so I know I'm attractive for and wanted by other girls, but I don't feel anything for them. I only love my ex. In the past months those feelings haven't changed at all.\n\nI had contact with her because we wanted to be friends. We also had a 2,5 month no contact period. Though I screwed up when we had contact again for a month or so by sending her emotional messages a few times. I realise my mistakes and I really mean well with all my heart, but no one believes me. Everyone treats me as if I'm crazy.\n\nIt's not just about her. My whole life I've had troubles. Now I just feel locked in my body. I can't deal with anything anymore. And the thought of not being with her hurts so much. Aside from the mental pain, my body hurts as well. My heart hurts, my head hurts, I feel weak and sick, I have trouble breathing. I feel like I'm gonna die soon. And to be honest it would be a relief. I already attempted suicide multiple times in the past months, but obviously it wasn't succesful. Of course, I don't really want to die. I want a happy life, but the only way to have that is with my ex. Though I know I can't force her or put such pressure on her. However, it's the only way. I just can't go on like this. I welcome death, because suffering like this every day has become too much.\n\nI hate myself for not being strong enough or healthy enough to deal with it. I hate myself for causing pain and stress to others. I am just desperate... and hopeless. I wish I could get her out of my head, but I just can't. All the memories with her are so vivid and keep replaying in my head no matter what I do. I just can't take it anymore...\n\nSorry for the rant...", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 405199, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I can't bear it anymore", "url": "https://www.reddit.com/r/depression/comments/9wmi8i/i_cant_bear_it_anymore/", "whitelist_status": "no_ads", "wls": 0}, {"author": "UnfoundHound", "author_flair_background_color": "", "author_flair_css_class": "modmsg", "author_flair_richtext": [], "author_flair_template_id": "", "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_zfey4", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540974305, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9swuaq/its_always_their_way/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9swuaq", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9swuaq/its_always_their_way/", "pinned": false, "pwls": 0, "retrieved_on": 1540974306, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 107071, "subreddit_type": "public", "thumbnail": "self", "title": "It's always their way...", "url": "https://www.reddit.com/r/SuicideWatch/comments/9swuaq/its_always_their_way/", "whitelist_status": "no_ads", "wls": 0}, {"author": "UnfoundHound", "author_flair_background_color": "", "author_flair_css_class": "modmsg", "author_flair_richtext": [], "author_flair_template_id": "", "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "author_fullname": "t2_zfey4", "author_patreon_flair": false, "can_mod_post": false, "contest_mode": false, "created_utc": 1540377031, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9qyfc7/killing_myself_today/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9qyfc7", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9qyfc7/killing_myself_today/", "pinned": false, "pwls": 0, "retrieved_on": 1540377033, "score": 1, "selftext": "I just screwed up so bad. I love my ex and now I ruined every chance with her. Today I'm killing myself", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 106201, "subreddit_type": "public", "thumbnail": "self", "title": "Killing myself today", "url": "https://www.reddit.com/r/SuicideWatch/comments/9qyfc7/killing_myself_today/", "whitelist_status": "no_ads", "wls": 0}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1538422178, "domain": "self.ExNoContact", "full_link": "https://www.reddit.com/r/ExNoContact/comments/9kjhyd/i_broke_no_contact_im_probably_stupid/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9kjhyd", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/ExNoContact/comments/9kjhyd/i_broke_no_contact_im_probably_stupid/", "pinned": false, "pwls": 1, "retrieved_on": 1538422178, "score": 1, "selftext": "My ex broke up with me 4 months ago after an intense almost 3 year relationship. We both want to be friends and we stayed in contact for 1.5 months after the break-up. I then cracked and called her up emotionally. She told me to take some time for myself and so I did. It has been an awful 2,5 months. I am depressed, my study and work are on hold, I'm seeing a psychiatrist and I'm on meds.\n\nI know I am not in the right state to contact her, but at this point it doesn't even matter anymore. I still love her deeply, I still miss her a lot, I still feel like it was all a mistake, and I still want her back. Though she is leaving in March. So I don't have much time to establish something with her, even a friendship. I've talked to countless of people, even relationship experts. Most people told me to cut her out of my life, but I just can't. I have to try. Even if it takes years. It will probably cost me my own sanity if I haven't lost that already. I'm probably really stupid, but at this point I'm so numb and tired of life that I can hardly care anymore. I have nothing to lose.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "ExNoContact", "subreddit_id": "t5_319jr", "subreddit_subscribers": 27211, "subreddit_type": "public", "thumbnail": "self", "title": "I broke no contact. I'm probably stupid.", "url": "https://www.reddit.com/r/ExNoContact/comments/9kjhyd/i_broke_no_contact_im_probably_stupid/", "whitelist_status": "house_only", "wls": 1}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537716162, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9i956c/starving_myself_to_death/", "id": "9i956c", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9i956c/starving_myself_to_death/", "pinned": false, "pwls": 0, "retrieved_on": 1537716163, "score": 1, "selftext": "I'm 24yo and I have been suffering from depression since I was a kid. I'm seeing a psych and I'm on meds since a week. I probably have bipolar disorder and Adult Attachment Disorder. As a result of this, since it affects my behaviour, my gf of almost 3 years left me 3,5 months ago. She wants be friends, but 2 months ago I called her up emotionally asking to talk about the relationship. She refused and told me to take some months for myself. It has only gotten worse since then.\n\nI desperately need to see her and tell her that my behaviour was due to my mental illness, something neither of us knew back then. I could call her but I fear that I'll scare her away for good. I don't want to emotionally blackmail her either. I just see no way out as my life is not worth living. So now I'm starving myself to death. I haven't eaten anything since friday evening and barely drank any water since yesterday night. It should only take a few more days.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 102721, "subreddit_type": "public", "thumbnail": "self", "title": "Starving myself to death", "url": "https://www.reddit.com/r/SuicideWatch/comments/9i956c/starving_myself_to_death/", "whitelist_status": "no_ads", "wls": 0}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537612005, "domain": "self.SuicideWatch", "full_link": "https://www.reddit.com/r/SuicideWatch/comments/9hyphc/the_thoughts_never_stop_only_if_i_end_it/", "id": "9hyphc", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "no_ads", "permalink": "/r/SuicideWatch/comments/9hyphc/the_thoughts_never_stop_only_if_i_end_it/", "pinned": false, "pwls": 0, "retrieved_on": 1537612005, "score": 1, "selftext": "I'm a 24yo guy and I have been depressed since I was a kid. The past 3 years were the best of my life thanks to a wonderful GF I had. Yes, had. She broke up with me 3,5 months ago. It was because of my behaviour which I could not explain or get a grip on. I've plunged into the deepest depression I've ever been in. I don't want to do anything. I don't want to eat. I don't want to drink. I just want her back and make things right. She is still my friend, but the last time I spoke to her was over the phone and I was all emotional, asking her to talk about the relationship. She didn't want to and told me to take some months for myself.\n\nIt has been 2 months now since that phone call and it has been complete radio silence, but my feelings for her haven't changed. Barely anything has changed. I still can't work. I can't study. I can't really eat or drink. \n\nIt has been constant ups and downs. I sometimes feel pretty neutral for a few days, allowing me to somewhat function. Though I constantly fall back into a severe depressive state, lasting for days if not weeks. Though life goes on. I feel the pressure of responsibilities. Everyone else is doing their things so I must too I keep thinking. I have to be just as good or even better than them. I have to do this and that, but I simply can't.\n\nI have a dad, a brother and a grandma who care about me. I have some friends who check in on me. Though however kind their words are, however uplifting they try to be, it just doesn't work. Sometimes I have a tiny bit of hope that my ex will come back, that it's not all over, but that hope often quickly fades as it is probably false hope. I can't live on kind words and false hopes. \n\nI need her. I consider her the love of my life. While I know there are probably girls out there who will fit me just as well or even better, they're out there and not here with me. I don't have the will anymore to look when I already found the girl I want to be with.\n\nI actually went on a few Tinder dates, but they are all not like her. I'm not attractred to them. Of course, I'm not looking for a clone, but they don't even come close to type of girl I want. Yesterday I actually went on a date with a girl who was really nice, but just doesn't seem to be my type. I also don't feel attractive myself. I try to be nice, happy, and funny like I used to be, but I just can't. I'm dying on the inside.\n\nI am seeing a psychistrist, but I still have to do my first session. I did get meds. An anti-depressent which will take months to even work. Also a calming med that helps me sleep. Speaking of which, sleep is my only escape. Though it goes by too fast. I wish I never wake up, because every time I wake up it is without my ex.\n\nAs of now I'm diagnosed with acute severe depression. I also likely have bipolar disorder, anxiety disorder and a personality disorder, probably Adult Attachment Disorder. It would explain my odd and distant behaviour towards my GF back then. I really want to tell my ex. I'm in fact desperate to tell her, because she is my only hope. I hope she will give me one last chance to show her that I'm not the guy she left. Though I know that that is very unlikely to happen. I can text and call her, but I'm scared she'll refuse to meet me again and cut me out of her life for good. Even if she meets me she'll realise that I need her or I'll commit suicide. I don't want to put that huge pressure on her, but it's the truth and she has to know how serious I am. I feel bad for even thinking about it...\n\nSo right now I'm just stuck. I want to die, but I also want to live. I want to live happily with my ex, but not alone. I fear I'll end up alone or just with some girl I can never love as much as my ex. I keep thinking of how to do it. Cutting my wrists seems the easiest. I also thought of electrocuting myself or jumping in front of a train. Though I'm too much of a coward to do it. I seem to cling to that tiny bit of hope that my ex will come back. Who knows, maybe I'll be dead tonight.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "SuicideWatch", "subreddit_id": "t5_2qpzs", "subreddit_subscribers": 102496, "subreddit_type": "public", "thumbnail": "self", "title": "The thoughts never stop. Only if I end it.", "url": "https://www.reddit.com/r/SuicideWatch/comments/9hyphc/the_thoughts_never_stop_only_if_i_end_it/", "whitelist_status": "no_ads", "wls": 0}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537327498, "domain": "self.travel", "full_link": "https://www.reddit.com/r/travel/comments/9h1o8n/i_want_to_travel_but_im_incredibly_scared_to_go/", "id": "9h1o8n", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 18, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/travel/comments/9h1o8n/i_want_to_travel_but_im_incredibly_scared_to_go/", "pinned": false, "pwls": 6, "retrieved_on": 1537327499, "score": 1, "selftext": "I'm a 24yo guy from the Netherlands and I have never really travelled, only short vacations and never outside Europe. I do wanna travel however and visit all these amazing places.\n\nAbout 3 years ago I met a girl and we always dreamt of travelling together, but we first had to get our lives a bit in order. She had to move to my country first for us to be together. Before she came here she already travelled solo through Scotland for a week or so and then went to Australia with her sister for 3 months. When she finally came here things didn't go as planned. I behaved in ways I couldn't explain and she eventually broke up with me. Now she still works here but plans on travelling in a few months.\n\nI always thought I'd be travelling with her. That we would go on these amazing journeys together, but now that she is gone I don't know what to do. I'm incredibly scared to travel alone and can't see myself doing it; while my ex is so brave and just seems to do it like it's nothing, and she's only 19.\n\nI plunged into a severe depression due to break up. Though I have been pretty depressed since I was a kid and have also been suffering from anxiety (I had a traumatic childhood). I just started therapy and got meds. Besides depression and anxiety they think I have a personality disorder. This will also likely explain my behaviour that caused the break up. Though I just can't imagine travelling alone. I'd be so scared to travel to a strange place, meet strangers and do strange new things. I fear I would just break down and panic, and then flee back home.\n\nI always remember this quote from the movie Into the Wild: \"Happiness is only real when shared.\". So I always thought I'd travel with my ex and I would never have to travel alone, and that would make me happy. Though now I'm without her. I'm lost. I want her back so bad and travel the world with her, but I don't think that will happen anymore. I just spoke to her sister and she is still travelling in Australia and now met a guy there. I fear my ex will also travel, meet a guy there and just never return. I'll be stuck here. I'm already 24 and I feel like a coward, a scared little kid that needs someone to take him by the hand. I'm already scared living life alone. Though when I was with my ex I thought I could take on the whole world... Now I'm nothing... What can I do?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "travel", "subreddit_id": "t5_2qh41", "subreddit_subscribers": 1456800, "subreddit_type": "public", "thumbnail": "self", "title": "I want to travel, but I'm incredibly scared to go alone.", "url": "https://www.reddit.com/r/travel/comments/9h1o8n/i_want_to_travel_but_im_incredibly_scared_to_go/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537247549, "domain": "self.MeetPeople", "full_link": "https://www.reddit.com/r/MeetPeople/comments/9grxwe/friendshiprelationshipchat_24m_from_the/", "id": "9grxwe", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "permalink": "/r/MeetPeople/comments/9grxwe/friendshiprelationshipchat_24m_from_the/", "pinned": false, "retrieved_on": 1537247549, "score": 1, "selftext": "So I'm 24yo guy from the Netherlands looking to chat with and meet new people. I'm generally a funny guy, very much into (dank) memes, drawing, movies/series, sports, games, and a bit of reading. I like to travel or just explore, stroll around, sit at a cafe or restaurant, that kind of stuff.\n\nI currently study Public Administration. So I know my fair share about politics, history and economics. I'm also into psychology which I'm considering studying next. \n\nI enjoy deep meaningful conversations about almost anything.\n\nFor any females reading this: I'm always told I'm pretty handsome, but sadly I'm an introvert x)\n\nIf you're interestered PM me!", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "MeetPeople", "subreddit_id": "t5_2t4pz", "subreddit_subscribers": 6707, "subreddit_type": "public", "thumbnail": "self", "title": "[Friendship][Relationship][Chat] 24M from the Netherlands", "url": "https://www.reddit.com/r/MeetPeople/comments/9grxwe/friendshiprelationshipchat_24m_from_the/"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537239916, "domain": "self.Advice", "full_link": "https://www.reddit.com/r/Advice/comments/9gr3oh/i_recently_discovered_my_babysitter_from_my/", "id": "9gr3oh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Advice/comments/9gr3oh/i_recently_discovered_my_babysitter_from_my/", "pinned": false, "pwls": 6, "retrieved_on": 1537239917, "score": 1, "selftext": "My parents got divorced when I was just 2yo. I moved out with my mom and two older brothers. My mom worked all day and night to support us and get promotions. So she hired a babysitter to take care of us.\n\nMy brothers and I didn't like the babysitter at all. She was an old cranky stern bitch. She was often mean to us, especially me. She punished me for almost anything I did. If my posture was bad I got punished. If I said something without being asked I got punished. She also sent me to bed without having had dinner for no reason. She made me take cold showers. She sent me to bed for no reason a lot actually. This one time she told me and one of my brothers to remember a random sentence. My brother could, but I couldn't because I was only 4 and didn't understand. Then she belittled me, laughed at me and punished me. She would always allow my brothers to do fun things, but not me.\n\nNow the worst thing is. Since my parents were divorced they fought over custody. I wasn't allowed to see my dad for 4 years while my brothers were allowed to. After the death of my mother (she died of cancer when I was 6) I discovered that I wasn't allowed to see my dad because my mom accused him of sexually abusing me. I was shocked to hear it. I remembered my mom as this very sweet and loving woman and could not imagine using me to get revenge. The whole thing damaged my dad, my brothers and it also damaged me. I could not understand why my mom did that and I hated her for it. It bothered me for the rest of my life. So much to the point that it contributed to me attempting suicide. My childhood was pretty miserable from the start because of all that. I never got to have a real bond with my dad. I see him as a friend, but not my dad. \n\nMy traumatic childhood damaged me so much that I'm still suffering the consequences to this day and probably always will. I have been suffering from depression, anxiety and also likely a personality disorder since my childhood. It affects me in all aspects of life, especially relationships. I recently got broken up with by my GF, who I consider to be the love of my life. My issues and mental illnesses contributed a lot to the break up probably, because it affects my behaviour. My life has been pretty awful because of it all.\n\nNow recently I visted my grandma (om my mom's side). She told me that the idea of accussing my dad of sexually abusing me never came from my mom, but instead came from the babysitter. And I specifically remember how the babysitter made me undress completely and asked me where my dad touched me. She suggestively pointed towards my genitals and asked me: \"He touched you there right?\". She continued until I \"confessed\". She made me, a toddler, say it. I guess she told my mom then and that is when the whole shitshow started. I don't know if my mom was in on it or that it was just the babysitters idea. I do know that my mom deliberately tried to keep my brothers and me away from my dad with excuses like that we were sick. So she could've been in on it. Though I know for sure the babysitter was.\n\nNow I can't get answers from my mom since she's gone which always frustrated me. I never had closure because of it. Though the babysitter is still alive and I know where she lives. I want to visit her and just tell her what a despicable and horrible person she is. How she caused so much damage. I could actually murder her for it, but I won't. I luckily have enough self-control to not do that. I can't go to the police though. Even if it can be considered child abuse it is too long ago and it would just be her word versus mine, maybe my grandma and brothers could be considered witnesses, but it's no real evidence. So what should I do?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Advice", "subreddit_id": "t5_2qjdm", "subreddit_subscribers": 151707, "subreddit_type": "public", "thumbnail": "self", "title": "I recently discovered my babysitter from my childhood caused a lot of damage to me and my family. What do I do?", "url": "https://www.reddit.com/r/Advice/comments/9gr3oh/i_recently_discovered_my_babysitter_from_my/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537152893, "domain": "self.depression_help", "full_link": "https://www.reddit.com/r/depression_help/comments/9ggoux/depressed_and_abandoned_need_help/", "id": "9ggoux", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9ggoux/depressed_and_abandoned_need_help/", "pinned": false, "retrieved_on": 1537152894, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 17170, "subreddit_type": "public", "thumbnail": "self", "title": "Depressed and abandoned... need help!", "url": "https://www.reddit.com/r/depression_help/comments/9ggoux/depressed_and_abandoned_need_help/"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537152231, "domain": "self.depression_help", "full_link": "https://www.reddit.com/r/depression_help/comments/9ggm73/i_need_help_long_post/", "id": "9ggm73", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9ggm73/i_need_help_long_post/", "pinned": false, "retrieved_on": 1537152232, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 17170, "subreddit_type": "public", "thumbnail": "self", "title": "I need help! (long post)", "url": "https://www.reddit.com/r/depression_help/comments/9ggm73/i_need_help_long_post/"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537151567, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ggjlp/i_need_help_i_need_a_way_out/", "id": "9ggjlp", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ggjlp/i_need_help_i_need_a_way_out/", "pinned": false, "pwls": 6, "retrieved_on": 1537151569, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 387197, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I need help! I need a way out!", "url": "https://www.reddit.com/r/depression/comments/9ggjlp/i_need_help_i_need_a_way_out/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537150909, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9gggxs/is_there_a_way_out_of_this_depression_please_help/", "id": "9gggxs", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9gggxs/is_there_a_way_out_of_this_depression_please_help/", "pinned": false, "pwls": 6, "retrieved_on": 1537150910, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 387195, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is there a way out of this depression? Please help!", "url": "https://www.reddit.com/r/depression/comments/9gggxs/is_there_a_way_out_of_this_depression_please_help/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1537150308, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ggeaz/is_there_a_way_out_of_this_depression_please_help/", "id": "9ggeaz", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ggeaz/is_there_a_way_out_of_this_depression_please_help/", "pinned": false, "pwls": 6, "retrieved_on": 1537150309, "score": 1, "selftext": "I'm a 24yo guy and 3,5 months ago my GF of almost 3 years left me. We had a perfect 2,5 year long distance relationship (though we saw each other every month for a weekend, a week, two weeks or two months; so we were used to being together). We loved each other so much and felt so happy together. Past January she came to live with me; to build a life together. Things were great at first, but once we both got busy with work (+different schedules), studies and other responsibilities things turned bad. We could barely spend time together and when we did it wasn't real quality time. We got into little fights as well. Most importantly, I took her for granted, but I did not see what I was doing. I didn't pick up on her signals. I thought everything was fine. Even when she gave me a second change I failed to change and I don't know why. Now she doesn't love me anymore, doesn't believe I can make her happy, and doesn't want to give me another chance. She is set to leave around March. I'm scared of losing her forever. I truly and deeply love her.\n\nMy life has been falling apart since the break up. The first week I could hardly eat. I cried my eyes out for days. Since we decided to stay friends we kept in contact, but I was obsessed about getting her back. I even bought these products of relationship experts. We had weekly contact for 1,5 months. She thought I was doing fine and we even had a meet up planned, but then I cracked and called her up emotionally. She didn't like it and cancelled the meet up. She still wanted to be friends and told me to take some months for myself where we wouldn't contact each other. And so we did.\n\nSince that moment I plunged into severe depression. I wouldn't eat or drink for days and just lay in bed all day. Now I have put my internship on hold, I haven't showed up at football practice yet, and I haven't started writing my master thesis yet. I have only moved to my new place (a small room in students housing; which I only got to prove to my ex I can be mature and independent) and I started dating again. Though I feel incredibly lonely there. I also do not feel attracted to the girls I date (probably because I keep thinking of my ex and comparing them to her) and I feel like I leave a bad/sad impression. The pressure of all these life responsibilities is slowly suffocating me. I fear the future as I have no idea of what to do with my life and I fear of being alone.\n\nI have sought professional help since the disastrous phone call and I got referred to 2 psychologists and a psychiatrist. I had 2 sessions with one of the psychologists, but she dropped me because she thinks my problems are too much for her to deal with (I had a traumatic childhood) and that I'm better off at the other psychologist and the psychiatrist. I have yet to see them though as the process is very slow. My doctor thinks I might have a personality disorder or other disorders like bipolar or anxiety. Probably a combination. He thinks that might explain my behaviour towards my GF. \n\nNow in the past 2 months it has been ups and downs. Some days I feel a bit better and I am able to do some small things, but I still feel sad, scared and lonely. Then other days I completely break down, crying, getting panic attacks, laying in bed all day, not eating or drinking, contemplating suicide. I just lay there calling for my ex on repeat for hours. I even stand at places where she stood trying to touch her as if she's there. These ups and downs usually happen within a week. It's absolutely exhausting. Every time I hope I get better, but then I relapse.\n\nAt this point I just don't see a way out. I want to contact my ex and tell her everything that is on my mind. I want to tell her that I didn't mean to make her unhappy like that and that I can make her happy again. Though I know she doesn't want to hear that and just wants to be friends. However, I feel I have to get her back before she leaves around March. Yet she might actually already be with someone else. She is living her life, has moved on I guess. She even told me on the phone that she barely thought of me, but that she does care about me. While I think of her all day. I stalk her on Whatsapp, Facebook and Snapchat just to get an idea of what she is doing, hoping she isn't with someone else. The thought alone of her sleeping with someone else makes me sick. I don't want to deny her happiness though, but I am convinced I can give her that. Though she probably wants something new. I know she wants to explore the single life, because I was her first in everything and she is still young. I was always very understanding of that and even suggested an open relationship and allowed her to kiss girls. None of that ever happened thoug as far as I know. Though I think I also reinforced that idea of exploring.\n\nI just don't see a positive outcome. I don't think I can get her back at all. I feel like I'm a loser. I'm 24 and still studying, only recently moved out, I have no practical skills, I never had a serious job, I barely have any family, my friends are all busy and enjoying their life. I feel like Im useless and cannot make my life better. I cannot even be on my own. I just feel lonely, scared and insecure. My GF was the only person really there for me, the only person I could count on and really talk to, but now she is gone. What do I do?! When does it stop?! How do I get out?! Please help me...", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 387192, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Is there a way out of this depression? Please help!", "url": "https://www.reddit.com/r/depression/comments/9ggeaz/is_there_a_way_out_of_this_depression_please_help/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1536714553, "domain": "self.LifeAdvice", "full_link": "https://www.reddit.com/r/LifeAdvice/comments/9f38yk/should_i_make_this_drastic_change/", "id": "9f38yk", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "permalink": "/r/LifeAdvice/comments/9f38yk/should_i_make_this_drastic_change/", "pinned": false, "retrieved_on": 1536714554, "score": 1, "selftext": "I'm a 24yo guy from the Netherlands. About 3,5 months ago my GF broke up with me. We had troubles in the last months of our relationship, but I never thought it would end like this. We had a future planned out.\n\nShe came here in January from Germany after a long distance relationship of 2,5 years. Things went well at first, but we were looking for our place (we were temporarily living at my dad's place). However, we couldn't find anything. This, coupled with all the stress due to work, study and other responsibilities didn't do our relationship any good. So she eventually left me after 5 months of being here. I was shocked, heartbroken and plunged into a severe depression. I had suicidal thoughts and did not want to live on.\n\nThe future I had planned with her is completely shattered. We wanted our own place, she would study here, I would work, and we would build a life together where we'd travel the world as much as possible and eventually work towards having our own house with a small patch of land to keep some animals and grow fruits and vegetables.\n\nNow that that future is no longer possible, I feel empty and clueless, like a ship without a sail drifting at sea. I'm finishing my master degree in Public Administration this year and my original plan was to just get a government or corporate job, whatever I could get. However, now I feel like I don't want that at all. I don't want a 9-5 job where I'm sitting at a desk all day doing meaningless work. I do find my field interesting, but I don't think it will give me the satisfaction I'm looking for.\n\nI have done quite some soul searching the past months and I came to the conclusion that the only thing that makes me happy is directly helping other people, changing their lives for the better. I think this has to do with me having a bad childhood and rough life overall, but it really is the only thing that makes me happy. In my current field I cannot directly affect people. So here are my current options:\n\nI join the military as an officer after getting my master's degree. I am really attracted to the physical and mental challenge of the job. I also think I'll learn a lot that will be useful in life. And of course, I would be able to help people and be there for them, either my fellow soldiers or other people. Unfortunately, there is a chance I might be declared unfit. Most likely because of psychological reasons since I'm suffering from depression and I probably have a mental illness. I still have to be diagnosed by psychologists and a psychiatrist, but there is a big chance something is wrong and I might need medication for it. This could ruin my chances of joining the military.\n\nSo my other option is that I finish my master's and become a teacher at the university. I am good at doing research and I like teaching people stuff. I also have experience as a tutor and I really enjoyed it.\n\nThis is the drastic option, but the one I'm attracted to the most. Due to what has happened the past months I have gotten increasingly more interested in psychology. I always found it interesting (even did a minor in it), but I had chosen Public Administration instead. I would love to be a clinical psychologist, a researcher and a teacher though. This way I can really help people. Unfortunately, it would cost me at least another 4 years to get a master degree in psychology and even more to get a PhD. Since I'm already 24 I feel like it might be too late.\n\nOf course, my last option is to just get a 9-5 job. Possibly at an embassy in a foreign land to make it more exciting. Though I find this the least appealing.\n\nWhat do you guys think? Should I make such a drastic change? Switch studies/career paths while I'm already 24yo? What are your experiences?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "LifeAdvice", "subreddit_id": "t5_2rj8a", "subreddit_subscribers": 1756, "subreddit_type": "public", "thumbnail": "self", "title": "Should I make this drastic change?", "url": "https://www.reddit.com/r/LifeAdvice/comments/9f38yk/should_i_make_this_drastic_change/"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1536713773, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9f35gs/im_depressed_should_i_make_this_drastic_change/", "id": "9f35gs", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9f35gs/im_depressed_should_i_make_this_drastic_change/", "pinned": false, "pwls": 6, "retrieved_on": 1536713774, "score": 1, "selftext": "I'm a 24yo guy from the Netherlands. About 3,5 months ago my GF broke up with me. We had troubles in the last months of our relationship, but I never thought it would end like this. We had a future planned out.\n\nShe came here in January from Germany after a long distance relationship of 2,5 years. Things went well at first, but we were looking for our place (we were temporarily living at my dad's place). However, we couldn't find anything. This, coupled with all the stress due to work, study and other responsibilities didn't do our relationship any good. So she eventually left me after 5 months of being here. I was shocked, heartbroken and plunged into a severe depression. I had suicidal thoughts and did not want to live on.\n\nThe future I had planned with her is completely shattered. We wanted our own place, she would study here, I would work, and we would build a life together where we'd travel the world as much as possible and eventually work towards having our own house with a small patch of land to keep some animals and grow fruits and vegetables.\n\nNow that that future is no longer possible, I feel empty and clueless, like a ship without a sail drifting at sea. I'm finishing my master degree in Public Administration this year and my original plan was to just get a government or corporate job, whatever I could get. However, now I feel like I don't want that at all. I don't want a 9-5 job where I'm sitting at a desk all day doing meaningless work. I do find my field interesting, but I don't think it will give me the satisfaction I'm looking for.\n\nI have done quite some soul searching the past months and I came to the conclusion that the only thing that makes me happy is directly helping other people, changing their lives for the better. I think this has to do with me having a bad childhood and rough life overall, but it really is the only thing that makes me happy. In my current field I cannot directly affect people. So here are my current options:\n\nI join the military as an officer after getting my master's degree. I am really attracted to the physical and mental challenge of the job. I also think I'll learn a lot that will be useful in life. And of course, I would be able to help people and be there for them, either my fellow soldiers or other people. Unfortunately, there is a chance I might be declared unfit. Most likely because of psychological reasons since I'm suffering from depression and I probably have a mental illness. I still have to be diagnosed by psychologists and a psychiatrist, but there is a big chance something is wrong and I might need medication for it. This could ruin my chances of joining the military.\n\nSo my other option is that I finish my master's and become a teacher at the university. I am good at doing research and I like teaching people stuff. I also have experience as a tutor and I really enjoyed it.\n\nThis is the drastic option, but the one I'm attracted to the most. Due to what has happened the past months I have gotten increasingly more interested in psychology. I always found it interesting (even did a minor in it), but I had chosen Public Administration instead. I would love to be a clinical psychologist, a researcher and a teacher though. This way I can really help people. Unfortunately, it would cost me at least another 4 years to get a master degree in psychology and even more to get a PhD. Since I'm already 24 I feel like it might be too late.\n\nOf course, my last option is to just get a 9-5 job. Possibly at an embassy in a foreign land to make it more exciting. Though I find this the least appealing.\n\nWhat do you guys think? Should I make such a drastic change? Switch studies/career paths while I'm already 24yo? What are your experiences?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 385793, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I'm depressed. Should I make this drastic change?", "url": "https://www.reddit.com/r/depression/comments/9f35gs/im_depressed_should_i_make_this_drastic_change/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1536712914, "domain": "self.Advice", "full_link": "https://www.reddit.com/r/Advice/comments/9f31gh/should_i_make_this_drastic_change/", "id": "9f31gh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Advice/comments/9f31gh/should_i_make_this_drastic_change/", "pinned": false, "pwls": 6, "retrieved_on": 1536712915, "score": 1, "selftext": "I'm a 24yo guy from the Netherlands. About 3,5 months ago my GF broke up with me. We had troubles in the last months of our relationship, but I never thought it would end like this. We had a future planned out. \n\nShe came here in January from Germany after a long distance relationship of 2,5 years. Things went well at first, but we were looking for our place (we were temporarily living at my dad's place). However, we couldn't find anything. This, coupled with all the stress due to work, study and other responsibilities didn't do our relationship any good. So she eventually left me after 5 months of being here. I was shocked, heartbroken and plunged into a severe depression. I had suicidal thoughts and did not want to live on. \n\nThe future I had planned with her is completely shattered. We wanted our own place, she would study here, I would work, and we would build a life together where we'd travel the world as much as possible and eventually work towards having our own house with a small patch of land to keep some animals and grow fruits and vegetables.\n\nNow that that future is no longer possible, I feel empty and clueless, like a ship without a sail drifting at sea. I'm finishing my master degree in Public Administration this year and my original plan was to just get a government or corporate job, whatever I could get. However, now I feel like I don't want that at all. I don't want a 9-5 job where I'm sitting at a desk all day doing meaningless work. I do find my field interesting, but I don't think it will give me the satisfaction I'm looking for.\n\nI have done quite some soul searching the past months and I came to the conclusion that the only thing that makes me happy is directly helping other people, changing their lives for the better. I think this has to do with me having a bad childhood and rough life overall, but it really is the only thing that makes me happy. In my current field I cannot directly affect people. So here are my current options:\n\n1. I join the military as an officer after getting my master's degree. I am really attracted to the physical and mental challenge of the job. I also think I'll learn a lot that will be useful in life. And of course, I would be able to help people and be there for them, either my fellow soldiers or other people. Unfortunately, there is a chance I might be declared unfit. Most likely because of psychological reasons since I'm suffering from depression and I probably have a mental illness. I still have to be diagnosed by psychologists and a psychiatrist, but there is a big chance something is wrong and I might need medication for it. This could ruin my chances of joining the military.\n\n2. So my other option is that I finish my master's and become a teacher at the university. I am good at doing research and I like teaching people stuff. I also have experience as a tutor and I really enjoyed it.\n\n3. This is the drastic option, but the one I'm attracted to the most. Due to what has happened the past months I have gotten increasingly more interested in psychology. I always found it interesting (even did a minor in it), but I had chosen Public Administration instead. I would love to be a clinical psychologist, a researcher and a teacher though. This way I can really help people. Unfortunately, it would cost me at least another 4 years to get a master degree in psychology and even more to get a PhD. Since I'm already 24 I feel like it might be too late.\n\n4. Of course, my last option is to just get a 9-5 job. Possibly at an embassy in a foreign land to make it more exciting. Though I find this the least appealing.\n\nWhat do you guys think? Should I make such a drastic change? Switch studies/career paths while I'm already 24yo? What are your experiences?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "Advice", "subreddit_id": "t5_2qjdm", "subreddit_subscribers": 149780, "subreddit_type": "public", "thumbnail": "self", "title": "Should I make this drastic change?", "url": "https://www.reddit.com/r/Advice/comments/9f31gh/should_i_make_this_drastic_change/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1536115655, "domain": "self.askwomenadvice", "full_link": "https://www.reddit.com/r/askwomenadvice/comments/9d2bl9/should_i_tell_my_ex_gf_that_my_mental_illness/", "id": "9d2bl9", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 10, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/askwomenadvice/comments/9d2bl9/should_i_tell_my_ex_gf_that_my_mental_illness/", "pinned": false, "pwls": 6, "retrieved_on": 1536115656, "score": 1, "selftext": "So my gf broke up with me about 3 months ago because she doesn't love me anymore. She even gave me a second chance, but it didn't work since I didn't change.\n\nLooking back, I do not recognize myself in the person I was. I'm full of regret and guilt, and I'm conflicted with myself. I feel extremely bad for my ex who couldn't understand why I behaved the way I did and why I didn't change. I have been having a severe acute depression since the break up. \n\nNow I'm seeing two psychlogists and a psychiatrist. They think it's likely that I have a personality disorder and/or other mental illnesses which would explain my behaviour in the months before the break up. \n\nOnce I get the final diagnosis I would like to tell my ex to give her some clarity. We're on good terms and are still friends. I just wonder if it's a good idea. I want to give her clarity even though the relationship is obviously over, but I fear I'll push her away and that she'll see it as an excuse for my behaviour. I think, as my friend, she should know. \n\nWhat are your thoughts?", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u", "subreddit_subscribers": 90206, "subreddit_type": "public", "thumbnail": "self", "title": "Should I tell my ex gf that my mental illness likely caused the break up?", "url": "https://www.reddit.com/r/askwomenadvice/comments/9d2bl9/should_i_tell_my_ex_gf_that_my_mental_illness/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1536114717, "domain": "self.askwomenadvice", "full_link": "https://www.reddit.com/r/askwomenadvice/comments/9d27ca/would_it_be_weird_to_tell_my_ex_girlfriend_that_i/", "id": "9d27ca", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/askwomenadvice/comments/9d27ca/would_it_be_weird_to_tell_my_ex_girlfriend_that_i/", "pinned": false, "pwls": 6, "retrieved_on": 1536114718, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u", "subreddit_subscribers": 90205, "subreddit_type": "public", "thumbnail": "self", "title": "Would it be weird to tell my ex girlfriend that I have a mental illness which probably led to the break up?", "url": "https://www.reddit.com/r/askwomenadvice/comments/9d27ca/would_it_be_weird_to_tell_my_ex_girlfriend_that_i/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_zfey4", "can_mod_post": false, "contest_mode": false, "created_utc": 1535968940, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ck8sh/lost_a_happy_future_now_i_am_lost/", "id": "9ck8sh", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 5, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ck8sh/lost_a_happy_future_now_i_am_lost/", "pinned": false, "pwls": 6, "retrieved_on": 1535968942, "score": 1, "selftext": "About 3 months ago my gf left me. We had a perfect long distance relationship for 2,5 years and then she finally came to live with me and my dad. Our dream came true.\n\nEverything went downhill from there. She got a full-time job, but with late shifts. I got a normal 9-5 internship, I had my studies, my sports and I was in a board. We were both so busy and thus only had time in the weekends. She also didn't like living at my place and couldn't get along with my dad. So we were looking for our own place, but couldn't find anything. She tried to break up with me after 3 months, but gave me a second chance. She eventually left me after 5 months.\n\nMy life has been ruined. I was already suffering from some sort of depression since my childhood, probably dystymic, but now I got diagnosed with having a severe acute depression. I feel so empty without her, so alone. I keep thinking of my time with her and how happy I was, and how stupid I am for ruining it not once but twice! I absolutely hate myself. I have so much guilt and regrets for nkt being able to make her happy. I'm also scared of the future as I don't know what I want to do or could do, and I'm already 24. I have days were I only sleep and don't even eat or drink. \n\nIn the past 3 months I've had emotional ups and downs within days, sometimes hours. I switch between being sad, desperate, angry and somewhat motivated constantly. I can't control it. I hardly do anything. The only thing I did was finding a place for myself and get help. I still haven't moved in though and I just started seeing  a psychologist.\n\nI don't know why I acted the way I did towards my ex. I was selfish, unloving, immature, irresponsible, mean and just not investing time in her. I love her so much though. It's this immense feeling deep inside me, but it's like I can't really express it her. It's as if there are two persons in my head. One who is positive, motivated, wants to give love and wants to take action. The other is negative, inactive, and not empathetic. Usually the last one wins. It's like I wasn't really in control the last months of the relationship. I feel so conflicted with myself. My head feels like exploding and my heart as if it could stop anytime. I just want to die every day. Just so everything stops. I thought of slitting my wrists, electrocuting myself or taking sleeping pills. I almost cut my wrist, but I couldn't do it. I just can't anymore...\n\nI did some small tests which are indicating I could have narcissistic personality disorder, borderline, anxiety, autism, and sociopathic traits. So that's on top of my depression. It makes me feel like I am dysfunctional. I don't even know if I should tell my ex once I get the diagnosis. I want her back, but I fear it will only push her away. Besides that, she is leaving the country around March. I don't wanna lose her forever...\n\nI just want to be happy again. I need help and could use people who understand... please help me.\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 383733, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Lost a happy future, now I am lost.", "url": "https://www.reddit.com/r/depression/comments/9ck8sh/lost_a_happy_future_now_i_am_lost/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535175227, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9a4jv0/lost_my_girlfriend_due_to_my_mental_illness_i/", "id": "9a4jv0", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 9, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9a4jv0/lost_my_girlfriend_due_to_my_mental_illness_i/", "pinned": false, "pwls": 6, "retrieved_on": 1535175228, "score": 1, "selftext": "About 3 months ago my girlfriend (19F) of 2 years and 3 months broke up with me (24M). She came to live with me in January 2018 after 2,5 years of a long distance relationship. Since then things went downhill. We barely saw each other due to our busy schedules (only in weekends), we didn't spend quality time together, we got into little fights because we were stressed, she wasn't comfortable at my home because my dad also lived with us and it just wasn't a place that felt like home, she made new friends in the city she works in but could hardly see them due to travel times, we had trouble finding a place for ourselves, among other things.\n\nIn March she already tried to break up with me when we got into a small fight. She was clearly upset. She said she didn't love me anymore, that she wants to 'feel love in different places', and that she wants to have a her/our own place. I begged her to stay and eventually she decided to stay.\n\nIn April I showed her more love and things went pretty well. However, at the end of the month and especially in May things turned for the worse again. We got back into the drag and the love and intimacy faded again. About halfway may she apparently had enough and searched for her own place in the city she works in without telling me. Two weeks later she had packed her stuff and told me she was leaving. Again she told me she didn't love me anymore and that she wanted to leave. She just didn't believe in me anymore, that I could make her happy and she didn't want to commit to me. I helped her move the next day and managed to convince her to take a break. This only lasted 3 days because I stupidly called her up in an emotional state. She got angry and then really broke up with me.\n\nI was completely shocked both times when she wanted to break up with me. For me it came all out of nowhere. I managed to see her some days after the break up to talk about it. After having analyzed all that happened the past few months, I was convinced that it was just due to the stressful situation we were in. She told me that wasn't the case. She just said she doesn't love me anymore, that she doesn't believe I can make her happy, and that we do not fit in our core. I also told her that I made mistakes, but I was mostly putting the blame on the situation. We decided to stay friends. She still liked me and I suspect she still has feelings for me because she was very conflicted and emotional about breaking up with me. Perhaps those are just high hopes though.\n\nEver since the break-up, I have been a complete wreck. I cried and raged for days. I didn't eat and couldn't sleep. I got a break from my internship. I failed two exams. I felt incredibly depressed and even suicidal. I just wanted to end it. Occasionally, I felt motivated. I was desperately trying to look for ways to get her back. I contacted relationship experts and bought some of their products. I also talked to family and friends about it. Surprisingly, I managed to get a place of my own. My situation didn't get better though. I did have contact with my ex, but progress was slow. After a month or so I got professional help because it was all getting out of hand. A psychologist diagnosed me so far with having an acute depression. A friend of mine also suggested me a book about narcissism as he himself is a narcissist and recognized a lot of the traits in me.\n\nFast forward to now and my situation has still not improved. I still long for my ex. I love her deeply and even consider her the love of my life. I feel extremely depressed and suicidal. I also don't feel like I am somebody as if I'm an empty shell. I don't know what to do with my life anymore, I'm not motivated at all and I have constant panic attacks because I fear losing my ex forever, never getting her back. I am getting professional help, but it's a slow process. I was referred to a clinical psychologist who I had my intake with just yesterday. My next meeting is in two weeks.\n\nLooking at myself and back at the last months of the relationship, I have the feeling that I'm mentally ill. I suspect that I either have a narcissistic personality disorder or a borderline personality disorder. It's hard to say though as I'm no professional, but there is clearly something wrong in my head. I was completely oblivious to all the signals my girlfriend gave me. I was not empathetic and I was even mean to her, pushing her away. Oddly enough, I love her deeply, more than anyone and anything, but for some reason I was not able to properly express that if I even did express it at all. I feel like there are two persons in my head: the one that feels, has dreams and ideas and wants to act on it vs. the one that is selfish, mean, negative and just keeps me from actually doing things. It feels like a constant battle in my head which is often own by the latter 'person'.\n\nI suspect that many of my mental issues originate from my traumatic childhood. My parents divorced when I was 2, resulting in a long nast custody battle. I did not get to see my dad for 4 years because my mom had used me to get back at my dad by claiming he had sexually abused me which wasn't true. Eventually, when I was 6 my mom died of cancer. I was never able to love my mom after knowing she used me and I'm actually glad she is dead. Anyway, me and my two brothers then had to live with my dad, a man that was a stranger to me. Money was tight, my dad became an alcoholic, and he was constantly fighting with my oldest brother. This went on for years. All my dad's attention went towards my brothers and all he cared about with me were my school results. I got into a lot of trouble at school and with authorities in my youth. Ever since I was 12 I have felt depressed, never able to feel really happy. I was suicidal and self-harming. At 18 I even tried to commit suicide, but luckily failed. All my life I have felt alone and unsupported until I met the girl who is now my ex. It was such a great relationship. We loved each other so much and things went almost perfect, rarely having a fight. I could not have imagined a better relationship. I was really happy with her. Though sometimes I was still feeling down, unhappy or depressed; often when she and I were apart for some time. It's as if I was never able to be truly happy on my own and I didn't know why. During the long distance relationship (in which we did see each other every month for a week or two, in the summer for two months; so we spend a lot of time together) it wasn't so much a problem. My gf was aware of the problems I had, but was very supportive. Though in the last few months, since she came to live with me, I feel like I lost control and she couldn't deal with it anymore.\n\nI feel hopeless now. I want my ex back so badly, knowing that I can make her happy, but it's like I lost her due to my mental problems without even knowing it. I don't know if I can ever get mentally healthy; if I she'll ever believe that it was because of mental issues and that she can forgive. I don't know I can ever get her back. I feel so scared and lost, and I could really use some help.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 381021, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Lost my girlfriend due to my mental illness. I feel lost.", "url": "https://www.reddit.com/r/depression/comments/9a4jv0/lost_my_girlfriend_due_to_my_mental_illness_i/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1535174345, "domain": "self.depression_help", "full_link": "https://www.reddit.com/r/depression_help/comments/9a4h6j/lost_my_girlfriend_due_to_my_mental_illness/", "id": "9a4h6j", "is_crosspostable": false, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "permalink": "/r/depression_help/comments/9a4h6j/lost_my_girlfriend_due_to_my_mental_illness/", "pinned": false, "retrieved_on": 1535174345, "score": 1, "selftext": "[removed]", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression_help", "subreddit_id": "t5_2zy2x", "subreddit_subscribers": 16586, "subreddit_type": "public", "thumbnail": "self", "title": "Lost my girlfriend due to my mental illness without even knowing. I feel lost.", "url": "https://www.reddit.com/r/depression_help/comments/9a4h6j/lost_my_girlfriend_due_to_my_mental_illness/"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534994251, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/99jvjc/i_feel_like_i_am_dysfunctional_and_should_not/", "id": "99jvjc", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/99jvjc/i_feel_like_i_am_dysfunctional_and_should_not/", "pinned": false, "pwls": 6, "retrieved_on": 1534994252, "score": 1, "selftext": "**Note: Sorry for the long post. The important part is at the end in bold text. The rest is backstory. I'd really appreciate any comments.**\n\nWith the years I have started to feel increasingly dysfunctional to the point that I feel I have no place in this world and should not exist, or do not want to exist. Now this feeling is stronger than ever since my girlfriend, who I consider to be the love of my life, has broken up with me about three months ago. I do not blame her. I blame myself. Though the root of all my problems are demons from my past that I cannot seem to get a grip on, that I cannot seem to control. They’re eating me up from the inside and tearing me apart. Here’s my story.\n\nI was born in 1994 into a then happy family. When I was 2 years old my parents divorced. My two older brothers and I moved to a new place with my mom. To support us my mom had to work over hours. So we hardly saw her during the work week. Instead, we were stuck with a babysitter; an old cranky woman who seemed to hate me. She belittled me and punished me for no reason. In the meantime, my mom was fighting over custody with my dad. This meant we were only allowed to see him for a weekend every two weeks. For some reason, I was not allowed to see him and instead had to spend those weekends with my mom, the babysitter, my grandma or a friend of my mom. This went on for years and in that time I never saw my dad. \n\nWhen I was 6 years old my mom got ill. She was diagnosed with throat cancer and hospitalized shortly afterwards. My mom then asked my dad to take care of me and my brothers, and he did. Though now I was living with a man who was a complete stranger to me. We eventually got along, but he never felt like a dad to me. One day we visited my mom in the hospital. She was crying, as were my brothers and even my dad. Naturally, I had to cry too, but I did not understand why. Due to her throat cancer, she could no longer speak. She gave me a little notebook that I was supposed to read at home and then she gave me a note saying that she loved me. I then went home and read the notebook in which my mom had written that she is proud of me and that I will become a great person. I still didn’t understand what it all meant. The next day it all became clear. My mom had passed away due to the cancer.\n\nFrom that point onwards my brothers and I lived with my dad. Things were far from ideal. My dad was unemployed due to medical issues, money was therefore tight, he became an alcoholic, and he and my oldest brother, who just hit puberty and who was also struggling with his sexuality, would constantly fight. So my home situation was far from ideal. I got into trouble at elementary school with teachers and other students due to anger issues. Still, I managed to finish elementary school with good grades and went on to the highest level of high school education.\n\nThe same problems continued there however. Though my dad was too busy fighting with my oldest brother. It eventually escalated to the point where my brother hit my dad on the head with a motorcycle helmet. I was there; I grabbed a knife and held it against my brothers throat, saying that I would slit it if he did anything. My brother was subsequently kicked out of the house. Now it was just my dad, my other brother and me.\n\nIn that first year of high school I started having dark thoughts and feeling depressed. I cut myself and spoke of killing myself. My dad was however not so much concerned with my emotional well-being and only cared about my school results. I did finish the year with good grades, but I told my dad I wanted to switch school; he didn’t listen. Then hardly two weeks in my second year I got into trouble with a teacher. I got detention. At the end of the day he and another teacher came in. I thought they were going to scold me, but instead they started talking to each other about me, making fun of me. I got angry but kept myself together. Though then one of them said: “I bet he is just angry because his mommy is dead”. I then got up and hit him in the face as hard as I could. I was sent home, expelled for a week and then kicked from school. It was the school’s responsibility to find me a new school, but they failed to do so. I sat at home for half the school year.\n\nWhen I finally got into a new high school I was having anxiety issues. I was an emotional wreck, but again my dad only cared about my school results. I was however forced to visit a child psychologist, but she didn’t help me as she only cared about money.\n\nSince then I started to alienate myself from my dad. I felt like he could not help me since he was an unemployed alcoholic who didn't even finish high school himself. His alcoholism got so bad at one point that he got hospitalized twice, nearly dying. Only after the second time he finally stopped drinking. Still, I instead looked up at my older brother as my role model. I did have friends at school and also in my neighbourhood. Though my neighbourhood friends were a bad influence as I often got into trouble with the police, I started smoking weed, and I began drinking, like most 14 year-old teenagers. At one point I got arrested and had to do community service. I also got hospitalized once due to alcohol. This all angered my dad and worsed my relationship with him. He would often rant about how he should've never taken me and my brothers in, that we should be sent to a labour camp in Siberia, and that he would spit on my mother's ashes. Around this time he also told me the truth about my mom. He told me that the reason I wasn't allowed to see him when I was a small kid was that my mom had accused him of sexually abusing me. Though he never actually sexually abused me. It was something my mom fabricated to get revenge on my dad because my mom thought my dad had cheated on her during their marriage. My dad never cheated though. It was a misunderstanding, but my mom would not believe it and thus they got divorced. So my mom used me to get back at my dad. I even remembered then how she put me in a room and told me that I should tell 'these important people' that my dad touched me 'here', pointing at my genitals. I don't remember whether I actually did, but eventually the charges got dropped as there was too little evidence. Still, my dad was arrested at work for it and lost his job. He did receive compensation after a lawsuit, but all those years of emotional struggle made him depressed and led him to the bottle. After hearing all that, I could never think of my mom the same way. I felt used, betrayed, and my image of my mom as a sweet loving woman was destroyed. I can no longer love her and I am actually glad she is dead. So then I had lost faith in both my parents. I felt like I could not count on anyone, that I had to do everything on my own. Fortunately, I managed to do so, but it never made me happy. I always felt like I missed some emotional support. I felt like a lone wolf.\n\nThese feelings only got stronger when I saw how my brother, who I looked up to, struggled with passing his high school finals due to performance anxiety. Since my dad was so fixed on our school results he put all his attention on my brother, not caring about me. Luckily, my brother managed to pass his high school exams, got into university and moved out of the house. Now I was left with just my dad and suddenly he was giving all his attention to me, meaning he was constantly pressuring me about school. I wasn't used to this. I hated it and I got into a lot of fights with my dad. At this point, I also started to realise why my eldest brother didn't get along with my dad and why my other brother left the house. My dad was simply a difficult man to be around since he is a depressed and extremely pessimistic man with no real friends and no woman in his life. He is also slightly autistic. I have the suspicion that he puts so much pressure on his sons to achieve things, especially regarding school because he never finished school himself and sees himself as a failure. It is also the reason why I resent him for pressuring me about school or my studies because it is really hypocritical of him to do so. When I had to do my high school finals I just couldn't care anymore. I was emotionally drained and I felt depressed. I instead watched The Lion King for nostalgia. Still, I managed to pass most of my finals. Though I had to one retake to actually get my diploma. When I told my dad this he got pissed as he could not believe it. He expected me to simply pass. I took the retake, but again I couldn't care. Luckily, I passed it and I got my diploma. My dad simply congratulated me in a formal way when I told him. When my brother passed his finals he was so happy, even crying of happiness. So I felt betrayed again. I started alienating myself from my dad even more to the point that I would see him more as a housemate than a parent. I could no longer love him and I only saw him as someone providing me with a roof over my head and food. In this same time period, my brother had failed three studies at uni and eventually quit it. So now I was the only one in the family going to uni. My brother was no longer my role model and my dad no longer a parent. Again, I felt like a lone wolf facing the world on my own.\n\nSo I went to uni. I studied Biology, but I quickly realised it wasn't for me so I quit. The rest of the study year I worked to earn some money. Since I turned 18 I also finally received my portion of the heritage my mom left me. It was about €13.000. A lot of money for my age. It was meant for my studies and to pay for driving lessons. I was very careful with the money because I saw how my brothers wasted it on useless stuff. My dad also wasn't a financially responsible man. I actually had to lend him money to pay for the bills. He is now over €9000 euros in debt with me. After a while I discovered that it wasn't because money was tight, but simply because he had a buying addiction. He would buy things for himself or for others to feel better. Since then I stopped lending him money. Since I wanted to save money, I decided to stay at home despite the bad relationship with my dad. The next study year I started a new study: Public Administration. I was 19 at the time. I really liked it, but I had trouble getting used to studying again. At that time I was also feeling quite depressed again. I was only putting minimal effort into my studies. I then met this girl who I liked and started chatting with her, but she rejected me. I had little previous success with girls so it hit me quite hard. I felt extremely sad and lonely. I knew I had no one for emotional support which made me feel more lonely. I started thinking about my mom and everything that happened. I hated my life. I cried and raged all night. Then in the middle of the night, I attempted suicide by stabbing myself in the wrist. That shocked me and I realised it wasn't right. I rode my bike to the hospital at 5am with a bloodied wrist to get it stitched. I told no one about what happened except for my best friend. He helped me through the next months. I owe him a lot. Things were getting better actually. I did better at my studies. I also asked that girl out again and she said yes to my surprise. She fell for me and we got together. I was really happy at first, but after a few weeks I realised I didn't actually love her. I simply only wanted a relationship so that someone was there for me. The relationship lasted 6 months and then I ended it.\n\nIn the time after that I simply focused on my studies and enjoying my life. I still wasn't happy though, but just content. Then in the summer of 2015 I met my most recent gf. I wasn't even looking for a gf but I just came across her online. We started chatting and we instantly clicked. I never had so much chemistry with someone in my life. It felt like a perfect fit for both of us. She then invited me over for a week that summer since her parents would be gone. Since she was 16 and I was 21 I was a bit weary at first, but I liked her so much that I accepted. After two weeks of talking, I took the 4h train ride to her place in Germany. We clicked even better in person and spend an amazing week together. I liked her so much that suggested a long distance relationship (LDR). She liked me too and accepted. Since then we met at least every month; sometimes for a weekend, but mostly for a week or two, and in the summer for 2 months. It was the perfect LDR. Our love grew and we were just so happy together. I met her parents and they welcomed me into the family. We went on vacations together and made such amazing memories. For the first time in my life I felt truly happy. It felt like finally something good came to me. Obviously, I was extremely motivated to make the relationship work and it did. We hardly had any fights and just had lots of fun together. We eventually came up with the plan that she would finish her high school and then she would move to the Netherlands to study there and live with me. Finally, after 2,5 years of LDR, she came to the Netherlands in January 2018. We were so happy that after all that time and the struggles of being apart we would be together forever and work towards our dream of having our own farmhouse with animals and travel the world together.\n\nWe were confident that things would work out as we got along so easily. Though things didn't go as planned. We made the mistake of living in my dad's house temporarily because it was financially the better option. I could have applied for student housing earlier, but I didn't because of the costs and I would only be allowed to live there on my own. So my gf and I decided to temporarily live at my dad's place so we could look for our own place. However, this required of us to both get some income. My gf already decided to work for a year or so first as she wasn't sure what to study yet and she wanted to take the time to settle in well. I helped her with all the paperwork and she found a job in Amsterdam. I am still finishing my master's and since I wanted to get some experience I opted for a well paying internship. After 2 months we both started working, but I worked from 9-5 while she worked from 2-11 and she also had to travel 3 hours in total each day. It meant we only saw each other for 1 hour before bed during the work week. We both were often tired and agitated, resulting in lots of small fights and frictions. \n\nAt the end of March, she got home tipsy and we got into another silly fight, but she then burst out she didn’t love me anymore and wanted to break up. I was shocked and didn’t understand. She said that she didn't feel loved by me anymore and that she didn't feel anything when I would hug her, kiss her or have sex with her. She said the love and intimacy had faded. She also said she wanted to feel 'love in different places'. I asked her if she meant from other people because I was aware that she had thoughts of exploring/experimenting since I was her first boyfriend. She couldn't give me a clear answer, except for something like: \"I guess, maybe, I don't know\". She also told me that she didn't feel comfortable at my place with my dad because she couldn't get along with him (especially in the morning when she was alone with him at home). She wanted privacy and freedom, but she didn't see me trying to get our own place. It all overwhelmed me. I tried convincing her to stay but she was adamant about the break-up. We then went to bed. Oddly enough she was fine with sleeping with me and cuddling with me. The next morning I asked her again to stay. She got mad and went to her room. I then got a panic attack because I was so scared to lose her. After a few hours, I just broke down crying next to her bed and begged her to stay. Seeing me in that state made her change her mind. She decided to stay and we talked about it. I promised her I would show more love and we would find our own place. I also explained to her that we couldn't look for a place earlier because we had to wait a bit more for the required paperwork. She accepted that and I also said that her decision was rather impulsive. She just wanted to feel loved and spend time together.\n\nThe following month, in April, things were going better. I gave her more love and she showed me lots of love and affection. We also started looking for a place together. We were excited for the future. We spoke of how to decorate our home and how fun it would be to have our own place. I also managed to buy my grandma's car so we could tour around a  bit. On one Saturday I took her out for a surprise dinner near a lake. It was a beautiful spring evening and we had a great time. She absolutely loved it and was all over me. I was so happy to see her so happy herself. Sadly, things turned bad again nearing the end of the month. We were both busy with our jobs and a bit stressed. We didn't spend much quality time together. Things became a drag again. The love and intimacy faded again. And I was blind to the signals she was giving me.\n\nSo all in all, I failed to show her the love she wanted and be the guy for her that she wanted. In May things continued to drag on. Halfway May was the last time she showed love and affection towards me. A big issue was that we had no luck in finding a place for ourselves. The housing market is tight and we were just constantly denied. I then wanted to have a talk about finding a place with her. That was on the 23rd of May. I jokingly suggested that we could stay at my dad's for years and save for buying a house. My serious suggestion was that we would both look for our own places. She in Amsterdam and I in the Hague since that would be easier and more comfortable for both of us. We could still easily see each other then. I think she only heard the first bit and got scared because she was simply staring blankly in front of her and only saying: \"Ok\". After the break up she admitted to me she got scared when I mentioned staying at my dad's and buying a house. She didn't want to commit to that she said. In the following two weeks, I noticed she was avoiding making any plans with me. She was initially fine with going to my grandma the next week, but she later said she couldn't. She also didn't want to see the new Star Wars movie with me and she told me I don't have to come to Germany to celebrate her birthday. In the last week, I noticed she was taking down her photos of us and putting them away. Then on Friday the 1st of June I saw she had packed her stuff.\n\nWhen she came home late from work I confronted her about it. She told me she couldn't stay any longer, that she had found a room in Amsterdam and would leave the next day. She said again she didn't love me anymore, that the loved and intimacy had faded again and told me she couldn't commit her life to me. Again, I was shocked and heartbroken. I tried convincing her to not leave me, but it was pointless. She said she felt really uncomfortable and confined at my dad's place and just couldn't take it anymore. She wanted her freedom and independence. That is when she also mentioned she got scared when I suggested staying at my dad's for years to save for a house, confirming she only heard that part and not the other. Since we were both tired we went to bed. Again, oddly enough, she still slept with me, lay on my chest, hugging me.\n\nThe next day I didn't want to be an ass. I understood her choice to move so I helped her move. She was actually surprised by that. Then in the car, I wanted to have a serious talk. There I convinced her that we should take a break because our relationship was too valuable to give up, that my plan is not necessarily her plan and that maybe it is better to live separately for now. She agreed, but we never really were clear on what it meant and how it would work. We would give each other space and time. \n\nThough stupid me could not take it. I missed her badly and I couldn't deal with the uncertainty. I then called her on Monday night in an emotional state. I had thought things over a lot and wanted to talk to her. She wasn't all too happy that I contacted her; she wanted to break up and not talk to me. I still managed to convince her to talk to me face to face.\n\nOn Wednesday the 6th of June we met up. I had written down everything I thought went wrong and memorized it. First I apologized for my desperate call on Monday. Then, I told her that we made a mistake by going from a long distance relationship to living together, especially with my dad. It was a toxic environment for both of us which caused lots of frictions between us. I failed as a boyfriend by not giving her enough attention and making her feel comfortable at home (I was completely blind to it all though, because I was busy myself and felt stressed and tired). She admitted it was also her fault. She didn't communicate with me and she also felt stressed and tired. Besides that, she really wanted to have a place for ourselves or at least herself to be independent and have the privacy we need. Either way, over these past months she lost her love for me. We still hugged, kissed and had sex, but there was no intimacy. She still had feelings for me and I believe she still does, but it is not enough to love me.\n\nThe talk we had on Wednesday was however very chill. It was a sunny day, we took a walk in a nice park, sat by the water and just talked. We don't hate each other, we actually get along really well and were able to laugh together. It feels now that we are just good friends and we also want to stay good friends. During our conversation, I asked her if she saw the possibility to get back together at some point. Initially, she said it was unlikely because she thinks the relationship would be the same as over the past months and end up in nothing. I tried to convince her that things change and so will we; and that we should stay open for our feelings for each other and stay open to possibly getting back together. She sort of reluctantly agreed with me there. \n\nThe reason she thought we can't get back together is that our personalities don't match as well as she thought. She told me my humour is a bit eccentric and she referred to one time when I didn't go with her to her dad's birthday due to a small fight. It seems to me she was just nitpicking her, looking for reasons. I think she knows our personalities actually match. We do balance each other out for example. She is more impulsive and creative, I'm more calm and calculative. It had worked for over 2,5 years so then it's a bit odd to say we don't fit together. I think that when we lived together our personalities just clashed because we were too focused on our selves due to the stress and tiredness. It all pulled us apart. Though she probably finds other things about \n\nShe also mentioned that we have different ideas for our lives. She wants to work a bit, travel more, experience things, and don't live according to strict plans and commit to them. She thought I do want that; that I want to just get a job, a house, kids and whatnot. Though I told her that isn't the case. I also want to do what she wants. Only when we're older I want a nice house. She said she wants to go to Canada and I said I want that too. She was surprised by that.\n\nShe was actually surprised by how I was during the whole conversation. She thought I would beg her again to come back. Instead, she said I behaved really mature, was very sensitive and understanding of her and the issues we have. I told her that I am proud of her, how she has matured over the years.\n\nWhen we got back to her place it was time to say goodbye. We hugged each other tightly and said goodbye. I was walking towards my car and she was at the door of her place. After a few meters, I looked over my shoulder and she was still standing there holding the door and smiling at me and I smiled back.\n\nWe decided to stay friends. She contacted me after a week of no contact and ever since we talked every week here and there. I made a few mistakes in the beginning by still showing my feelings for her. There was obvious tension when we talked. It just didn't feel natural. Despite that, we still talked. I always let her contact me first. She mostly contacted me about practical stuff, but she also contacted me out of genuine interest sometimes.\n\nThe time after the final break-up has been absolute hell for me. In the first week after the break-up, I could hardly eat. I felt mentally and physically broken. I felt more depressed than ever. Every day, I either cried or was angry and I had constant panic attacks. I just wanted to die. I occupied my time with figuring out how I could get her back. I even spend quite some money on the products of relationship experts. It helped me a lot in understanding the break-up and I stuck to the suggested strategies. It actually somewhat worked, but progress was very slow. In the meantime, I found a place for myself. I decided to move out to show her I can be mature and responsible. When I told her she seemed genuinely excited and interested in it. I also went to my doctor to get psychological help. Eventually, after 1,5 months I was able to arrange a meet-up with her. She was very chill and kind. I felt like I was getting closer to her again. Though the meeting had to wait 3 weeks due to our vacations. I went to the Ardennes with two friends. When I got there I felt horrible. The place reminded me of a place where I spend a vacation with my ex. I felt so bad that the next day I went back home. I was very emotional and I wanted to talk about the relationship with my ex. So I asked her if I can call her to talk about something important. She was fine with it and I then called her later that night. I opened up to her. I told her awful these past weeks were for me; that I have been thinking about her every day; that I miss her and love her; and that I need to talk about the relationship with her. She was having none of it. She didn't want to meet up to talk about the relationship. She thought I was doing fine actually, but since I was actually not doing fine she cancelled the meet-up we arranged. She also said she barely thought about me since the break-up (now I don't really believe that, but she obviously hasn't thought of me as much as I did of her). \n\n**So now I feel worse than ever. I lost the love of my life, I’m extremely depressed, and I just want to die. I have done a lot of thinking these past months however. I’ve come to realise that I was never happy with myself. I was only happy during my relationship because of my girlfriend. I thought that I could separate my personal issues from the relationship, but when she came to live with me it was impossible to keep separate. Now that I look back on that time with her I don’t even understand why I was the way I was. I pushed her away from me while I actually loved her. I don’t recognize myself in the person I was then. A friend of my suggested a book about narcissism and it seems very likely that due to my childhood traumas I have developed a narcissistic personality disorder. This means that I desire a person to emotionally cling to and constantly get validation from because my parents never gave me that. Instead, my girlfriend became that person. At first, she gave me the space I required as a narcissist, but as she grew up she needed more space for herself. This became very apparent when she came to live with me. Since she could no longer give me the emotional attention and the validation I required I started to push her away, just like how I pushed my mom, my dad and my brothers away, and any other person who could not give me what I wanted. So in the last months of the relationship, I returned to my lone wolf state of being. Though I still loved my girlfriend, I wanted to make her happy and be with her. It feels like there are two persons in my head: the person I actually am (the mean self-centred narcissist) and the person I want to be (a loving boyfriend and successful man). This internal struggle is something I have had to deal with almost all my life. I want to be happy, I want to be successful, I want to fulfill ambitions and dreams, I want to love and be loved, but something inside me keeps me from doing all that. So now I’m unhappy, I am depressed, I have not achieved the things I want, I am slacking behind my peers, I do not feel mature, I lost my girlfriend, I fear I’ll never get her back because I cannot be the man she wants me to be,  I have anxiety issues, I don’t know what I really want in life, and I feel like I have no place in this world. To put it differently; I feel like a shell, a vessel caryring two conflicting personalities that is dysfunctional and should not exist. I am lost.**\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 380497, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I feel like I am dysfunctional and should not exist.", "url": "https://www.reddit.com/r/depression/comments/99jvjc/i_feel_like_i_am_dysfunctional_and_should_not/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1534383966, "domain": "self.askwomenadvice", "full_link": "https://www.reddit.com/r/askwomenadvice/comments/97o582/my_gf_19f_broke_up_with_me_24m_is/", "id": "97o582", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 18, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/askwomenadvice/comments/97o582/my_gf_19f_broke_up_with_me_24m_is/", "pinned": false, "pwls": 6, "retrieved_on": 1534383967, "score": 1, "selftext": "TL;DR: My (24M) ex (19F) broke up with me because she didn't love me anymore, but she also had the urge to explore/experiment. Is this natural for a young woman and can it be enough to break a relationship (even if a boyfriend is perfect)?\n\nI (24M, Dutch) got broken up with by my girlfriend (19F, German) at the end of May this year after almost 3 years of relationship. After 2,5 years of LDR, in January 2018, she came to live with me in the Netherlands (during the LDR we saw each other almost every month; usually for a weekend, but mostly 1 or 2 weeks and in the summer for 2 months; so we saw each other quite a lot). In March, after about 2,5 months, she wanted to break up with me for the first time, but she gave me a second chance. In April things went really well, there was a lot of love from both sides; things seemed normal again. Though, at the end of May she broke up with me again for the last time. She told me on both occasions that she didn't love me anymore. \n\nI think she didn't love me anymore because: I took her for granted, I was immature, I wasn't a real man for her, the love and intimacy during sex faded, we had small fights (nothing too serious, but just a lot so we would be annoyed and pissed at each other). Plus: we temporarily lived together with my dad who she did not like nor did she feel at home, we could not find our own place quickly enough, we hardly saw each other during the work week (1 hour before bed only), we didn't spend quality time together in the weekends, she had to travel 3 hours in total every day from home to work and vica versa, she made new friends at her work in Amsterdam (a rather fun city) whom she wanted to hang out with (which she did but she had little time to do so).\n\nBesides her fading love for me, she was also curious about how life would be as a free single woman. This desire/idea of exploring/experimenting was already on her mind long before she moved to me. I was aware of this. After all, I was her first boyfriend. So I thought it would be normal for her to have these thoughts. I even suggested an open relationship when she went to Australia for 3 months, but she didn't want to do it because she loved me and could not imagine sleeping with someone else. \n\nNow I think that in the last months of the relationship when things weren't going so well she was weighing her love for me against her urge to explore. Here are some signs she gave me which I think show this urge to explore plus her fading love for me or her desire to be more loved by me:\n\n- The first time she wanted to break up she also told me she wanted to 'feel love in different places'. She later explained that it was not about feeling a certain amount of love, but different ways of love (when I took her on a surprise dinner date some time after that she absolutely loved it).\n\n- She asked me what I would think of her kissing another girl (she saw it at a party). I said I was okay with it as long as she told me when and with who. As far as I know, it never happened.\n\n- She told me about this lesbian colleague who seemed interested in her. She joked about starting a new life in the lesbian jungle with her. I later jokingly said she should kiss her then. She then said she is not lesbian and that kissing another girl was only an idea, not some fantasy.\n\n- She stayed a night at her lesbian colleague's place and came home the next morning, wanting to be with me.\n\n- She told me that she gives in the relationship and I take.\n\n- She told me she could not write a love song about me and jokingly said that we suck (as a couple).\n\n- She asked me on numerous occasions to make sweet love to her, to cuddle her, and to simply be with her. She told me she loved me and missed me several times. So she was really trying to show affection, especially in April.\n\n- She stayed a night at a gay friend where she drank wine, smoked weed and played songs on the guitar all night. When I asked her why she stayed up so late at his place while always going to bed early at my place she responded that I could not offer her wine, weed and songs.\n\n- Due to some of these events, I asked her if she cheated, but she simply had to laugh as if it was a ridiculous question and then just calmly told me no. There were also no real signs she cheated. She wasn't secretive about anything, she didn't avoid me, she wasn't on her phone a lot, she didn't change her appearance drastically, she only stayed at friends in Amsterdam 4 times, she was fine with physical and sexual contact (even the hours after she broke up with me).\n\nI know this all sounds a bit vague, but my theory is that she felt conflicted with herself. She didn't want to give up on the relationship, she wanted to love me and be loved, but she also had this urge to explore/experiment. I think the latter outbalanced the former in the end and so she decided to break up.\n\nNow I have two questions regarding this topic:\n\n1. Is it really natural for young women to have this desire to (sexually) explore/experiment?\n\n2. Can this desire become so overwhelming that a young woman wants to break up with her boyfriend (even if he is the perfect boyfriend for example)?\n\nObviously, I feel a bit lost because we had such a great relationship for such a long time. I had hopes to be with her for the rest of my life as we really fit well together (though of course she thinks differently now). Now I feel as if the relationship was doomed from the start because she would want to explore/experiment at some point anyway. It also feels like the first real obstacle in our relationship was already enough reason for her to take the opportunity to be single and explore/experiment. Don't get me wrong though. I want her to be happy and I think she should go out there and have her time to explore/experiment. My only fear is that I have lost her forever because she needs to fulfill this desire until she is eventually ready to settle down, but that she won't settle down with me because I'm her ex or because the opportunity will never present itself. In the meantime, I want to work on myself to be a better version of myself so my chances to get back with her will increase. Though it's no guarantee and the uncertainty is eating me up from the inside.\n\nI hope you can give some insights and advice. Thanks.\n", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "askwomenadvice", "subreddit_id": "t5_30m5u", "subreddit_subscribers": 85514, "subreddit_type": "public", "thumbnail": "self", "title": "My GF (19F) broke up with me (24M). Is exploring/experimenting as a young woman really that important?", "url": "https://www.reddit.com/r/askwomenadvice/comments/97o582/my_gf_19f_broke_up_with_me_24m_is/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1533330619, "domain": "self.offmychest", "full_link": "https://www.reddit.com/r/offmychest/comments/94dh1q/the_love_of_my_life_broke_up_with_me_and_i_want/", "id": "94dh1q", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "house_only", "permalink": "/r/offmychest/comments/94dh1q/the_love_of_my_life_broke_up_with_me_and_i_want/", "pinned": false, "pwls": 1, "retrieved_on": 1533330621, "rte_mode": "markdown", "score": 1, "selftext": "About 2 months ago my gf of almost 3 years broke up with me. We met online. She was 16 living in Germany and I was 21 living in the Netherlands. She initially invited me over to have fun, but we fell in love and decided for a long distance relationship (LDR). We had a near perfect LDR for 2,5 years. Finally, in January this year she came to live with me. We were so happy. Though things quickly turned bad. Even though we were used to being together for long periods of time (2 month of constantly being together for example), it didn't work out the way we wanted. We both got full time jobs but with different time schedules. So we barely saw each other during the workweek. Then in the weekends we failed to spend quality time together. She also didn't feel comfortable at home, because we lived with my dad. We were looking for our own place, but we had no luck. We didn't have big fights, just small fights that would increasingly frustrate us. Due to my narcissistic behaviour, I pushed her away and took her for granted (I didn't recognize that at the time; didn't even realize I was a narcissist). She even gave me a second chance, but I failed to fix the issues since I didn't know what was wrong. Besides all that, she is only 19 now and I was her first ever boyfriend. She had occasional thoughts of exploring and experimenting with other people, but she loved me so she wouldn't leave. Though in the last few months in the relationship her love for me obviously faded and the single life became more attractive to her (also due to her new work/social environment). Anyway, she broke up with me, saying she doesn't love me anymore; that she doesn't believe I can make her happy; that she can't commit to a lifelong relationship now; that she thinks we don't fit together in our core. I was shocked and heartbroken. I truly and deeply love her and I admit that I made a lot of mistakes in the last months of the relationship. I wish I could go back and do everything differently because I feel an enormous amount of guilt towards her. I also know that a lot of the mistakes I made come from my own emotional instability (e.g. narcissism). Since the break up I have thought of her every day, I cried, I hurt myself, I even want to kill myself sometimes. I feel incredibly depressed and very conflicted. I know that I have to let her go for now. She needs to do what she wants to do and in the meantime I need to work on myself. She does want to stay good friends with me, but atm she doesn't want me back and she said it's unlikely that we'll get together. She reluctantly agreed with me that it could happen if the situation and if I change. So I know there is a chance of getting her back. She loved me once, so she can love me again. Though there is also a chance I'll never get a proper opportunity to get back with her again. So now I'm faced with all this uncertainty. I cannot imagine being without her for years to come and having to deal with all the uncertainty. At this point I feel hopeless... ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "offmychest", "subreddit_id": "t5_2ranw", "subreddit_subscribers": 590271, "subreddit_type": "public", "thumbnail": "self", "title": "The love of my life broke up with me and I want her back, but I don't know if that will ever happen...", "url": "https://www.reddit.com/r/offmychest/comments/94dh1q/the_love_of_my_life_broke_up_with_me_and_i_want/", "whitelist_status": "house_only", "wls": 1}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1530403621, "domain": "self.relationship_advice", "full_link": "https://www.reddit.com/r/relationship_advice/comments/8v6371/23m_ex_19f_keeps_contacting_me_why/", "id": "8v6371", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 1, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationship_advice/comments/8v6371/23m_ex_19f_keeps_contacting_me_why/", "pinned": false, "pwls": 6, "retrieved_on": 1530403622, "rte_mode": "markdown", "score": 1, "selftext": "Recently, in the beginning of June, my ex [19/f] broke up with me [23/m] after a relationship of 2 years and 9 months. We had a LDR for 2,5 years which worked perfectly (I met her when she was 16 and I was 21; quite the age difference I know; also her first boyfriend). \n\nJanuary this year she moved from Germany to the Netherlands to live with me (and my dad, because I still lived with him to save money). The plan was, of course, to find our own place ASAP. I was still studying and doing an internship and she got a full-time job (she didn't want to start studying yet). \n\nAfter about 2,5 months we got into a small fight and she then told me she didn't love me anymore and wanted to break up (around the end of March). I was baffled. I knew the situation wasn't ideal. She didn't feel really comfortable at my place, she couldn't get along with my dad, she had to travel 2 hours each day to her work, our work schedules didn't match so we only had 1 hour before bed each work day to spend together. In the weekends we tried spending more time together, but we also wanted our time alone. Besides that, I had other responsibilities as well and she wanted to hang out with her friends. In general, our relationship became routine, it became a drag. Despite the little arguments and fights we had, the interaction between us was really good. We could always laugh together and just chill; like really good friends. Perhaps too much like friends, because the love and intimacy faded. So she impulsively wanted to break up. I was able to convince her to not give up. So we continued our relationship, but I didn't know what was actually wrong except for the fact that she didn't love me as much anymore. We never had a good talk about our relationship problems, because I was mostly blind to them and she didn't communicate. \n\nIn the following month, in April, things were getting back to normal. There was love and intimacy again, we could finally start looking for our own place, and we had more quality time together. Sadly, in May, things started to return to the routine and so things got worse. Half-way May we still hadn't found a place as it is very tight housing market here and we simply got rejected because we weren't high earners. I then suggested to each find our own place (like a room/student housing), and then in the meantime save for a house. Later, post break up, I found out that she thought I wanted to stay at my dad's place and save for a house for the next few years. Due to that misunderstanding, she got scared, felt confined, and thus made the decision to find her own place in the city she works in; without telling me. Two weeks later I found her stuff packed, she broke up with me and moved out the next day. \n\nI was baffled again. I tried to convince her again, but she was having none of it. She didn't believe in me anymore and she didn't love me enough anymore. I helped her move and it was an emotional day. She tried to act strong, but she still had to cry. I then suggested we should take a break instead of break up. She agreed. Before we said goodbye we still hugged and kissed. \n\nIn the following days, I made the mistake to text her and call her since I was too emotional. She was then a bit pissed of course and she broke up with me. I still managed to get her to meet up with me, but I was not gonna beg her to come back to me. Instead, I told her how I felt about the relationship and asked how we can go on from here. She was positively surprised by my mature and sensitive approach because she thought I was gonna beg and plead to her. We decided there to stay friends. We would have a period of no contact; she would initiate the first contact because she broke up with me. Saying goodbye that day was a bit odd because we hugged, but she wanted to hug longer than I did and she even told me I could kiss her on the cheek. I then walk towards my car, after a few meters I looked over my shoulder. She was surprisingly still standing there holding the door and smiling. I smiled back. I found it odd because I sensed quite some feelings on her side there.\n\nAfter 6 days of no contact, she contacted me again. We had a friendly and fun conversation. I asked her if I could call her the next day and she surprisingly agreed. It was a decent conversation on the phone. Although, she wasn't sharing all too much and she was also distracted since she was riding her bicycle at the same time. I asked her if she wanted to meet up next week, but she said \"Maybe I'll have to see\"; to which I replied that I understood if it was too early. She agreed so no plans were made. That day was also her birthday and I had sent her a personalized card and a small bouquet of flowers (also for her new place). She loved both. We kept talking on and off about all kinds of things. Here and there I made some mistakes as I still sort of showed a desire for her. She, of course, was a bit put off by that. For the weekend she went home to Germany to visit family for her birthday. I decided to not bother her that weekend and wait until she contacts me again.\n\nThe Monday after she contacted me to thank me for giving her back the money for the car we bought together. We had a small conversation, but there was still quite some tension. I confronted her about the tension and said it was unnecessary; that we could be good friends and just hang out as before. She saw all of that, but she doesn't want to call and hang out so much. She just wants to text now and then, because she doesn't have the need to share so much information with me or see me so often. That hurt a bit, but I accepted it.\n\nI didn't speak to her for a few days until she contacted me again to ask if her dad could pick up some remaining stuff of hers at my place the next week on Saturday. I asked if just her dad was coming. She said she would also try to be there, but she wasn't sure because she had to work till 4 pm. I told her it wasn't necessary for her to come as it would only take a few mins. Still, she said she would do her best to come. After that, we talked during the weekend on and off. On Sunday I had texted her funny gif but didn't speak to her after that.\n\nNow here's the thing. I haven't contacted her out of my own initiative once since the moment we decided to stay friends, because I wanted to give her space and time; she would set the pace. She had contacted me 3 times so far. The first time because we decided she should contact me first when she felt like it, the second time because of the money I returned, and the third time because of the stuff that had to be picked up. So she contacted me mostly out of politeness and because of practical matters. I took all that as a sign that she isn't really interested in talking to me. Of course, we had conversations, but it wasn't the same. She also gave mixed signals. Sometimes she was laughing and seemed interested, but then suddenly she got a bit cold and gave short replies, often killing the conversation. So I expected her to not contact me until the day her dad would come and pick up her stuff. Surprisingly, she contacted me on Thursday already to ask me what my vacation plans are (something I mentioned somewhere before in one of our post-breakup conversations). We talked a bit; she seemed interested; we had a laugh, but then again she killed the convo with a slightly cold and short reply. Later she messaged me that her dad would come at 2 pm on Saturday so she couldn't be there. She didn't apologize for it nor did she seem sad about it.\n\nToday was that Saturday. She contacted me to tell me her dad would come later due to being delayed. When he came I  helped him with putting her stuff in his van and then said goodbye. It was all friendly and ok. It wasn't even very awkward, but just a bit weird. My ex then thanked me (twice) over text in a warm way for helping her dad. Since then I haven't spoken to her.\n\ntl;dr\nMy ex keeps contacting me sporadically over the past month after having broken up with me. At first, it seemed she contacted me out of politeness or because of practical matters, but then she actually contacted me to ask about my vacation plans. I find this odd because in our conversations she gives off mixed signals where she seems interested at first, laughs with me, replies to my messages, but then she kills the conversation with a short and somewhat cold reply.\n\nSo now my question is: Why would she keep contacting me while she seems uninterested? I really don't understand it. I thought she only contacted me to get those practical matters solved and then just have a conversation out of politeness. ", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationship_advice", "subreddit_id": "t5_2r0cn", "subreddit_subscribers": 637825, "subreddit_type": "public", "thumbnail": "self", "title": "[23/m] Ex [19/f] keeps contacting me. Why?", "url": "https://www.reddit.com/r/relationship_advice/comments/8v6371/23m_ex_19f_keeps_contacting_me_why/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "can_mod_post": false, "contest_mode": false, "created_utc": 1528450169, "domain": "self.relationships", "full_link": "https://www.reddit.com/r/relationships/comments/8piin9/me_23_m_with_my_gf_19_f_for_almost_3_years_she/", "id": "8piin9", "is_crosspostable": true, "is_original_content": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_css_class": "new", "link_flair_richtext": [{"e": "text", "t": "[new]"}], "link_flair_text": "[new]", "link_flair_text_color": "dark", "link_flair_type": "richtext", "locked": false, "media_only": false, "no_follow": true, "num_comments": 7, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/relationships/comments/8piin9/me_23_m_with_my_gf_19_f_for_almost_3_years_she/", "pinned": false, "pwls": 6, "retrieved_on": 1528450170, "rte_mode": "markdown", "score": 1, "selftext": "TL;DR: My girlfriend (19) left me (23) because she didn't love me anymore. She moved in with me and my dad after a 2 year long distance relationship. The home situation got worse because of our busy lives and my dad who could not get along with her. She wanted to break up with me 2 months after she moved in. I convinced/begged her to stay. We gave it a new go, looked for ouw place. It worked for a while, but didn't find a place and then we got back into the same toxic situation. She then found her own place without telling me, left me and recently broke up with me again. We are still good friends and we had good talk about it all, but I still want her. Can I get her back and how?\n\nSo here's the deal. My ex and I had been together for 2 years and 9 months. I got to know her online when she was 16 and I was 21 (quite the age difference I know). She lived in Germany back then and I lived in the Netherlands. We visited each other as much as we could; at least once a month for a weekend, week(s) or sometimes even 2 months. We had a great time and we made it work out perfectly. \n\nThen after 2 years she went on a 6 month trip to Australia with her sister which she had planned before she even met me. However, things didn't work out and she came back after about 3 months. Now that she was back we could finally make our dream come true of living together. She would move to the Netherlands to get a job there and study there. I was already finishing my studies and then I would get a full-time job.\n\nShe moved her in January 2018. The problem was: I still lived with my dad because of financial preferences and since there was a lot of space in the house she could move in with us. It was never a permanent idea, only temporary. We planned on looking for our own place. She couldn't get along with my dad though and she felt more and more uncomfortable at my place. Luckily she got a great job in Amsterdam, she met some people there and now had a place to go to. She started avoiding my place as much as she could. \n\nHalf way in March when she was already working full-time, I got a full-time internship. Problem now was that I would be working from 9-5, but she'd be working from now 14-22. We barely saw each other during the workweek, only an hour before bed and in the morning I could only kiss her goodbye. In that hour before bed we usually were both tired and we didn't really have quality time to spend, we would also get annoyed easily and it would sometimes result in little fights that we then would just sleep over and never talk about.\n\nAt the end of March she came home late and a bit tipsy, I made a wrong comment and we got into a fight. She then blurted out she wanted to break up. I was shocked. I tried to change her mind, but she wouldn't have it. Only the next day when I broke down in tears and basically begged her to stay, she stayed. We promised each other to give it another try.\n\nThe month or so after that was pretty great. There was love again and we did fun things. We put more energy in our relationship. We also finally had all the papers ready to look for a place of our own. During that month we had no luck finding a place however. We slowly started getting back into our routine and it became a drag again. We would get annoyed with each other again.\n\nHalfway May we again had no luck finding a place for ourselves. I wanted to talk to her. I told her that it doesn't seem to work and I would rather save for buying a house or that we both get a place of our own (which would be easier). At that point she made a decision without me knowing. She started looking for a place in Amsterdam for herself. She found one with quite some luck within 2 weeks.\n\nThen on Friday the 1st of June I discovered that she had packed all her stuff. Again I was shocked. When she came home she told me she'd be leaving the next day and wanted to break up with me. It broke my heart, I tried to convince her to not break up with me, but she would not have it.\n\nThe next day I didn't want to be an ass. I understood her choice to move so I helped her move. She was actually surprised by that. Then in the car I wanted to have a serious talk. There I convinced her that we should take a break. She agreed, but we never really were clear on what it meant and how it would work. We would give each other space and time. Though stupid me could not take it. I missed her badly and I couldn't deal with the uncertainty. \n\nI then called her on Monday night in an emotional state. I had thought things over a lot and wanted to talk to her. She wasn't all too happy that I contacted her; she wanted to break up and not talk to me. I still managed to convince her to talk to me face to face.\n\nOn Wednesday the 6th of June we met up. I had written down everything I thought went wrong at memorized it. First I apoligized for my desperate call on Monday. Then, I told her that we made a mistake by going from a long distance relationship to living together, especially with my dad. It was a toxic environment for both of us which caused lots of frictions between us. I failed as a boyfriend by not giving her enough attention and making her feel comfortable at home (I was completely blind to it all though, because I was busy myself and felt stressed and tired). She admitted it was also her fault. She didn't communicate with me and she also felt stressed and tired. Besides that, she really wanted to have a place for ourselves or at least herself to be independent and have the privacy we need. Either way, over these past months she lost her love for me. We still hugged, kissed and had sex, but there was no intimacy. She still had feelings for me and I believe she still does, but it is not enough to love me.\n\nThe talk we had on Wednesday was however very chill. It was a sunny day, we took a walk in a nice park, sat by the water and just talked. We don't hate each other, we actually get along really well and are able to laugh together. It feels now that we are just good friends and we also want to stay good friends. During our conversation, I asked her if she saw the possibility to get back together at some point. Initially, she said it was unlikely because she thinks the relationship would be the same as over the past months and end up in nothing. I convinced her that things change and so will we; and that we should stay open for our feelings for each other and consider getting back together with an open mind. She agreed with me there and we promised each other to take that approach.\n\nThe reason she thought we can't get back together is that our personalities don't match as well as she thought. We do balance each other out. She is more impulsive and creative, I'm more calm and calculative. It always worked until now. I think that when we lived together our personalities just clashed because we were too focused on our selfs due to the stress and tiredness. It all pulled us apart. \n\nShe also mentioned that we have different ideas for our lives. She wants to work a bit, travel more, experience things, and don't live according to strict plans and commit to them. She thought I do want that; that I want to just get a job, a house, kids and whatnot. Though I told her that isn't the case. I also want to do what she wants. Only when we're older I want a nice house. She said she want to go to Canada and I said I want that too. She was surprised by that.\n\nShe was actually surprised by how I was during the whole conversation. She thought I would beg her again to come back. Instead, she said I behaved really mature, was very sensitive and understanding of her and the issues we have. I told her that I am proud of her, how she has matured over the years. There is mutual respect.\n\nWhen we got back to her place it was time to say goodbye. We made a deal on how to continue our friendship. We decided that she should be the one to contact me first because she broke up with me (she probably will next week). I will only send her a surprise for her birthday next week (a personalized card and a small bouquet of flowers). Then we will slowly start talking more if it feels good and will also hang out together and with friends. We'll see from there. We hugged each other tightly and said goodbye. I was walking towards my car and she was at the door of her place. After a few meters, I looked over my shoulder and she was still standing there holding the door and smiling at me and I smiled back.\n\nI have a good feeling about it. Still, I do want her back. She means the world to me and I want to make right what I did wrong and also the rest that went wrong in our relationship. If I could take her back now, I would, but I can't be too pushy about it. I know it's gonna take quite some time. I do think it's possible to have a great relationship when she lives in Amsterdam and I live at my own place. It's only an hour or so apart. We could have our own time during the workweek and then spend actual quality time in the weekends. That's how I envision it.\n\nNow the question is:  Do you think it is possible to make it work like this, to get back together? And how would you do it?\n\nHope you guys can help me out.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "relationships", "subreddit_id": "t5_2qjvn", "subreddit_subscribers": 1241146, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "Me [23 M] with my gf [19 F] for almost 3 years, she broke up with me; I need advice to get her back", "url": "https://www.reddit.com/r/relationships/comments/8piin9/me_23_m_with_my_gf_19_f_for_almost_3_years_she/", "whitelist_status": "all_ads", "wls": 6}, {"author": "UnfoundHound", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517954847, "domain": "youtube.com", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7vr35e/spacex_just_launched_their_falcon_heavy_and/", "id": "7vr35e", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": false, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": true, "media": {"oembed": {"author_name": "Guardian News", "author_url": "https://www.youtube.com/user/guardianwires", "height": 338, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/99llRhH71vA?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/99llRhH71vA/hqdefault.jpg", "thumbnail_width": 480, "title": "Watch live: SpaceX launch Falcon Heavy", "type": "video", "version": "1.0", "width": 600}, "type": "youtube.com"}, "media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/99llRhH71vA?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "scrolling": false, "width": 600}, "num_comments": 41, "num_crossposts": 1, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7vr35e/spacex_just_launched_their_falcon_heavy_and/", "pinned": false, "post_hint": "rich:video", "preview": {"enabled": false, "images": [{"id": "6_Yy2VmgNPOiFz8uuEid1z58glS_v7ZJgktWbL6YOlU", "resolutions": [{"height": 81, "url": "https://i.redditmedia.com/qjqs18CLGo-Rkc1x1JacGfZaIqTJqeqob24Mk9x4Nbo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=108&amp;s=cf09f1d5a8eff95cadf831b84bafa176", "width": 108}, {"height": 162, "url": "https://i.redditmedia.com/qjqs18CLGo-Rkc1x1JacGfZaIqTJqeqob24Mk9x4Nbo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=216&amp;s=3ae5ef4f9a2f7982ee59d7fa01dc7fa2", "width": 216}, {"height": 240, "url": "https://i.redditmedia.com/qjqs18CLGo-Rkc1x1JacGfZaIqTJqeqob24Mk9x4Nbo.jpg?fit=crop&amp;crop=faces%2Centropy&amp;arh=2&amp;w=320&amp;s=266f9b691ea4fbdb3c6522f41e598387", "width": 320}], "source": {"height": 360, "url": "https://i.redditmedia.com/qjqs18CLGo-Rkc1x1JacGfZaIqTJqeqob24Mk9x4Nbo.jpg?s=c9c7bb42e92bb1384311c961a384039a", "width": 480}, "variants": {}}]}, "retrieved_on": 1518015695, "rte_mode": "markdown", "score": 442, "secure_media": {"oembed": {"author_name": "Guardian News", "author_url": "https://www.youtube.com/user/guardianwires", "height": 338, "html": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/99llRhH71vA?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen&gt;&lt;/iframe&gt;", "provider_name": "YouTube", "provider_url": "https://www.youtube.com/", "thumbnail_height": 360, "thumbnail_url": "https://i.ytimg.com/vi/99llRhH71vA/hqdefault.jpg", "thumbnail_width": 480, "title": "Watch live: SpaceX launch Falcon Heavy", "type": "video", "version": "1.0", "width": 600}, "type": "youtube.com"}, "secure_media_embed": {"content": "&lt;iframe width=\"600\" height=\"338\" src=\"https://www.youtube.com/embed/99llRhH71vA?feature=oembed\" frameborder=\"0\" allow=\"autoplay; encrypted-media\" allowfullscreen&gt;&lt;/iframe&gt;", "height": 338, "media_domain_url": "https://www.redditmedia.com/mediaembed/7vr35e", "scrolling": false, "width": 600}, "selftext": "", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "https://b.thumbs.redditmedia.com/gC1OvCOTYDrRjqdoT_ITldfFzFPjIt5-ZqGzY3v435s.jpg", "thumbnail_height": 105, "thumbnail_width": 140, "title": "SpaceX just launched their Falcon Heavy, and Bitcoin rockets back up. Coincidence? I think not. To Mars!", "url": "https://www.youtube.com/watch?v=99llRhH71vA", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_background_color": "", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_text_color": "dark", "author_flair_type": "text", "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1517322998, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7u1etk/what_is_going_on/", "id": "7u1etk", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "num_comments": 42, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7u1etk/what_is_going_on/", "pinned": false, "retrieved_on": 1517369762, "rte_mode": "markdown", "score": 0, "selftext": "Why is Bitcoin still going down in price significantly? Of course, I'm not saying we should already skyrocket to the moon, but I feel like the price is constantly being pushed down and is not allowed to go above $12.000 while I actually expected it to slowly recover. Obviously, the market is irrational, but does anyone have an explanation or idea for why it's dropping?", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "self", "title": "What is going on?", "url": "https://www.reddit.com/r/Bitcoin/comments/7u1etk/what_is_going_on/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1516162891, "domain": "self.ethereum", "full_link": "https://www.reddit.com/r/ethereum/comments/7qygix/etherchain_call_transaction/", "id": "7qygix", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 2, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/ethereum/comments/7qygix/etherchain_call_transaction/", "pinned": false, "retrieved_on": 1516227739, "score": 0, "selftext": "So I recently received some Ether in my wallet, but the transaction type on Etherchain says 'Call' while an earlier transaction says 'Tx'. What does this mean? And what is the difference?", "spoiler": false, "stickied": false, "subreddit": "ethereum", "subreddit_id": "t5_2zf9m", "subreddit_type": "public", "suggested_sort": "top", "thumbnail": "self", "title": "Etherchain 'call' transaction?", "url": "https://www.reddit.com/r/ethereum/comments/7qygix/etherchain_call_transaction/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1515540530, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7pbai5/why_is_bitcoin_dropping/", "id": "7pbai5", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 11, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7pbai5/why_is_bitcoin_dropping/", "pinned": false, "retrieved_on": 1515606995, "score": 3, "selftext": "I have been on vacation recently so I have not caught up with the news. Looking at the charts I'd say Bitcoin should be acting bullish.", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "self", "title": "Why is Bitcoin dropping?", "url": "https://www.reddit.com/r/Bitcoin/comments/7pbai5/why_is_bitcoin_dropping/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1515540263, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7pb9fj/why_are_btc_ltc_and_xrp_dropping/", "id": "7pb9fj", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7pb9fj/why_are_btc_ltc_and_xrp_dropping/", "pinned": false, "retrieved_on": 1515606220, "score": 1, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "default", "title": "Why are BTC, LTC, and XRP dropping?", "url": "https://www.reddit.com/r/Bitcoin/comments/7pb9fj/why_are_btc_ltc_and_xrp_dropping/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1513751057, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7kzlts/bitcoin_christmas/", "id": "7kzlts", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7kzlts/bitcoin_christmas/", "pinned": false, "retrieved_on": 1513814304, "score": 7, "selftext": "So do people still believe we will get 20k by Christmas? :D\nI believe in 20k but not by Christmas. Also, HODL!", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "self", "title": "Bitcoin Christmas?", "url": "https://www.reddit.com/r/Bitcoin/comments/7kzlts/bitcoin_christmas/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1513580695, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7kjnmj/getting_annoyed_by_people/", "id": "7kjnmj", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 23, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7kjnmj/getting_annoyed_by_people/", "pinned": false, "retrieved_on": 1513640428, "score": 15, "selftext": "Don't get me wrong. I want Bitcoin or cryptocurrencies in general to be mass adopted, but with the recent hype so many people suddenly have an opinion on cryptocurrencies that it is just annoying me. People, including people I know personally, saying it is a bubble, that it has no true value, that it is a scam, etc. Then when I look at who these people are... most of them are not even slightly involved in cryptocurrencies and hardly know anything about it. Even so-called economists who suddenly pretend to be experts on the subject. Sorry for the rant. Have you guys had similar experiences recently?", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "self", "title": "Getting annoyed by people", "url": "https://www.reddit.com/r/Bitcoin/comments/7kjnmj/getting_annoyed_by_people/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1512501567, "domain": "i.redd.it", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7hs19n/so_close_guys/", "id": "7hs19n", "is_crosspostable": false, "is_reddit_media_domain": true, "is_self": false, "is_video": false, "link_flair_text": "price", "locked": false, "num_comments": 0, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7hs19n/so_close_guys/", "pinned": false, "retrieved_on": 1512581066, "score": 1, "selftext": "", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "subreddit_type": "public", "thumbnail": "default", "thumbnail_height": 60, "thumbnail_width": 140, "title": "So close guys", "url": "https://i.redd.it/yxjwtbk2m5201.jpg", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1511547293, "domain": "self.BitcoinBeginners", "full_link": "https://www.reddit.com/r/BitcoinBeginners/comments/7f988z/looking_for_an_exchange_to_trade_on/", "id": "7f988z", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 3, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/BitcoinBeginners/comments/7f988z/looking_for_an_exchange_to_trade_on/", "pinned": false, "retrieved_on": 1511632244, "score": 3, "selftext": "Can anyone recommend a decent exchange that can be accessed in the Netherlands and also allows exchanging bitcoin for FIAT?", "spoiler": false, "stickied": false, "subreddit": "BitcoinBeginners", "subreddit_id": "t5_2wju0", "thumbnail": "self", "title": "Looking for an exchange to trade on", "url": "https://www.reddit.com/r/BitcoinBeginners/comments/7f988z/looking_for_an_exchange_to_trade_on/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1510763825, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7d5a40/still_waiting_for_the_real_dip/", "id": "7d5a40", "is_crosspostable": true, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "locked": false, "num_comments": 13, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7d5a40/still_waiting_for_the_real_dip/", "pinned": false, "retrieved_on": 1510843141, "score": 2, "selftext": "Guess I'll wait forever. Too late to buy now I guess.", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "thumbnail": "self", "title": "Still waiting for the real dip...", "url": "https://www.reddit.com/r/Bitcoin/comments/7d5a40/still_waiting_for_the_real_dip/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1509612423, "domain": "self.Bitcoin", "full_link": "https://www.reddit.com/r/Bitcoin/comments/7aa8mg/best_way_to_store_coins/", "id": "7aa8mg", "is_crosspostable": false, "is_reddit_media_domain": false, "is_self": true, "is_video": false, "link_flair_text": "faq", "locked": false, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/Bitcoin/comments/7aa8mg/best_way_to_store_coins/", "pinned": false, "retrieved_on": 1509691757, "score": 0, "selftext": "[removed]", "spoiler": false, "stickied": false, "subreddit": "Bitcoin", "subreddit_id": "t5_2s3qj", "thumbnail": "default", "title": "Best way to store coins?", "url": "https://www.reddit.com/r/Bitcoin/comments/7aa8mg/best_way_to_store_coins/", "whitelist_status": "all_ads"}, {"author": "UnfoundHound", "author_flair_css_class": null, "author_flair_text": null, "brand_safe": true, "can_mod_post": false, "contest_mode": false, "created_utc": 1503446218, "domain": "self.btc", "full_link": "https://www.reddit.com/r/btc/comments/6vf5bn/bitcoin_to_fall_after_segwit_activation/", "id": "6vf5bn", "is_self": true, "is_video": false, "locked": false, "num_comments": 7, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/btc/comments/6vf5bn/bitcoin_to_fall_after_segwit_activation/", "retrieved_on": 1503528294, "score": 3, "selftext": "So with the Segwit activation coming up do you guys expect Bitcoin price to fall just like when Litecoin had its activation?", "spoiler": false, "stickied": false, "subreddit": "btc", "subreddit_id": "t5_2si5v", "thumbnail": "self", "title": "Bitcoin to fall after Segwit activation?", "url": "https://www.reddit.com/r/btc/comments/6vf5bn/bitcoin_to_fall_after_segwit_activation/", "whitelist_status": "all_ads"}]}