{"data": [{"author": "unknown098765", "author_flair_css_class": null, "author_flair_richtext": [], "author_flair_text": null, "author_flair_type": "text", "author_fullname": "t2_2e5zx8e3", "can_mod_post": false, "contest_mode": false, "created_utc": 1539283899, "domain": "self.depression", "full_link": "https://www.reddit.com/r/depression/comments/9ncqs6/i_want_to_die/", "gildings": {"gid_1": 0, "gid_2": 0, "gid_3": 0}, "id": "9ncqs6", "is_crosspostable": true, "is_meta": false, "is_original_content": false, "is_reddit_media_domain": false, "is_robot_indexable": true, "is_self": true, "is_video": false, "link_flair_background_color": "", "link_flair_richtext": [], "link_flair_text_color": "dark", "link_flair_type": "text", "locked": false, "media_only": false, "no_follow": true, "num_comments": 4, "num_crossposts": 0, "over_18": false, "parent_whitelist_status": "all_ads", "permalink": "/r/depression/comments/9ncqs6/i_want_to_die/", "pinned": false, "pwls": 6, "retrieved_on": 1539283901, "score": 1, "selftext": "I am 14 years old, I'm nearly 15. I have been diagnosed with bipolar depression. I was also diagnosed with Autism when I was 7. Recently I changed schools, I met a guy and he was amazing and we got together. I thought I really loved him but I was wrong. He used me for his only sexual pleasures. I didn't actually have sex if that's what your thinking... but we did do other stuff which i didn't like. This guy I was with was in my friends group and was jealous of another guy I was friends with. When I was upset my friend was there for me when my boyfriend wasn't. \n\nMy group of friends was bullied and they told my boyfriend that we were \" A downgrade\" and \"Not popular enough\" for him, and he listened. But he still wanted to be with me and also left because of my friend. Me and my boyfriend spoke in class and met up a few times but he felt we were growing apart and was getting more jealous of my friend... And he was right to. Later that night my friend text me saying that he was upset and I wanted to help, but he said the only way for me to help him was for me to send him... nudes. I said no and he got really angry and so did my boyfriend when I told him. \n \nMy boyfriend didn't do anything to him but because he was jealous and upset he dumped me. I was really sad and now I know I can't take back everything I did with him. My boyfriend made me do things to him and did things to me which scared me. The next day after he dumped me I went into school and him and his friends were looking at me and laughing at me and it was updating. Then later that day one if his friends called me a \"slut\" \"whore\" which mentally broke me. It turns out my boyfriend leaked stuff about me and told people about my friend asking me for pictures.\n\nI'm lost right now and I don't know what to do. I have been self harming and refusing to leave the house because of anxiety. When I was 10 I was in a car accident which led to my leg breaking and I haven't been able to do physically activities because of surgeries. Since then I have out on weight because of past problems and I have stretch marks. And people have been bullying me for it. I know have scars all over my body from self harming. Growing up I had many problems...\n* dad getting arrested for phedophelic stuff towards me.\n* Mum getting seriously ill.\n* Grandad dying from cancer.\n*Car accident.\n*Past school bullying.\nEct.\n\nI feel at the moment the only way out is suicide...\nBut im actually scared and My family doesn't care. I don't know what to do Any more... Please help.", "send_replies": true, "spoiler": false, "stickied": false, "subreddit": "depression", "subreddit_id": "t5_2qqqf", "subreddit_subscribers": 394922, "subreddit_type": "public", "suggested_sort": "confidence", "thumbnail": "self", "title": "I want to die...", "url": "https://www.reddit.com/r/depression/comments/9ncqs6/i_want_to_die/", "whitelist_status": "all_ads", "wls": 6}]}